
&НаКлиенте
Процедура Записать(Команда)
	// Вставить содержимое обработчика.
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		стррПараметры = Новый Структура("Наименование, Номенклатура, Коэффициент", Наименование, Номенклатура, Коэффициент);
		Закрыть(стррПараметры);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	// Вставить содержимое обработчика.
	 Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

