
#Область ГлобальныеПеременные

	Перем гБазоваяКонфигурация;
	Перем гКонфигурация;
	Перем гТаблицыВидовОбъектов;	// структура с таблицами значений идентификаторов видов справочников и документов в МТ и соответствия им в УТ
	Перем гТаблицыПеречислений;		// структура с таблицами значений перечислений соответствий 
	Перем гСлужебныеДанныеВФайлах; 	// признак сохранения служебных данных модуля в файлах (если значение Истина) или в Хранилище (если Ложь)
	Перем гКэшЧтенияКонстант; 		// кэш для ускорения чтения констант из БД
	Перем гКэшСравненияКонфигураций;
	Перем гКэшРеквизитыОбъектов;
	Перем гКэшСпискиОбъектов;		// кэш списков объектов (для выгрузки и отборов, например, массив организаций)
	Перем гЭтоLinuxСервер; 			// для ускорения работы функции ЭтоLinuxСервер
	Перем гДанныеОДополнительныхСвойствахДокументаДляМУ; // для ускорения записи дополнительных свойств документов при загрузке документов из МУ
	Перем гОбновитьСпрХарактеристикиНоменклатурыСлужебный; // признак изменения временной таблицы характеристики номенклатуры.
	Перем гтзУпаковки;              // таблица упаковок, для ускорения работы при загрузкедокументов
	Перем гВДокРеквизиты; 			// Соответствие - элементами соответствия являются массивы реквизитов виртуальных документов
	Перем гВДокКэшТЗЖурналов; 		// кэш таблиц значений, хранящих заголовочную часть виртуальных документов	
	Перем гВСпрКэшТЗСправочника;	// кэш таблиц значений, хранящих заголовочную часть элементов виртуальных справочников
	Перем гВОКэшСвойств; // кэш системных свойств виртуальных объектов (виртуальных справочников и документов)
	Перем гКэшСлужебныхТаблиц; // структура для служебных таблиц, используется при выгрузке служебных справочных данных в МУ
	Перем гмСкладыВыгрузки; // массив складов выгрузки для текущего торгового агента
	Перем гВидДокументаПоступлениеТоваровУслуг; // кэш результата функции ВидДокументаПоступлениеТоваровУслуг
	Перем гИспользоватьНаправленияДеятельности; // кэш результата функции гИспользоватьНаправленияДеятельности
	Перем гКэшАдресаДоставки;		// кэш адресов доставки
	Перем гКэшНастроек;				// кэш значений настроек из Хранилища системных настроек
	Перем гСоотвСклады;				// dm_180904 соответствие складов и кодов для выгрузки остатков
	
	
// ГлобальныеПеременные
#КонецОбласти
	

#Область СовместимостьСПлатформой_8_3_5

// Подставляет параметры в строку. Максимально возможное число параметров - 5.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров начинается с единицы.
//
// Параметры:
//  СтрокаПодстановки  - Строка - шаблон строки с параметрами (вхождениями вида "%ИмяПараметра");
//  Параметр<n>        - Строка - подставляемый параметр.
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
Функция СтрШаблон_(СтрокаПодстановки,
	Параметр1, Параметр2 = Неопределено, Параметр3 = Неопределено, Параметр4 = Неопределено, Параметр5 = Неопределено)
	
	Результат = СтрЗаменить(СтрокаПодстановки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат, "%2", Параметр2);
	Результат = СтрЗаменить(Результат, "%3", Параметр3);
	Результат = СтрЗаменить(Результат, "%4", Параметр4);
	Результат = СтрЗаменить(Результат, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции
	
// Разбивает строку на несколько строк по разделителю. Разделитель может иметь любую длину.
//
// Параметры:
//  Строка                 - Строка - текст с разделителями;
//  Разделитель            - Строка - разделитель строк текста, минимум 1 символ;
//  ПропускатьПустыеСтроки - Булево - признак необходимости включения в результат пустых строк.
//    Если параметр не задан, то функция работает в режиме совместимости со своей предыдущей версией:
//     - для разделителя-пробела пустые строки не включаются в результат, для остальных разделителей пустые строки
//       включаются в результат.
//    Если параметр Строка не содержит значащих символов или не содержит ни одного символа (пустая строка), то в
//       случае разделителя-пробела результатом функции будет массив, содержащий одно значение "" (пустая строка), а
//       при других разделителях результатом функции будет пустой массив.
//  СокращатьНепечатаемыеСимволы - Булево - сокращать непечатаемые символы по краям каждой из найденных подстрок.
//
// Возвращаемое значение:
//  Массив - массив строк.
Функция СтрРазделить_(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, СокращатьНепечатаемыеСимволы = Ложь)
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Строка));
		Иначе
			Результат.Добавить(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

///  Объединяет строки из массива в строку с разделителями.
//
// Параметры:
//  Массив      - Массив - массив строк которые необходимо объединить в одну строку;
//  Разделитель - Строка - любой набор символов, который будет использован в качестве разделителя.
//
// Возвращаемое значение:
//  Строка - строка с разделителями.
// 
Функция СтрСоединить_(Массив, Разделитель = ",", СокращатьНепечатаемыеСимволы = Ложь)

	Результат = "";
	ТекРазделитель = "";
	
	Для Индекс = 0 По Массив.ВГраница() Цикл
		
		Подстрока = Массив[Индекс];
		
		Если СокращатьНепечатаемыеСимволы Тогда
			Подстрока = СокрЛП(Подстрока);
		КонецЕсли;
		
		Если ТипЗнч(Подстрока) <> Тип("Строка") Тогда
			Подстрока = Строка(Подстрока);
		КонецЕсли;
		
		Результат = Результат + ТекРазделитель + Подстрока;
		
		Если Индекс = 0 Тогда
			ТекРазделитель = Разделитель;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// СовместимостьСПлатформой_8_3_5
#КонецОбласти


#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьКонтекстФормы(СтррКонтекст, ПараметрыФормы, стрОбязательныеСвойства = Неопределено) Экспорт
	
	Если СтррКонтекст = Неопределено Тогда
		СтррКонтекст = Новый Структура;
	КонецЕсли;
	
	стрНетСвойств = СтруктураОтсутствуютОбязательныеСвойства(ПараметрыФормы, стрОбязательныеСвойства);
	Если ЗначениеЗаполнено(стрНетСвойств) Тогда
		Если Найти(стрНетСвойств, ",") = 0 Тогда // отсуствует одно обязательное свойство в ПараметрыФормы
			Текст = СтрШаблон_("Отсутствует обязательное свойство ""Параметры.%1"" для открытия формы!", стрНетСвойств);
		Иначе // отсуствует несколько обязательных свойств в ПараметрыФормы
			Текст = СтрШаблон_("Отсутствуют обязательные свойства у объекта ""Параметры"" для открытия формы! Ожидаются свойства: %1.", стрНетСвойств);
		КонецЕсли; 
		ВызватьИсключение(Текст);
	КонецЕсли; 
	
	
	СтррКонтекст.Вставить("ПутьКФорме", Метаданные().ПолноеИмя() + ".Форма.");
	СтррКонтекст.Вставить("Версия", 	ВерсияОбработки());
	СтррКонтекст.Вставить("Цвета", 		ВернутьЦветаОФормления());
	СтррКонтекст.Вставить("ВХОбщиеПараметры", Неопределено);
	Если СтррКонтекст.Свойство("РежимСовместимости") Тогда
		СтррКонтекст.РежимСовместимости = Метаданные.РежимСовместимости;
	КонецЕсли;
	
	Если СтррКонтекст.Свойство("Конфигурация") Тогда
	    стррВерсия = ВерсияКонфигурации();
		СтррКонтекст.Конфигурация = стррВерсия.Конфигурация;
	КонецЕсли; 
	
	Если СтррКонтекст.Свойство("СпрТоргТочки") Тогда
		флИспользоватьПунктыРазгрузки = ПрочитатьЗначениеНастройки("ИспользоватьПунктыРазгрузки");
		Если флИспользоватьПунктыРазгрузки = Неопределено Тогда
			ИспользоватьПунктыРазгрузки = Ложь;
		Иначе 
			ИспользоватьПунктыРазгрузки = флИспользоватьПунктыРазгрузки;
		КонецЕсли;
		стррТТ = Новый Структура("ВидСправочника, Синоним, Представление, тзИмяКолонки, тзИмяЭлемента, Адрес");
		
		Если ИспользоватьПунктыРазгрузки Тогда 
			стррТТ.ВидСправочника = "алкПунктыРазгрузки"; // указывается имя справочника объекта метаданных в конфигурации, который заменяет справочник 'Партнеры'.
			стррТТ.Синоним 		  = "Пункты разгрузки"; // указывается для вывода на форме списка торговых точек.
			стррТТ.Представление  = "Пункт разгрузки"; // указывается для вывода в информационных сообщениях пользователю.
			стррТТ.тзИмяКолонки	  = "ПунктРазгрузки"; // имя колонки в таблице значений 'Состав' в модуле формы 'СписокТорговыхТочек'.
			стррТТ.тзИмяЭлемента  = "СоставПунктРазгрузки"; // имя элемента таблицы значений 'Состав' на форме 'СписокТорговыхТочек'.
			стррТТ.Адрес 		  = Справочники.ВидыКонтактнойИнформации.АдресПунктаРазгрузки;
		Иначе // используется типовой справочник Партнеры
			//{{dm_180508
			стррТТ.ВидСправочника = "Контрагенты";
			//}}dm_180508
			стррТТ.Синоним 		  = "Контрагенты";
			стррТТ.Представление  = "Контрагент (Клиент)";
			стррТТ.тзИмяКолонки	  = "Партнер";
			стррТТ.тзИмяЭлемента  = "СоставПартнер";
			
			//++Дейнеко ВГ 2017-09-28 Бухгалтерия ругается, отключил
			//{{dm_180508
			стррТТ.Адрес		  = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
			//}}dm_180508
			//--Дейнеко ВГ 2017-09-28 Бухгалтерия ругается, отключил

		КонецЕсли;
		СтррКонтекст.СпрТоргТочки = стррТТ;		
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(СтррКонтекст, ПараметрыФормы);
	
КонецПроцедуры

Функция КонфигурацияРазмерностьЭлементовФормыДляТакси() Экспорт
	
	Возврат КонфигурацияРежимСовместимости(">=8.3.7");
	
КонецФункции

Функция КонфигурацияРежимСовместимости(строкаСравненияВерсии) Экспорт
	
	ТекущийРежим = Метаданные.РежимСовместимости;

	Если ТекущийРежим = Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать Тогда
		СисИнфо = Новый СистемнаяИнформация;
		стрВерсияПлатформы = СисИнфо.ВерсияПриложения;
	Иначе
		стрВерсияПлатформы = ПолучитьВерисиюИзСтроки(СтрЗаменить(Строка(ТекущийРежим), "_", "."));
	КонецЕсли; 
	
	строкаСравнения = СтрЗаменить(строкаСравненияВерсии, " ", "");
	Длина = стрДлина(строкаСравнения);
	ЗнакСравнения = "";
	Для Индекс = 1 По 2 Цикл
		Символ = Сред(строкаСравнения, Индекс, 1);
		Если КодСимвола(Символ) >= 60 И КодСимвола(Символ) <= 62 Тогда
			ЗнакСравнения = ЗнакСравнения + Символ;
		КонецЕсли; 
	КонецЦикла;
	
	Если ЗнакСравнения = "" Тогда
		ЗнакСравнения = "=";
	Иначе
		стрОперации = ",<,=,>,<>,<=,>=,";
		Если Найти(стрОперации, "," + ЗнакСравнения + ",") = 0 Тогда
			Текст = "Функция КонфигурацияСравнитьРежимСовместимости(): неверное значение параметра ""строкаСравненияВерсии"" = ""%1""!" + Символы.ПС
				+ "Значение должно начинаться с операции сравнения (<, =, >, <>, <= или >=)!";
			ВызватьИсключение(СтрШаблон_(Текст, строкаСравненияВерсии));
		КонецЕсли;
	КонецЕсли;
	
	Сравнение = СравнитьВерсии(стрВерсияПлатформы, Сред(строкаСравнения, СтрДлина(ЗнакСравнения)+1));
	
	Если ЗнакСравнения = ">=" Тогда
		Значение = (Сравнение >= 0);
	ИначеЕсли ЗнакСравнения = "<=" Тогда
		Значение = (Сравнение <= 0);
	ИначеЕсли ЗнакСравнения = "<" Тогда
		Значение = (Сравнение < 0);
	ИначеЕсли ЗнакСравнения = ">" Тогда
		Значение = (Сравнение > 0);
	ИначеЕсли ЗнакСравнения = "=" Тогда
		Значение = (Сравнение = 0);
	ИначеЕсли ЗнакСравнения = "<>" Тогда
		Значение = (Сравнение <> 0);
	Иначе
		ВызватьИсключение("Функция КонфигурацияСравнитьРежимСовместимости() - неизвестный оператор сравнения: " + ЗнакСравнения);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ПолучитьВерисиюИзСтроки(Знач стрРежим) 
	
	стрВерсия = "";
	стрРежим = СтрЗаменить(стрРежим, "_", ".");
	Длина = СтрДлина(стрРежим);
	Для Индекс = 1 По Длина Цикл
		Символ = Сред(стрРежим, Индекс, 1);
		Код = КодСимвола(Символ);
		Если Код = 46 Или (Код >= 48 И Код <= 57) Тогда
		    стрВерсия = стрВерсия + Символ;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат стрВерсия;
	
КонецФункции

Функция ПодкаталогиДанных() Экспорт
	
	Возврат Новый Структура("КаталогОбмена,Логи,Треки,Входящие,Исходящие", 
							"Exchange", "Logs", "Tracks", "In", "Out");
							
КонецФункции

Функция ПодкаталогДанных(ИмяСвойства, НачальныйПуть = Неопределено) Экспорт
	
	Результат 		= Неопределено;	
	СтррПодкаталоги = ПодкаталогиДанных();
	
	Если Не СтррПодкаталоги.Свойство(ИмяСвойства, Результат) Тогда
		ВызватьИсключение("Функция ПодкаталогДанных(), неизвестный параметр ИмяСвойства = " + ИмяСвойства);
	КонецЕсли;
	
	Путь = ?(НачальныйПуть <> Неопределено, НачальныйПуть, КаталогДанных);
	Если ЭтоLinuxСервер() Тогда
		Путь = СтрЗаменить(Путь, "\", "/");
	КонецЕсли; 
	
	Возврат ДополнитьСлешВПуть(Путь) + ДополнитьСлешВПуть(Результат);
	
КонецФункции

// Процедура  заполняет значения структуры в соответствии со свойствами структуры. В качестве свойств структуры
// указываются виды объектов метаданных, например, "ЗаказКлиента".
Процедура ПолучитьПредставленияВидовОбъектов(стррВидыДокументов, ВидМетаданных = "Документы") Экспорт

	Для Каждого Элемент Из СтррВидыДокументов Цикл
		
		//++Дейнеко ВГ 2017-09-18 Бухгалтерия
		//{{dm_180514
		стррВидыДокументов[Элемент.Ключ] = Метаданные[ВидМетаданных][Элемент.Ключ].Синоним;
		//}}dm_180514
		//--Дейнеко ВГ 2017-09-18 Бухгалтерия
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьВСтрокуНомерКопии(ИсхСтрока) Экспорт
	
	ИсхСтрока = СокрП(ИсхСтрока);
	ИндексН = СтрДлина(ИсхСтрока) + 1; // индекс начала
	Символ = Неопределено;
	Пока ИндексН > 0 И Символ <> "(" Цикл
		ИндексН = ИндексН - 1;		
		Символ = Сред(ИсхСтрока, ИндексН, 1);
	КонецЦикла; 
	
	СтрКопия = НСтр("ru = 'копия'");
	
	Если Символ = "(" И Сред(ИсхСтрока, ИндексН + 1, СтрДлина(СтрКопия)) = СтрКопия Тогда // есть в названии слово "(копия"
		СтрНомерКопии = "";
		ИндексК = СтрДлина(ИсхСтрока); // индекс конца
		Для Индекс = ИндексН По ИндексК Цикл
			Символ = Сред(ИсхСтрока, Индекс, 1);
			Код = КодСимвола(Символ);			
			Если Код = 41 Тогда // ")"
				Прервать;
			ИначеЕсли Код > 47 И Код < 58 Тогда
				СтрНомерКопии = СтрНомерКопии + Символ;
			КонецЕсли; 
		КонецЦикла;
		НомерКопии = ?(СтрНомерКопии <> "", Число(СтрНомерКопии), 1) + 1;
		ИсхСтрока = Лев(ИсхСтрока, ИндексН) + СтрКопия + " " + Строка(НомерКопии) + ")";
	Иначе
		ИсхСтрока = ИсхСтрока + " (" + СтрКопия + ")";
	КонецЕсли; 
	
КонецПроцедуры

#Область ПрограммныйИнтерфейс_ОпределениеКонфигурации
// Аналогичные функции объявлены в клиентском модуле МодульОбщий (ПоколениеКонфигурации, СравнитьВерсии, ВерсияКонфигурации).

// Функция сравнивает идентификатор текущей конфигурации (в глобальной переменной гБазоваяКонфигурация) с проверяемым 
// идентификатором конфигурации (в параметре СтрКонфигурация).
// Возвращает Истина, если идентификатор текущей конфигурации соответствует идентификатору проверяемой конфигурации и 
// операция сравнения версии (переданная вместе с идентификатором) верна.
// Формат идентификатора конфигурации: "P_V1.V2.V3.V4", где P - префикс конфигурации, V1-V4 - вресия конфигурации.
// Версия может быть неполной. Примеры: "УТ_11.1.15.120", "УТ_11.1"
// 	Параметры:
// 		СтрКонфигурация - Строка - операция сравнеия и идентификатор сравниваемой конфигурации.
// 		
Функция ПоколениеКонфигурации(СтрКонфигурация) Экспорт 
	
	Если гКэшСравненияКонфигураций = Неопределено Тогда
		гКэшСравненияКонфигураций = Новый Соответствие;
	КонецЕсли; 
	
	Значение = гКэшСравненияКонфигураций.Получить(СтрКонфигурация);
	
	Если Значение = Неопределено Тогда
		
		Индекс1 = Найти(гБазоваяКонфигурация, "_");
		Индекс2 = Найти(СтрКонфигурация, "_");
		
		Если Индекс2 = 0 Тогда
			ВызватьИсключение("Функция ПоколениеКонфигурации(): указан параметр без префикса ""_""! Параметр = """ + СтрКонфигурация + """.");
		КонецЕсли; 
		
		Префикс1 = Лев(гБазоваяКонфигурация, Индекс1);
		Префикс2 = Лев(СтрКонфигурация, Индекс2);
		
		ЗнакСравнения = "";
		Для Индекс = 1 По 2 Цикл
			Символ = Сред(Префикс2, Индекс, 1);
			Если КодСимвола(Символ) >= 60 И КодСимвола(Символ) <= 62 Тогда // знаки "<=>"
				ЗнакСравнения = ЗнакСравнения + Символ;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗнакСравнения = "" Тогда
			ЗнакСравнения = "=";
		Иначе
			Префикс2 = Сред(Префикс2, СтрДлина(ЗнакСравнения) + 1);
		КонецЕсли;
		
		Если Префикс1 <> Префикс2 Тогда // сравниваем префиксы конфигураций
			
			Значение = Ложь;
			
		Иначе
			
			Сравнение = СравнитьВерсии(Сред(гБазоваяКонфигурация, Индекс1+1), Сред(СтрКонфигурация, Индекс2+1));
			
			Если ЗнакСравнения = ">=" Тогда
				Значение = (Сравнение >= 0);
			ИначеЕсли ЗнакСравнения = "<=" Тогда
				Значение = (Сравнение <= 0);
			ИначеЕсли ЗнакСравнения = "<" Тогда
				Значение = (Сравнение < 0);
			ИначеЕсли ЗнакСравнения = ">" Тогда
				Значение = (Сравнение > 0);
			ИначеЕсли ЗнакСравнения = "=" Тогда
				Значение = (Сравнение = 0);
			Иначе
				ВызватьИсключение("Функция ПоколениеКонфигурации() - неизвестный оператор сравнения: " + ЗнакСравнения);
			КонецЕсли;
			
		КонецЕсли;
		
		гКэшСравненияКонфигураций.Вставить(СтрКонфигурация, Значение);
		
	КонецЕсли;
		
	Возврат Значение;
	
КонецФункции

// Сравнивает две строки версий. Если передана не полная версия, то сравнивается только общая начальная часть версий.
//
// Параметры:
//  СтрокаВерсии1  - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС.
//  СтрокаВерсии2  - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция СравнитьВерсии(СтрокаВерсии1, СтрокаВерсии2)
	
	мВерсия1 = СтрРазделить_(?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1), ".");
	мВерсия2 = СтрРазделить_(?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2), ".");
	
	ВГраница = Мин(мВерсия1.Количество(), мВерсия2.Количество()) - 1;
	
	Результат = 0;
	Для Разряд = 0 По ВГраница Цикл
		Результат = Число(мВерсия1[Разряд]) - Число(мВерсия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияКонфигурации() Экспорт
	
	стррРезультат = Новый Структура("Конфигурация,БазоваяКонфигурация");
	
	Имя    = Метаданные.Имя;
	Версия = Метаданные.Версия;
	
	Если Имя = "БухгалтерияПредприятия" Или Имя = "БухгалтерияПредприятияКОРП" Или Имя = "БухгалтерияПредприятияБазовая" Тогда // Если Имя = "БухгалтерияПредприятия" Тогда sk_190718
		стррРезультат.БазоваяКонфигурация = "Бухгалтерия_" + Версия;
		стррРезультат.Конфигурация  = "Бухгалтерия_RU";
	ИначеЕсли Имя = "БухгалтерияДляКазахстана" Тогда
		стррРезультат.БазоваяКонфигурация = "Бухгалтерия_" + Версия;
		стррРезультат.Конфигурация  = "Бухгалтерия_KZ";
	Иначе
		//стррРезультат.БазоваяКонфигурация = "УТ_11.2"; // пока неизвестные конфигурации приравниваем к УТ 11.2
	КонецЕсли;
	
	Возврат стррРезультат;
	
КонецФункции

Процедура ОпределитьВерсиюКонфигурации()
	
	Если гБазоваяКонфигурация <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	стррВерсияКонфигурации = ВерсияКонфигурации();
	
	гБазоваяКонфигурация = стррВерсияКонфигурации.БазоваяКонфигурация;
	гКонфигурация  		 = стррВерсияКонфигурации.Конфигурация;
	
КонецПроцедуры

// ПрограммныйИнтерфейс_ОпределениеКонфигурации
#КонецОбласти 

#Область ПрограммныйИнтерфейс_РасширениеСтруктуры

// Функция возвращает представление структуры в виде строки
Функция СтруктураПредставление(Структура, ОграничениеДлиныПредставления = 100) Экспорт
	
	Результат = "";
	
	Если ТипЗнч(Структура) = Тип("Структура") Тогда
		
		Для Каждого Элемент Из Структура Цикл

			Тип = ТипЗнч(Элемент.Значение);
			Если Тип = Тип("Строка") Тогда
				ЗначениеСтр = "'" + СокрЛП(Элемент.Значение) + "'";
			ИначеЕсли Тип = Тип("СписокЗначений") Тогда
				ЗначениеСтр = "<Список N=" + Строка(Элемент.Значение.Количество()) + ">";
			ИначеЕсли Тип = Тип("Массив") Или Тип = Тип("ФиксированныйМассив") Тогда
				ЗначениеСтр = "<Массив N=" + Строка(Элемент.Значение.Количество()) + ">";
			Иначе
				ЗначениеСтр = Строка(Элемент.Значение);
			КонецЕсли;
			
			Если Результат <> "" Тогда
				Результат = Результат + "; ";
			КонецЕсли; 
			Результат = Результат + Элемент.Ключ + ": " + ЗначениеСтр;
			Если СтрДлина(Результат) >= ОграничениеДлиныПредставления Тогда
				Результат = Лев(Результат, ОграничениеДлиныПредставления - 3) + "...";
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;		
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает список отсутствующих обязательных свойств.
Функция СтруктураОтсутствуютОбязательныеСвойства(Структура, стрОбязательныеСвойства)
	
	стрРезультат = "";
	
	Если ЗначениеЗаполнено(стрОбязательныеСвойства) Тогда
		МассивСвойств = СтрРазделить_(стрОбязательныеСвойства, ",");
		Для Каждого стрСвойство Из МассивСвойств Цикл
			Если Не Структура.Свойство(стрСвойство) Тогда
				стрРезультат = стрРезультат + ?(ПустаяСтрока(стрРезультат), "", ",") + стрСвойство;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
	Возврат стрРезультат;
	
КонецФункции

// Функция проверяет наличие всех свойств структуры, названия свойств передаются в виде строки с разделителем ",".
Функция СтруктураЕстьСвойства(Структура, СтрСвойства) Экспорт
	
	Результат = Истина;
	
	Если ТипЗнч(Структура) <> Тип("Структура") Тогда
		Результат = Ложь;
	Иначе
		МассивСвойств = СтрРазделить_(СтрСвойства, ",");
		Для Каждого Элемент Из МассивСвойств Цикл
			Если Не Структура.Свойство(Элемент) Тогда
				Результат = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗначениеСвойства(Структура, СтрСвойство)
	
	Перем Результат;
	Структура.Свойство(СтрСвойство, Результат);
	Возврат Результат;
	
КонецФункции

// ПрограммныйИнтерфейс_РасширениеСтруктуры
#КонецОбласти 

#Область ПрограммныйИнтерфейс_ЧтениеЗаписьНастроекОбработки

// В качестве параметра передается структура, где Ключ - имя настройки, Значение - значение настройки
Процедура СохранитьЗначенияНастроекИзСтруктуры(СтррНастройки) Экспорт

	Для Каждого Элемент Из СтррНастройки Цикл
		ХранилищеСистемныхНастроек.Сохранить(КлючНастроекОбмена(), Элемент.Ключ, Элемент.Значение, , ПользовательНастроек());
	КонецЦикла;

КонецПроцедуры

// В качестве параметра передается строка с именами настроек через запятую.
Функция СохранитьЗначенияНастроекОбработки(ИменаНастроек, СохранитьВВХ = Ложь) Экспорт

	Результат = Истина;
	
	МассивИмен = СтрРазделить_(ИменаНастроек, ",", Ложь);
	
	Если Не СохранитьВВХ Тогда // запись в хранилище
		
		Для Каждого ИмяНастройки Из МассивИмен Цикл
			ХранилищеСистемныхНастроек.Сохранить(КлючНастроекОбмена(), ИмяНастройки, ЭтотОбъект[ИмяНастройки], , ПользовательНастроек());
		КонецЦикла;
		
	Иначе // запись в XML-файл с последующей записью во временное хранилище
		
		СтррРезультат = Новый Структура("ЕстьОшибки,Сообщения,АдресВХ", Ложь, Новый Массив);
		
		ИмяФайла = КаталогВременныхФайлов() + СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "") + ".xml";
		
		ДокXML = Новый ЗаписьXML();
		
		Попытка
			ДокXML.ОткрытьФайл(ИмяФайла);
			ДокXML.ЗаписатьОбъявлениеXML();	
			ДокXML.ЗаписатьНачалоЭлемента("Settings");

			ДокXML.ЗаписатьАтрибут("Generator", 		"Module1C");
			
			ДокXML.ЗаписатьАтрибут("ModuleVersion", 	ВерсияОбработки());
			ДокXML.ЗаписатьАтрибут("ModuleName", 		"APMTBase");
			
			ДокXML.ЗаписатьАтрибут("ProductName", 		Метаданные.Имя);
			ДокXML.ЗаписатьАтрибут("ProductVer", 	 	Метаданные.Версия); 
			ДокXML.ЗаписатьАтрибут("Compatibility", 	Строка(Метаданные.РежимСовместимости));
			ДокXML.ЗаписатьАтрибут("UICompatibility",	Строка(Метаданные.РежимСовместимостиИнтерфейса));
			//ДокXML.ЗаписатьАтрибут("PlatformVersion",	СистемнаяИнформация.ВерсияПриложения);
			//ДокXML.ЗаписатьАтрибут("OSVersion",		СистемнаяИнформация.ВерсияОС);
			//ДокXML.ЗаписатьАтрибут("OSType",			СистемнаяИнформация.ТипПлатформы);
			
		Исключение
			Текст = СтрШаблон_(НСтр("ru = 'Ошибка создания файла настроек ""%1"". Причина: %2'"), ИмяФайла, ОписаниеОшибки());
			ВывестиСообщение(СтррРезультат, Текст, Истина);
			Возврат СтррРезультат;
		КонецПопытки;
		
		ДокXML.ЗаписатьНачалоЭлемента("Root");
		ДокXML.ЗаписатьНачалоЭлемента("Attributes");
		
		Для Каждого ИмяНастройки Из МассивИмен Цикл
			ДокXML.ЗаписатьНачалоЭлемента("Item");
			ДобавитьПоле(ДокXML, "Name",  ИмяНастройки);
			ДобавитьПоле(ДокXML, "Value", ЗначениеВСтрокуДляXML(ЭтотОбъект[ИмяНастройки]));
			ДокXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		
		ДокXML.ЗаписатьКонецЭлемента(); // "Attributes"
		ДокXML.ЗаписатьКонецЭлемента(); // "Root"
		ДокXML.ЗаписатьКонецЭлемента(); // "Settings"
		
		ДокXML.Закрыть();
		
		СтррРезультат.АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));
		УдалитьФайлы(ИмяФайла);
		
		Результат = СтррРезультат;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Процедура загружает реквизиты обработки значениями из хранилища системных настроек.
// 
// Параметры:
//	ИменаНастроек - Строка - строка с именами настроек через запятую.
//	ПеренестиТаблицыВоВременныеТаблицы - Булево - если Истина, то загружать таблицы значений в структуру ВременныеТаблицы (реквизит обработки).
//
Процедура ВосстановитьЗначенияНастроекОбработки(ИменаНастроек, ПеренестиТаблицыВоВременныеТаблицы = Ложь) Экспорт

	Имена = СтрЗаменить(ИменаНастроек, ",ВременныеТаблицы", "");
	
	СтррНастройки = ПрочитатьЗначенияНастроек(Имена);
	
	ТипТЗ = Тип("ТаблицаЗначений");	
	
	ВременныеТаблицы = Новый Структура;		

	Для Каждого Элемент Из СтррНастройки Цикл
		Ключ = Элемент.Ключ;
		Значение = Элемент.Значение;
		Если ТипЗнч(Значение) = ТипТЗ Тогда
			Если ПеренестиТаблицыВоВременныеТаблицы Тогда
				ВременныеТаблицы.Вставить(Ключ, Значение);
			Иначе
				ЭтотОбъект[Ключ] = Значение.Скопировать();
			КонецЕсли;
		Иначе
			ЭтотОбъект[Ключ] = Значение;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Функция загружает реквизиты обработки значениями из XML-файла из временного хранилища.
// 
// Параметры:
//	ИменаНастроек 	- Строка - строка с именами настроек через запятую.
//	АдресВХ 		- Строка - адрес XML-файла настроек во временном хранилище.
//
Функция ЗагрузитьЗначенияНастроекОбработкиИзВХ(ИменаНастроек, АдресВХ) Экспорт

	Имена = "," + ВРег(ИменаНастроек) + ",";
	
	СтррРезультат = Новый Структура("ЕстьОшибки,Сообщения,ВсегоИзменений", Ложь, Новый Массив, 0);
	
	Данные = ПолучитьИзВременногоХранилища(АдресВХ);
	Если ТипЗнч(Данные) <> Тип("ДвоичныеДанные") Тогда
		ВывестиСообщение(СтррРезультат, НСтр("ru = 'В хранилище отсутствует XML-файл настроек.'"), Истина);
		Возврат СтррРезультат;
	КонецЕсли;
	
	ФайлНастроек = КаталогВременныхФайлов() + "apconfig.xml";
	Данные.Записать(ФайлНастроек);
	
	ДокXML = Новый ЧтениеXML;
    ДокXML.ОткрытьФайл(ФайлНастроек);
	
	ФайлКорректный 			 = Ложь;
	ЕстьТэгSettings 		 = Ложь;
	ВыведенЗаголовокЗагрузки = Ложь;		
 
    Пока ДокXML.Прочитать() Цикл
 
        Если ДокXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
		 	ИмяУзла = ВРег(ДокXML.Name);
			
			Если ИмяУзла = "SETTINGS" Тогда
				
				ЕстьТэгSettings = Истина;
				
				ЦелевойМодуль = ДокXML.ЗначениеАтрибута("ModuleName");
				ЦелеваяВерсия = ДокXML.ЗначениеАтрибута("ModuleVersion");					
				
				Если ЦелевойМодуль = Неопределено Тогда
					Текст = СтрШаблон_(НСтр("ru = 'Отсутствувет атрибут %1 узла ""Settings""!'"), "ModuleName");
					ВывестиСообщение(СтррРезультат, Текст, Истина);
				КонецЕсли;
				
				Если ЦелеваяВерсия = Неопределено Тогда
					Текст = СтрШаблон_(НСтр("ru = 'Отсутствувет атрибут %1 узла ""Settings""!'"), "ModuleVersion");
					ВывестиСообщение(СтррРезультат, Текст, Истина);
				КонецЕсли;
				
				Если ЦелевойМодуль = Неопределено Или ЦелеваяВерсия = Неопределено Тогда 
					ДокXML.Пропустить();
					Прервать;
				КонецЕсли;
				
				Если ВРег(ЦелевойМодуль) <> "APMTBASE" Тогда
					Текст = СтрШаблон_(НСтр("ru = 'Настройки предназначены для другого модуля (ModuleName = %1, ожидаемое значение: %2)!'"), 
						ЦелевойМодуль, "APMTBase");
					ВывестиСообщение(СтррРезультат, Текст, Истина);
					ДокXML.Пропустить();
					Прервать;
				КонецЕсли;
				
				Сравнение = СравнитьВерсии(ВерсияОбработки(), ЦелеваяВерсия);
				Если Сравнение <> 0 Тогда
					Разница = ?(Сравнение < 0, НСтр("ru = 'более новой'"), НСтр("ru = 'более старой'"));
					Текст = СтрШаблон_(НСтр("ru = 'Получены настройки для обработки %1 версии (%2)!'"), Разница, ЦелеваяВерсия);
					ВывестиСообщение(СтррРезультат, Текст);
				КонецЕсли;
				
				ФайлКорректный = Истина;
				
			ИначеЕсли ИмяУзла = "ITEM" И ФайлКорректный Тогда
				
				Если Не ВыведенЗаголовокЗагрузки Тогда
					ВывестиСообщение(СтррРезультат,  НСтр("ru = 'Чтение значений настроек...'"));
					ВыведенЗаголовокЗагрузки = Истина;
				КонецЕсли;
				
				Имя = ДокXML.ЗначениеАтрибута("Name");
				Если 0 = Найти(Имена, "," + ВРег(Имя) + ",") Тогда
					// загружаем только реквизиты, указанные в параметре Имена
				ИначеЕсли Не ЕстьРеквизитОбъекта(Имя, ЭтотОбъект) Тогда
					Текст = СтрШаблон_(НСтр("ru = 'Пропущен параметр (отсутствует в обработке): ""%1"".'"), Имя);
					ВывестиСообщение(СтррРезультат, Текст);
				Иначе
					Значение = ЗначениеИзСтрокиXML(ДокXML.ЗначениеАтрибута("Value"), ТипЗнч(ЭтотОбъект[Имя]));
					Если ЭтотОбъект[Имя] <> Значение Тогда // изменилось значение реквизита, загружаем новое значение
						ЭтотОбъект[Имя] = Значение;
						Если СтррРезультат.ВсегоИзменений = 0 Тогда
							ВывестиСообщение(СтррРезультат, НСтр("ru = 'Получены новые значения параметров настройки:'"));
						КонецЕсли;
						СтррРезультат.ВсегоИзменений = СтррРезультат.ВсегоИзменений + 1;
						Текст = СтрШаблон_(НСтр("ru = '%1. ""%2""'"), СтррРезультат.ВсегоИзменений, Имя);
						ВывестиСообщение(СтррРезультат, Текст);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;					
 
        КонецЕсли;
 
    КонецЦикла; 
 
    ДокXML.Закрыть();
	
	Если Не ЕстьТэгSettings Тогда
		ВывестиСообщение(СтррРезультат, НСтр("ru = 'Файл не является файлом настроек - ожидается тэг ""Settings"".'"), Истина);
	КонецЕсли;
	
	Возврат СтррРезультат;

КонецФункции

// Возвращает структуру с прочитанными настройками или значение первого параметра из строки списка ИменаНастроек.
// В качестве параметра передается строка с именами настроек через запятую.
// Если параметр ВернутьТолькоЗначение = Истина, то возвращается только значение параметра.
Функция ПрочитатьЗначенияНастроек(ИменаНастроек, ВернутьТолькоЗначение = Ложь) Экспорт
	
	МассивИмен = СтрРазделить_(ИменаНастроек, ",", Ложь);
	
	Если ВернутьТолькоЗначение Тогда
		
		Результат = ХранилищеСистемныхНастроек.Загрузить(КлючНастроекОбмена(), МассивИмен[0], , ПользовательНастроек());
		
	Иначе
		
		Результат = Новый Структура(ИменаНастроек);
		Для Каждого ИмяНастройки Из МассивИмен Цикл
			ЗначениеНастройки = ХранилищеСистемныхНастроек.Загрузить(КлючНастроекОбмена(), ИмяНастройки, , ПользовательНастроек());
			Результат.Вставить(ИмяНастройки, ЗначениеНастройки);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Удаляет настройки из хранилища.
// В качестве параметра передается строка с именами настроек через запятую или массив имен настроек.
Процедура УдалитьЗначенияНастроек(ИменаНастроек)
	
	ТипПараметра = ТипЗнч(ИменаНастроек);
	Если ТипПараметра = Тип("Строка") Тогда
		МассивИмен = СтрРазделить_(ИменаНастроек, ",", Ложь);
	ИначеЕсли ТипПараметра = Тип("Массив") Тогда
		МассивИмен = ИменаНастроек;
	Иначе
		ВызватьИсключение("Процедура УдалитьЗначенияНастроек() - неизвестный тип папаметра ИменаНастроек - " + Строка(ТипПараметра));
	КонецЕсли;
	
	Для Каждого ИмяНастройки Из МассивИмен Цикл
		Попытка
			ХранилищеСистемныхНастроек.Удалить(КлючНастроекОбмена(), ИмяНастройки, ПользовательНастроек());
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось удалить системную настройку: " + ИмяНастройки);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает значение настройки, прочитанной из хранилища настроек.
// В параметре передается имя настройки.
Функция ПрочитатьЗначениеНастройки(ИмяНастройки, ИспользоватьКэш = Ложь) Экспорт
	
	Если Не ИспользоватьКэш Тогда
		Возврат ХранилищеСистемныхНастроек.Загрузить(КлючНастроекОбмена(), ИмяНастройки, , ПользовательНастроек());
	Иначе
		Если гКэшНастроек = Неопределено Тогда
			гКэшНастроек = Новый Соответствие;
		КонецЕсли; 
		Значение = гКэшНастроек.Получить(ИмяНастройки);
		Если Значение = Неопределено Тогда
			Значение = ХранилищеСистемныхНастроек.Загрузить(КлючНастроекОбмена(), ИмяНастройки, , ПользовательНастроек());
			гКэшНастроек.Вставить(ИмяНастройки, Значение);
		КонецЕсли; 
		Возврат Значение;
	КонецЕсли; 

КонецФункции

Функция ПрочитатьЗначениеНастройкиПоУмолчанию(ИмяНастройки, ЗначениеПоУмолчанию)
	
	Значение = ПрочитатьЗначениеНастройки(ИмяНастройки, Истина);
	Если ЗначениеЗаполнено(Значение) Тогда
		Возврат Значение;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли; 
	
КонецФункции

// В качестве параметра передается имя настройки (строка).
Процедура СохранитьЗначениеНастройки(ИмяНастройки, Значение) Экспорт

	ХранилищеСистемныхНастроек.Сохранить(КлючНастроекОбмена(), ИмяНастройки, Значение, , ПользовательНастроек());
	
КонецПроцедуры

Процедура УдалитьЗначениеНастройки(ИмяНастройки) Экспорт
	
	ХранилищеСистемныхНастроек.Удалить(КлючНастроекОбмена(), ИмяНастройки, ПользовательНастроек());
	
КонецПроцедуры	

// Функция возвращает заполненную структуру объекта, прочитанного из хранилища.
// В структуре проставлены значения свойств в соответствии с данными в хранилище БД, найденными по ключу ID.
//
Функция ПолучитьОбъектИзХранилища(Префикс, ID) Экспорт

	Если ID = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ПрочитатьЗначениеНастройки(Префикс + Строка(ID));
	КонецЕсли; 

КонецФункции 

// Процедура сохраняет заполненную структуру объекта в хранилище.
Процедура СохранитьОбъектВХранилище(Префикс, ID, СтррОбъект) Экспорт

	СохранитьЗначениеНастройки(Префикс + Строка(ID), СтррОбъект);

КонецПроцедуры

// Процедура удаляет объект из хранилища.
Процедура УдалитьОбъектИзХранилища(Префикс, ID) Экспорт
	
	УдалитьЗначениеНастройки(Префикс + Строка(ID));
	
КонецПроцедуры

// Процедура удаляет объекты из хранилища.
Процедура УдалитьОбъектыИзХранилища(Префикс, мИдентификаторы) Экспорт
	
	Для Каждого ID Из мИдентификаторы Цикл
		УдалитьОбъектИзХранилища(Префикс, ID)
	КонецЦикла; 
	
КонецПроцедуры

// Процедура полностью удаляет все настройки модуля.
// Параметры:
// 	СтррРезультат - Структура - структура для возвращения результата. Свойства:
// 		ОшибокНет - Булево - Истина, если ошибок нет и Ложь, если есть ошибки удаления (сбросить настройки не удалось).
// 		Описание  - Строка - описание ошибки.
// 	
Процедура СброситьВсеНастройкиМодуля(СтррРезультат) Экспорт
	
	СтррРезультат.ОшибокНет = Ложь;
	СтррРезультат.Описание  = "Неизвестная ошибка.";
	
	Попытка
		ХранилищеСистемныхНастроек.Удалить(КлючНастроекОбмена(), , ПользовательНастроек());
		Текст = СтрШаблон_("Настройки сброшены %1." + Символы.ПС + "Пользователь: %2.", ТекущаяДата(), Пользователи.ТекущийПользователь());
		ХранилищеСистемныхНастроек.Сохранить(КлючНастроекОбмена(), "НастройкиСброшены", Текст, , ПользовательНастроек());
		СтррРезультат.ОшибокНет = Истина;
	Исключение
		СтррРезультат.Описание = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

// Процедура загружает реквизиты объекта (модуля) с правильной обработкой значений типа ТаблицаЗначений
Процедура ЗаполнитьРеквизитыОбъектаИзСтруктуры(Модуль, СтррОбъект) Экспорт
	
	ТипТЗ = Тип("ТаблицаЗначений");
	стрРеквизитыТЗ = Неопределено;
	мРеквизитыТЗ = Новый Массив;
	Для Каждого Элемент Из СтррОбъект Цикл
		Если ТипЗнч(Элемент.Значение) = ТипТЗ Тогда
			стрРеквизитыТЗ = ?(стрРеквизитыТЗ = Неопределено, "", стрРеквизитыТЗ + ",") + Элемент.Ключ;
			мРеквизитыТЗ.Добавить(Элемент.Ключ);
		КонецЕсли; 
	КонецЦикла; 
	
	ЗаполнитьЗначенияСвойств(Модуль, СтррОбъект,, стрРеквизитыТЗ);
	
	Стр1С = "";
	Для Каждого ИмяРеквизита Из мРеквизитыТЗ Цикл
		Стр1С = Стр1С + СтрЗаменить("Модуль.%1.Загрузить(СтррОбъект.%1); ", "%1", ИмяРеквизита);
	КонецЦикла;
	
	Если Стр1С <> "" Тогда
		Выполнить(Стр1С);
	КонецЕсли; 
	
КонецПроцедуры

// ПрограммныйИнтерфейс_ЧтениеЗаписьНастроекОбработки
#КонецОбласти 

#Область ПрограммныйИнтерфейс_ОбщиеПроцедурыИФункцииДляФорм

Функция ВернутьЦветаОФормления() Экспорт
	
	стррРезультат = Новый Структура;
	стррРезультат.Вставить("Авто", 	 		 Новый Цвет);
	стррРезультат.Вставить("ТекстПояснение", Новый Цвет(70,130,180));
	стррРезультат.Вставить("ТекстВнимание",  Новый Цвет(255,0,0));
	стррРезультат.Вставить("ТекстОбычный", 	 ЦветаСтиля.ЦветТекстаФормы);
	стррРезультат.Вставить("ФонРаздела", 	 Новый Цвет(225, 222, 255));
	стррРезультат.Вставить("ПолеГлавноеОкно",Новый Цвет(249, 243, 209));
	стррРезультат.Вставить("ФонСостояние", 	 Новый Цвет(255, 250, 217));
	стррРезультат.Вставить("ФонЗеленый", 	 Новый Цвет(128, 255, 128));
	стррРезультат.Вставить("ФонВнимание",	 Новый Цвет(255, 255, 128));
	стррРезультат.Вставить("Белый", 	 	 Новый Цвет(255, 255, 255));
	
	Возврат стррРезультат;
	
КонецФункции

Процедура ЗаполнитьСпособыОбмена(Список) Экспорт

	Список.Очистить();
	Список.Добавить("КаталогОбмена", НСтр("ru='Каталог обмена'"));
	Список.Добавить("АПСОД",  		 НСтр("ru='Агент Плюс: СОД (служба обмена данными)'"));
	Список.Добавить("FTP", 			 НСтр("ru='FTP-сервер'"));

КонецПроцедуры

Функция ПолучитьВсеЗакладкиЖурналаДокументовДляМУ() Экспорт
	
	Список = Новый СписокЗначений;
	Список.Добавить("Заказ", 		НСтр("ru='Заказы'"));
	Список.Добавить("Долг", 		НСтр("ru='Долги'"));
	Список.Добавить("Реализация", 	НСтр("ru='Реализация'"));
	Список.Добавить("ПКО", 			НСтр("ru='Касса'"));
	Список.Добавить("Поступление", 	НСтр("ru='Возврат'"));
	Список.Добавить("Перемещение", 	НСтр("ru='Перемещение'")); // sd_22082017
	Список.Добавить("Мерчендайзинг",НСтр("ru='Мерчендайзинг'")); // dm_180703
	
	Возврат Список;
	
КонецФункции

// Функция возвращает представление структуры в виде строки
Функция ПолучитьПредставлениеСтруктуры(Структура, ОграничениеДлиныПредставления = 100) Экспорт
	
	Результат = "";
	
	Если ТипЗнч(Структура) = Тип("Структура") Тогда
		
		Для Каждого Элемент Из Структура Цикл

			Тип = ТипЗнч(Элемент.Значение);
			Если Тип = Тип("Строка") Тогда
				ЗначениеСтр = "'" + СокрЛП(Элемент.Значение) + "'";
			ИначеЕсли Тип = Тип("СписокЗначений") Тогда
				ЗначениеСтр = "<Список N=" + Строка(Элемент.Значение.Количество()) + ">";
			ИначеЕсли Тип = Тип("Массив") Или Тип = Тип("ФиксированныйМассив") Тогда
				ЗначениеСтр = "<Массив N=" + Строка(Элемент.Значение.Количество()) + ">";
			Иначе
				ЗначениеСтр = Строка(Элемент.Значение);
			КонецЕсли;
			
			Если Результат <> "" Тогда
				Результат = Результат + "; ";
			КонецЕсли; 
			Результат = Результат + Элемент.Ключ + ": " + ЗначениеСтр;
			Если СтрДлина(Результат) >= ОграничениеДлиныПредставления Тогда
				Результат = Лев(Результат, ОграничениеДлиныПредставления - 3) + "...";
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;		
	
	Возврат Результат;
	
КонецФункции

// Функция проверяет наличие всех свойств структуры, названия свойств передаются в виде строки с разделителем ",".
Функция ЕстьСвойстваСтруктуры(Структура, СтрСвойства) Экспорт
	
	Результат = Истина;
	
	Если ТипЗнч(Структура) <> Тип("Структура") Тогда
		Результат = Ложь;
	Иначе
		МассивСвойств = СтрРазделить_(СтрСвойства, ",");
		Для Каждого Элемент Из МассивСвойств Цикл
			Если Не Структура.Свойство(Элемент) Тогда
				Результат = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция проверяет наличие колонок в таблице значений. Названия колонок передаются в виде строки с разделителем ",".
Функция ЕстьКолонкиТаблицыЗначений(ТЗ, СтрКолонки) Экспорт
	
	Результат = Истина;
	
	Если ТипЗнч(ТЗ) <> Тип("ТаблицаЗначений") Тогда
		Результат = Ложь;
	Иначе
		мКолонки = СтрРазделить_(СтрКолонки, ",");
		Для Каждого ИмяКолонки Из мКолонки Цикл
			Если ТЗ.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
				Результат = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает строковое представление расписания трекинга
Функция ПредставлениеРасписанияТрекинга(СтррРасписание) Экспорт
	
	Если Не ЕстьСвойстваСтруктуры(СтррРасписание, "ВремяНачала,ВремяОкончания,ДниНедели,ПериодЗаписи") Тогда
		Возврат "";
	КонецЕсли;
	
	Дни = СтрЗаменить(СтррРасписание.ДниНедели, ",", "");
	Если Дни = ""  Тогда
		Возврат "";
	КонецЕсли;
	
	Если Дни = "1234567" Тогда
		СтрДни = НСтр("ru='все'");
	Иначе
		ДниНеделиСтр = НСтр("ru='пн,вт,ср,чт,пт,СБ,ВС'");
		Если Лев(Дни, 5) = "12345" Тогда
			СтрДни = НСтр("ru='по будням'");
			Если Число(Прав(Дни, 1)) > 5 Тогда
				СтрДни = СтрДни + ", " + СтрРазделить_(ДниНеделиСтр, ",")[Число(Прав(Дни, 1))-1];
			КонецЕсли;
		Иначе
			МассивДней = СтрРазделить_(ДниНеделиСтр, ",");
			СтрДни = ""; 
			Для Поз = 1 По МассивДней.Количество() Цикл	
				Если Найти(Дни, Строка(Поз)) <> 0 Тогда
					СтрДни = СтрДни + ?(СтрДни = "", "", ", ") + МассивДней[Поз-1];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Результат = НСтр("ru='Дни недели:'") + " " + СтрДни + ". ";
	СтрВремя  = СтрШаблон_(НСтр("ru='Время с %1 по %2'"), СтррРасписание.ВремяНачала, СтррРасписание.ВремяОкончания) + ". ";
	Результат = Результат + СтрВремя;
	СтрИнтервал = НСтр("ru='Интервал: каждые'") + " ";
	Если СтррРасписание.ПериодЗаписи = 0 Или СтррРасписание.ПериодЗаписи % 60 <> 0 Тогда
		СтрИнтервал = СтрИнтервал + Строка(СтррРасписание.ПериодЗаписи) + " " + НСтр("ru='сек'");
	Иначе
		СтрИнтервал = СтрИнтервал + Строка(СтррРасписание.ПериодЗаписи / 60) + " " + НСтр("ru='мин'");
	КонецЕсли;
	Результат = Результат + СтрИнтервал + ".";

	Возврат Результат;

КонецФункции

// Возвращает текстовое представление числа с единицей измерения в правильном склонении и числе.
//
// Параметры:
//  Число                       - Число  - любое целое число.
//  ПараметрыПредметаИсчисления - Строка - варианты написания единицы измерения в родительном падеже для одной,
//                                         для двух и для пяти единиц, разделитель - запятая.
//
// Возвращаемое значение:
//  Строка - текстовое представление количества единиц, число записывается цифрами.
//
// Примеры:
//  ЧислоЦифрамиПредметИсчисленияПрописью(23,  "минуту,минуты,минут") = "23 минуты";
//  ЧислоЦифрамиПредметИсчисленияПрописью(15,  "минуту,минуты,минут") = "15 минут".
Функция ЧислоЦифрамиПредметИсчисленияПрописью(Знач Число, Знач ПараметрыПредметаИсчисления,
	Знач ДобавлятьЧислоКРезультату = Истина)
	
	Результат = ?(ДобавлятьЧислоКРезультату, Формат(Число, "ЧН=0") + " ", "");
	ПредставленияПредмета = Новый Массив;
	
	ПараметрыПредметаИсчисления = СтрРазделить_(ПараметрыПредметаИсчисления, ",");
	Для Каждого Параметр Из ПараметрыПредметаИсчисления Цикл
		ПредставленияПредмета.Добавить(СокрЛП(Параметр));
	КонецЦикла;
	
	Число = Число % 100;
	Если Число > 20 Тогда
		Число = Число % 10;
	КонецЕсли;
	
	Индекс = ?(Число = 1, 0, ?(Число > 1 И Число < 5, 1, 2));
	Результат = Результат + ПредставленияПредмета[Индекс];
	
	Возврат Результат;
	
КонецФункции

// Функция проверяет готовность справочника агентов к обмену данными.
//
// Параметры:
//  ОписаниеСтатуса - Строка - в параметре возвращается описание статуса готовности справочника.
//  КодСостояния - Строка - в параметре возвращается идентфикатор состояния справочника.
//
// Возвращаемое значение:
//   Истина - справочник готов к обмену данными, в параметре ОписаниеСтатуса возвращается пустая строка.
//   Ложь - не готов к обмену данными, в параметре ОписаниеСтатуса возвращается описание статуса.
//
Функция СправочникАгентовПроверитьГотовность(ТЗ)

	СтррРезультат = Новый Структура("Готов,КодСостояния,Описание,Количество");
	
	Если ТипЗнч(ТЗ) <> Тип("ТаблицаЗначений") Или ТЗ.Количество() = 0 Тогда
		
		СтррРезультат.Готов = Ложь;		
		СтррРезультат.Описание = НСтр("ru = 'Не заполнены настройки агентов.'");
		СтррРезультат.КодСостояния = "СправочникПустой";
		СтррРезультат.Количество = 0;
		
	Иначе
		
		СтррРезультат.Количество = ТЗ.Количество(); // общее количество агентов (готовых и не готовых)
		
		ГотовыеАгенты 		 = 0;
		КритичныеЗамечания 	 = 0;
		НеКритичныеЗамечания = 0;
		
		Для Каждого СтрокаТ Из ТЗ Цикл
			Если СтрокаТ.СтатусНастроек = 1 Тогда // зеленая галка статуса агента
				ГотовыеАгенты = ГотовыеАгенты + 1;
			ИначеЕсли СтрокаТ.СтатусНастроек = 2 Тогда
				КритичныеЗамечания = КритичныеЗамечания + 1;
			ИначеЕсли СтрокаТ.СтатусНастроек = 3 Тогда
				НеКритичныеЗамечания = НеКритичныеЗамечания + 1;
			Иначе // неизвестный статус!
				НеКритичныеЗамечания = НеКритичныеЗамечания + 1;
			КонецЕсли;
		КонецЦикла;
		
		Если КритичныеЗамечания > 0 Тогда
			ЧислоАгентов = ЧислоЦифрамиПредметИсчисленияПрописью(КритичныеЗамечания, НСтр("ru = 'агента, агентов, агентов'"));
			СтррРезультат.Готов = Ложь;			
			СтррРезультат.Описание = СтрШаблон_(НСтр("ru = 'Не заполнены настройки у %1.'"), ЧислоАгентов);
			СтррРезультат.КодСостояния = "НеУВсехЗаполненыНастройки";
		ИначеЕсли ГотовыеАгенты > 0 Тогда
			СтррРезультат.Готов = Истина;
			СтррРезультат.Описание = "";
			СтррРезультат.КодСостояния = ?(НеКритичныеЗамечания > 0, "НеКритичныеЗамечания", "ЕстьГотовыеАгенты");
		Иначе
			СтррРезультат.Готов = Ложь;
			СтррРезультат.Описание = НСтр("ru = 'Нет торговых агентов готовых к обмену данными.'");
			СтррРезультат.КодСостояния = "НетГотовыхАгентов";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтррРезультат;
	
КонецФункции

// Функция проверяет готовность справочника МУ к обмену данными.
//
// Параметры:
//  ОписаниеСтатуса - Строка - в параметре возвращается описание статуса готовности справочника.
//  КодСостояния - Строка - в параметре возвращается идентфикатор состояния справочника.
//
// Возвращаемое значение:
//   Истина - справочник готов к обмену данными, в параметре ОписаниеСтатуса возвращается пустая строка.
//   Ложь - не готов к обмену данными, в параметре ОписаниеСтатуса возвращается описание статуса.
//
Функция СправочникМобильныхУстройствПроверитьГотовность(ТЗ)
	
	СтррРезультат = Новый Структура("Готов,КодСостояния,Описание", Истина, "", "");
	
	Если ТипЗнч(ТЗ) <> Тип("ТаблицаЗначений") Или ТЗ.Количество() = 0 Тогда
		
		СтррРезультат.Описание 	   = НСтр("ru = 'Не заполнен справочник мобильных устройств.'");
		СтррРезультат.КодСостояния = "СправочникПустой";
		СтррРезультат.Готов 	   = Ложь;
		
	КонецЕсли;
	
	Возврат СтррРезультат;
	
КонецФункции

// Функция проверяет готовность виртуальных справочников к обмену данными.
//
// Параметры:
//  ИменаСправочников - Строка - список названий виртуальных справочников через запятую.
//
// Возвращаемое значение:
//   Структура статусов в соответствии с переданным списком названий виртуальных справочников.
//   Если передано единственное название справочника, то возвращается структура статуса справочнкиа только для данного справочника.
//
Функция СправочникиГотовыКРаботе(ИменаСправочников) Экспорт

	СтррРезультат = Новый Структура(ИменаСправочников);
	СтррЗначения  = ПрочитатьЗначенияНастроек(ИменаСправочников);
	
	Для Каждого Элемент Из СтррЗначения Цикл
		ВидСправочника = Элемент.Ключ;
		Если ВидСправочника = "НастройкиАгентов" Тогда
			СтррРезультат[ВидСправочника] = СправочникАгентовПроверитьГотовность(Элемент.Значение);
		ИначеЕсли ВидСправочника = "МобильныеУстройства" Тогда
			СтррРезультат[ВидСправочника] = СправочникМобильныхУстройствПроверитьГотовность(Элемент.Значение);
		Иначе
			ВызватьИсключение("Передан неизвестный вид справочника для чтения из системных настроек: " + ВидСправочника);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ?(СтррРезультат.Количество() = 1, СтррРезультат[ВидСправочника], СтррРезультат);
	
КонецФункции

Функция НастройкиОбменаГотовыКРаботе() Экспорт

	СтррРезультат = Новый Структура("Готов,КодСостояния,Описание", Истина, "", "");
	СтррЗначения  = ПрочитатьЗначенияНастроек("КаталогДанных,КаталогОбмена,СпособОбмена,СОДАдрес,СОДПорт,FTPАдрес,FTPПароль,FTPПользователь");
	
	Если Не ЗначениеЗаполнено(СтррЗначения.КаталогДанных) Тогда
		
		СтррРезультат.Описание = НСтр("ru = 'Не указан каталог данных.'");
		СтррРезультат.КодСостояния = "НеУказанКаталогДанных";
		
	ИначеЕсли Не КаталогСуществует(СтррЗначения.КаталогДанных) Тогда
		
		СтррРезультат.Описание = СтрШаблон_(НСтр("ru = 'Каталог данных не существует (%1).'"), СтррЗначения.КаталогДанных);
		СтррРезультат.КодСостояния = "НеСуществуетКаталогДанных";
		
	ИначеЕсли Не ЗначениеЗаполнено(СтррЗначения.КаталогОбмена) Тогда
		
		СтррРезультат.Описание = НСтр("ru = 'Не указан каталог обмена.'");
		СтррРезультат.КодСостояния = "НеУказанКаталогОбмена";
		
	ИначеЕсли Не КаталогСуществует(СтррЗначения.КаталогОбмена) Тогда
		
		СтррРезультат.Описание = СтрШаблон_(НСтр("ru = 'Каталог обмена не существует (%1).'"), СтррЗначения.КаталогОбмена);
		СтррРезультат.КодСостояния = "НеСуществуетКаталогОбмена";
		
	ИначеЕсли Не ЗначениеЗаполнено(СтррЗначения.СпособОбмена) Тогда
		
		СтррРезультат.Описание = НСтр("ru = 'Не указан способ обмена.'");
		СтррРезультат.КодСостояния = "НеВыбранСпособ";
		
	Иначе
		
		НазванияРеквизитов = "";		
		
		Если СтррЗначения.СпособОбмена = "КаталогОбмена" Тогда // ничего не проверяем
		
		ИначеЕсли СтррЗначения.СпособОбмена = "АПСОД" Тогда 
			
			Если Не ЗначениеЗаполнено(СтррЗначения.СОДАдрес) Тогда
				НазванияРеквизитов = НазванияРеквизитов + ", """ + НСтр("ru = 'Адрес СОД'") + """";
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтррЗначения.СОДПорт) Тогда
				НазванияРеквизитов = НазванияРеквизитов + ", """ + НСтр("ru = 'Порт СОД'") + """";
			КонецЕсли;
			
		ИначеЕсли СтррЗначения.СпособОбмена = "FTP" Тогда 
			
			Если Не ЗначениеЗаполнено(СтррЗначения.FTPПользователь) Тогда
				НазванияРеквизитов = НазванияРеквизитов + ", """ + НСтр("ru = 'Пользователь FTP'") + """";
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтррЗначения.FTPАдрес) Тогда
				НазванияРеквизитов = НазванияРеквизитов + ", """ + НСтр("ru = 'Адрес FTP'") + """";
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтррЗначения.FTPПароль) Тогда
				НазванияРеквизитов = НазванияРеквизитов + ", """ + НСтр("ru = 'Пароль FTP'") + """";
			КонецЕсли;
			
		КонецЕсли;
		
		Если НазванияРеквизитов <> "" Тогда
			
			СтррРезультат.Описание = НСтр("ru = 'В настройках обмена не заполнены реквизиты:'") + " "
				+ Прав(НазванияРеквизитов, СтрДлина(НазванияРеквизитов) - 2) + ".";
			СтррРезультат.КодСостояния = "НеЗаполненыРеквизиты";
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтррРезультат.Готов = ПустаяСтрока(СтррРезультат.Описание); // если нет описания, то ошибок нет
	
	Возврат СтррРезультат;
	
КонецФункции

// ПрограммныйИнтерфейс_ОбщиеПроцедурыИФункцииДляФорм
#КонецОбласти 

#Область ПрограммныйИнтерфейс_СпискиТорговыхТочек

// Функция возвращает параметры детализации списка торговых точек
Функция ПолучитьСписокДетализацииСписковТорговыхТочек() Экспорт

	Список = Новый СписокЗначений;
	Список.Добавить("Организация", 	НСтр("ru = 'Организация'"));
	//{{dm_180521
	//Список.Добавить("Контрагент", 	НСтр("ru = 'Контрагент'"));
	//}}dm_180521
	Список.Добавить("Соглашение", 	НСтр("ru = 'Соглашение'"));
	Список.Добавить("График", 		НСтр("ru = 'График'"));	
	Список.Добавить("ПланПосещений",НСтр("ru = 'План посещений'"));	
	
	Возврат Список;

КонецФункции

// Функция возвращает Истина, если список торговых точек используется для планирования посещений.
// В параметрах ИспользуетсяГрафик, ИспользуетсяПП возвращаются признаки - какой вариант планирования посещений задействован (через График или через ПланПосещений).
Функция СписокТорговыхТочекИспользуетсяДляПланированияПосещений(стррОбъект, ИспользуетсяГрафик = Неопределено, ИспользуетсяПП  = Неопределено) Экспорт
	
	ИспользуетсяГрафик 	= стррОбъект.Детализация.НайтиПоЗначению("График") <> Неопределено;
	ИспользуетсяПП 	   	= стррОбъект.Детализация.НайтиПоЗначению("ПланПосещений") <> Неопределено;
	
	Возврат ИспользуетсяГрафик Или ИспользуетсяПП;
	
КонецФункции

// ПрограммныйИнтерфейс_СпискиТорговыхТочек
#КонецОбласти 

#Область ПрограммныйИнтерфейс_ОбменДанными

Функция КонстантыПолучитьЗначение(ИмяКонстанты) 
	Перем Значение;
	
	//++Дейнеко ВГ 2017-09-25 Бухгалтерия
	Если ИмяКонстанты = "ИспользоватьУпаковкиНоменклатуры" Тогда
		Возврат Ложь;	
	КонецЕсли;
	//--Дейнеко ВГ 2017-09-25 Бухгалтерия
	
	
	Если Не гКэшЧтенияКонстант.Свойство(ИмяКонстанты, Значение) Тогда
		Значение = Константы[ИмяКонстанты].Получить();
		гКэшЧтенияКонстант.Вставить(ИмяКонстанты, Значение);
	КонецЕсли;
	
	Возврат Значение;	
	
КонецФункции

Функция НужноПропуститьТекущегоАгента()
	
	Если ВыбНастройкиАгента.СтатусНастроек = 2 Тогда // для агента все настроено
		Текст = НСтр("ru='Пропущен агент по причине не заполненных настроек.'");
		ОповеститьОСобытии(Текст, "ОшибкаНастройки",, "ТекущийАгент");
		Результат = Истина;
	ИначеЕсли ВыбНастройкиАгента.СтатусНастроек <> 1 Тогда // нет статуса готовности
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Выгрузка данных по переданному агенту или по всем агентам.
Процедура ВыгрузитьДанные(Агент) Экспорт

	ЗагрузитьНастройкиДляРаботыОбмена();
	
	Если Не ВременныеТаблицы.Свойство("НастройкиАгентов") Тогда // значит настройки агентов еще не создавались
		ОповеститьОСобытии(НСтр("ru='Настройки агентов не заданы! Данные не выгружены.'"), "ОшибкаНастройки");
		Возврат;
	КонецЕсли;
	
	//(( sk_190718 Проверяем учет по складам в рамках (MOD-236)
	текСубконтоПоСкладам = ПолучитьСубконтоПоСкладам();
	
	Если текСубконтоПоСкладам = Неопределено Тогда 
		ОповеститьОСобытии(НСтр("ru='В настройке ""Учет запасов"" не предусмотрен учет по складам (местам хранения)! Данные не выгружены.'"));
		Возврат;
	КонецЕсли;
	//)) sk_190718

	Если ИспользоватьХарактеристики И Не ВременныеТаблицы.Свойство("СпрХарактеристикиНоменклатурыСлужебный") Тогда
		тзДанные = Новый ТаблицаЗначений;
		тзДанные.Колонки.Добавить("Идентификатор");
		тзДанные.Колонки.Добавить("Номенклатура");
		тзДанные.Колонки.Добавить("Характеристика");
		ВременныеТаблицы.Вставить("СпрХарактеристикиНоменклатурыСлужебный", тзДанные);
	КонецЕсли;

	Если ЗначениеЗаполнено(Агент) Тогда // выгрузка данных для одного агента
		
		ВыгрузитьДанныеДляАгента(Агент);
		
	Иначе // выгрузка данных для всех агентов
		
		ТЗ = ВременныеТаблицы.НастройкиАгентов;	
		Для Каждого СтрокаТ Из ТЗ Цикл
			ВыгрузитьДанныеДляАгента(СтрокаТ.Пользователь);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

// Формирование файла выгрузки для переданного агента.
Процедура ВыгрузитьДанныеДляАгента(Агент) Экспорт
	
	Если гКэшСравненияКонфигураций = Неопределено Тогда // используем переменную гКэшСравненияКонфигураций как признак, что нужно загрузить настройки обмена
		ЗагрузитьНастройкиДляРаботыОбмена();
	КонецЕсли;
	
	гКэшСпискиОбъектов.Вставить("ОрганизацииВыгрузки", Неопределено); // списки организаций выгрузки от агента к агенту могут отличаться
	
	ВыбНастройкиАгента = ПолучитьНастройкиАгента(Агент);
	
	Если НужноПропуститьТекущегоАгента() Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОСобытии("Выгрузка для агента: " + СокрЛП(Агент));	
	
	ИмяФайлаВыгрузки = КаталогВременныхФайловАгента() + "FromCDB.xml";
	ДокОбмена = СоздатьФайлВыгрузкиДанных(ИмяФайлаВыгрузки);

	МенеджерВТ = МенеджерВТПолучить();
	
	ВыгрузитьКонстанты(ДокОбмена);
	
	тзКартинки = Неопределено;
	
	ВыгрузитьСправочники(ДокОбмена, МенеджерВТ, тзКартинки);
	
	ВыгрузитьДокументы(ДокОбмена, МенеджерВТ);
	
	//++Дейнеко ВГ 2017-09-18 Бухгалтерия

	ВыгрузитьИзображения(ДокОбмена, тзКартинки);
	
	ВыгрузитьПодтверждения(ДокОбмена);

	//--Дейнеко ВГ 2017-09-18 Бухгалтерия
	ЗакрытьФайлВыгрузки(ДокОбмена);
	
	СохранитьСпрХарактеристикиНоменклатурыСлужебный();
	
	ИмяФайлаАрхиваКартинок = СформироватьАрхивСКартинками(тзКартинки);
	
	ФайлОтправки = УпаковатьФайл(ИмяФайлаВыгрузки, ИмяФайлаАрхиваКартинок);
	
	ОтправитьФайлПоСпособуОбмена(ФайлОтправки);

КонецПроцедуры

// Загрузка данных по переданному агенту или по всем агентам.
// Функция возвращает количество агентов, по которым загружены данные.
Функция ЗагрузитьДанные(Агент) Экспорт

	гтзУпаковки = ПрочитатьЗначениеНастройки("УпаковкиНоменклатуры");
	//{{dm_180817
	Если гтзУпаковки = Неопределено Тогда
		гтзУпаковки = СоздатьТаблицуУпаковок(Ложь);
	КонецЕсли;
	//}}dm_180817
	
	Количество = 0;
	
	ЗагрузитьНастройкиДляРаботыОбмена();
	
	Если Не ВременныеТаблицы.Свойство("НастройкиАгентов") Тогда // значит настройки агентов еще не создавались
		ОповеститьОСобытии(НСтр("ru='Настройки агентов не заданы! Данные не выгружены.'"), "ОшибкаНастройки");
		Возврат Ложь;
	КонецЕсли;
	
	//{{dm_180606 Перед загрузкой данных сохраняем значение константы "ФиксированноеВремяВДокументах" в настройках 
	// и отключаем эту настройку
	Если гКонфигурация = "Бухгалтерия_RU" Тогда
		ДокВремяАвто = Константы.ФиксированноеВремяВДокументах.Получить();
		СохранитьЗначениеНастройки("ДокВремяАвто", ДокВремяАвто);
		Константы.ФиксированноеВремяВДокументах.Установить(Ложь);
	КонецЕсли;
	//}}dm_180606
	
	Если ЗначениеЗаполнено(Агент) Тогда // загрузка данных для одного агента
		
		Если ЗагрузитьДанныеДляАгента(Агент) Тогда
			Количество = Количество + 1
		КонецЕсли;
		
	Иначе // загрузка данных для всех агентов
		
		ТЗ = ВременныеТаблицы.НастройкиАгентов;	
		Для Каждого СтрокаТ Из ТЗ Цикл
			Если ЗагрузитьДанныеДляАгента(СтрокаТ.Пользователь) Тогда
				Количество = Количество + 1;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	//{{dm_180606 После загрузки данных воссстанавливаем значение константы "ФиксированноеВремяВДокументах" из настроек
	Если гКонфигурация = "Бухгалтерия_RU" Тогда
		ДокВремяАвто = ПрочитатьЗначениеНастройки("ДокВремяАвто");
		Константы.ФиксированноеВремяВДокументах.Установить(ДокВремяАвто);
	КонецЕсли;
	//}}dm_180606
	
	Возврат Количество;

КонецФункции

// Функция возвращает Истина, если данные от агента были успешно загружены.
Функция ЗагрузитьДанныеДляАгента(Агент)

	ВыбНастройкиАгента = ПолучитьНастройкиАгента(Агент);
	
	Если НужноПропуститьТекущегоАгента() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ИспользоватьАвтообмен Или СпособОбмена = "АПСОД" Тогда
		ОповеститьОСобытии("Загрузка для агента: " + СокрЛП(Агент));
	КонецЕсли;
	
	Каталог = ЗагрузитьФайлПоСпособуОбмена();
	Если Каталог = Неопределено Тогда // была ошибка копирования/скачивания
		Возврат Ложь;
	КонецЕсли;
	
	ФайлОбмена = ФайлОбменаРаспакованный(Каталог);
	Если ФайлОбмена = Неопределено Тогда
		ОповеститьОСобытии("В zip-архиве не найден файл загрузки.");
	Иначе
		Результат = ЗагрузитьДанныеИзФайлаОбмена(Агент, ФайлОбмена);
		Попытка
			УдалитьФайлы(ФайлОбмена.ПолноеИмя);
		Исключение
		КонецПопытки;
		Если Не Результат Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли;
	
	Попытка
		ФайлТрека = ФайлОбменаТрек(Каталог);	
		Если ФайлТрека <> Неопределено Тогда
			ЗагрузитьТрек(ФайлТрека, ВыбНастройкиАгента.СсылкаМУ);
		
			УдалитьФайлы(ФайлТрека.ПолноеИмя);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если ОтветнаяВыгрузка Тогда
		ОповеститьОСобытии("Выгрузка ответных данных для агента: " + СокрЛП(Агент));
		ВыгрузитьДанныеДляАгента(Агент);
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

// Возвращает папку, куда скопирован и распакован файл обмена,
// или Неопределено, если произошла ошибка.
//
Функция ЗагрузитьФайлПоСпособуОбмена()

	Если СпособОбмена = "АПСОД" Тогда
		Возврат СОДЗагрузитьФайл();
	ИначеЕсли СпособОбмена = "FTP" Тогда	
		Возврат ФТПЗагрузитьФайл();
	ИначеЕсли СпособОбмена = "КаталогОбмена" Тогда
		Возврат КОЗагрузитьФайл();		
	Иначе
		ВызватьИсключение("Неизвестный способ обмена: " + СпособОбмена);
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция РаспаковатьФайлОбменаВПапку(Источник, КаталогНазначения, ИсточникЯвляетсяКаталогом)
	
	Попытка
		УдалитьФайлы(КаталогНазначения, "To*.*");
		УдалитьФайлы(КаталогНазначения, "gpstrack.txt");
	Исключение
	КонецПопытки;
	
	ФайлАрхив = ?(ИсточникЯвляетсяКаталогом, НайтиФайлОбменаВКаталоге(Источник), Новый Файл(Источник));
	
	Если ФайлАрхив = Неопределено Тогда
		
		Если ИсточникЯвляетсяКаталогом Тогда
			Текст = СтрШаблон_("Данные от агента отсутствуют в каталоге ""%1"".", Источник);
		Иначе
			Текст = "Данные от агента отсутствуют на сервере.";
		КонецЕсли;
		ОповеститьОСобытии(Текст,,, "ТекущийАгент");
		
		Возврат Ложь;
		
	Иначе
		ПарольАрхива = СокрЛП(ВыбНастройкиАгента.НастройкиМобильногоПриложения.ПарольНастроек.Значение);
		АрхивОбмена = Новый ЧтениеZipФайла(ФайлАрхив.ПолноеИмя, ПарольАрхива);
		АрхивОбмена.ИзвлечьВсе(КаталогНазначения);
		АрхивОбмена.Закрыть();
		Попытка
			УдалитьФайлы(ФайлАрхив.ПолноеИмя);
		Исключение
			Текст = "Не удалось удалить файл загрузки: " + ФайлАрхив.ПолноеИмя + " по причине: " + ОписаниеОшибки();
			ОповеститьОСобытии(Текст, "ОшибкаОбмен",, "ТекущийАгент");
		КонецПопытки;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции	

Процедура ОтправитьФайлПоСпособуОбмена(ФайлОтправки)

	ИмяФайлаНаСервере = "From1C.zip";
	КаталогАгента = Неопределено;
	
	Если СпособОбмена = "АПСОД" Тогда
		
		КаталогОбменаАгентаПолучитьИПроверить(КаталогАгента);
		Если ЗначениеЗаполнено(КаталогАгента) Тогда
			ИмяФайлаАПС = КаталогАгента + ИмяФайлаНаСервере;
			КопироватьФайл(ФайлОтправки, ИмяФайлаАПС);
			//{{dm_180529
			Текст = СтрШаблон_("Данные для агента выгружены в файл ""%1"".", ИмяФайлаАПС);
			ОповеститьОСобытии(Текст,,, "ТекущийАгент");
			//}}dm_180529
		КонецЕсли; 
		
	ИначеЕсли СпособОбмена = "FTP" Тогда
		
		ПодключениеFTP = ФТПСоздатьПодключение();
		Если ПодключениеFTP = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ФТППапка = СтрЗаменить(ВыбНастройкиАгента.КаталогОбмена, "\", "/");
		
		ФТППапкаСервера = СтрЗаменить(FTPКаталогСервера, "\", "/");
		Если Не ПустаяСтрока(ФТППапкаСервера) И Лев(ФТППапка, 1) <> "\" Тогда // указан начальный каталог сервера и указана относительная папка агента
			Если ПодключениеFTP.НайтиФайлы(ФТППапкаСервера).Количество() = 0 Тогда
				ПодключениеFTP.СоздатьКаталог(ФТППапкаСервера);
			КонецЕсли;
			ПодключениеFTP.УстановитьТекущийКаталог(ФТППапкаСервера);
		КонецЕсли;
		
		Если ПодключениеFTP.НайтиФайлы(ФТППапка).Количество() = 0 Тогда
			ПодключениеFTP.СоздатьКаталог(ФТППапка);
		КонецЕсли;
		
		ИмяФайлаFTP = ФТППапка + "/" + ИмяФайлаНаСервере;
		
		Попытка
			ПодключениеFTP.Записать(ФайлОтправки, ИмяФайлаFTP);
			Текст = "Данные для агента успешно выгружены на FTP-сервер.";
			ОповеститьОСобытии(Текст,,, "ТекущийАгент");
		Исключение	
			Текст = "Данные для агента не отправлены! Причина: ";
			Если ПодключениеFTP.НайтиФайлы(ФТППапка).Количество() = 0 Тогда
				Текст = Текст + "не существует папка на FTP-сервере " + ФТППапка;
			Иначе
				Текст = Текст + ОписаниеОшибки();				
			КонецЕсли;
			ОповеститьОСобытии(Текст, "ОшибкаОбмен",, "ТекущийАгентСообщить");
		КонецПопытки;
		
	ИначеЕсли СпособОбмена = "КаталогОбмена" Тогда
		
		КаталогОбменаАгентаПолучитьИПроверить(КаталогАгента);
		Если ЗначениеЗаполнено(КаталогАгента) Тогда
			ИмяФайлаКО = КаталогАгента + ИмяФайлаНаСервере;
			КопироватьФайл(ФайлОтправки, ИмяФайлаКО);
			Текст = СтрШаблон_("Данные для агента выгружены в файл ""%1"".", ИмяФайлаКО);
			ОповеститьОСобытии(Текст,,, "ТекущийАгент");
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение("Неизвестный способ обмена: " + СпособОбмена);
		
	КонецЕсли;

	Попытка
		УдалитьФайлы(ФайлОтправки);
	Исключение
	КонецПопытки;

КонецПроцедуры

#Область ПрограммныйИнтерфейс_ОбменДанными_ФТП

Функция ФТПСоздатьПодключение()
	
	Если ПустаяСтрока(FTPАдрес) Или ПустаяСтрока(FTPПользователь) Тогда
		Текст = "В настройках обмена заданы не все параметры соединения с FTP-сервером. Работа с FTP невозможна!";
		ОповеститьОСобытии(Текст, "ОшибкаНастройки");
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ПодключениеКФТП = Новый FTPСоединение(FTPАдрес,, FTPПользователь, FTPПароль,, FTPПассивныйРежим, 0);		
	Исключение
		ОповеститьОСобытии("Ошибка подключения. Причина: " + ОписаниеОшибки(), "ОшибкаОбмен");
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ПодключениеКФТП;
	
КонецФункции //Функция СоздатьПодключениеКФТП()

// Возвращает папку, куда скопирован и распакован файл обмена, 
// или Неопределено, если произошла ошибка.
// 
Функция ФТПЗагрузитьФайл()
	
	ПодключениеКФТП = ФТПСоздатьПодключение();	
	Если ПодключениеКФТП = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	ИмяФайла = "To1C.zip";
	
	ФТППапка = ВыбНастройкиАгента.КаталогОбмена;
	Если ПустаяСтрока(ФТППапка) Тогда
		Текст = "В ""Настройках агентов"" у агента не указана папка обмена!";
		ОповеститьОСобытии(Текст, "ОшибкаНастройки",, "ТекущийАгент");
		Возврат Неопределено;
	КонецЕсли;
	
	ФТППапка = ДополнитьСлешВПуть(ФТППапка, "/");
	
	ФТППапкаСервера = СтрЗаменить(FTPКаталогСервера, "\", "/");
	Если Не ПустаяСтрока(ФТППапкаСервера) И Лев(ФТППапка, 1) <> "\" Тогда // указан начальный каталог сервера и указана относительная папка агента
		ПодключениеКФТП.УстановитьТекущийКаталог(ФТППапкаСервера);
	КонецЕсли; 
	
	КаталогТ = КаталогВременныхФайловДляТранспорта(ВыбНастройкиАгента.КаталогОбмена);
	
	ИмяФайлаФТП   = ФТППапка + ИмяФайла;
	ФайлЛокальный = КаталогТ + ИмяФайла;
	
	// копируем файлы с данными с ФТП в каталог временных файлов
	Попытка    		
		Если ПодключениеКФТП.НайтиФайлы(ФТППапка, "To1C.*").Количество() = 0 Тогда
			ОповеститьОСобытии("Нет данных на FTP-сервере.",,, "ТекущийАгентСообщить");
			Возврат Неопределено;
		Иначе
			ПодключениеКФТП.Получить(ИмяФайлаФТП, ФайлЛокальный);				
		КонецЕсли;  		
	Исключение             
		Текст = "Ошибка при скачивании файла с FTP-сервера. Возможная причина: отсутсвует папка агента (%1) на FTP-сервере. Данные от агента не загружены!";
		ОповеститьОСобытии(СтрШаблон_(Текст, ВыбНастройкиАгента.КаталогОбмена), "ОшибкаОбмен",, "ТекущийАгент");
		Текст = "Папка на FTP-сервере будет создана автоматически при выгрузке данных из 1С:Предприятия на FTP-сервер.";
		ОповеститьОСобытии(Текст,,, "ТекущийАгент");
		Возврат Неопределено;			
	КонецПопытки;   	
	
	// удаляем файл с данными на ФТП-сервере
	Попытка
		ПодключениеКФТП.Удалить(ФТППапка, "To1C.*");
	Исключение
		Текст = "Не удалось удалить файл ""To1C.zip"" на FTP-сервере. Причина: " + ОписаниеОшибки();
		ОповеститьОСобытии(Текст, "ОшибкаОбмен",, "ТекущийАгент");
	КонецПопытки; 
	
	Каталог = КаталогВременныхФайловАгента();	
	Если Не РаспаковатьФайлОбменаВПапку(ФайлЛокальный, Каталог, Ложь) Тогда
		Каталог = Неопределено;
	КонецЕсли;
	
	Возврат Каталог;
	
КонецФункции // ЗагрузитьФайлСФТП() 

// ПрограммныйИнтерфейс_ОбменДанными_ФТП
#КонецОбласти 

#Область ПрограммныйИнтерфейс_ОбменДанными_СОД

// Возвращает папку, куда скопирован и распакован файл обмена,
// или Неопределено, если произошла ошибка.
// 
Функция СОДЗагрузитьФайл()

	Каталог = КаталогВременныхФайловАгента(); // функция всегда возвращает корректный результат
	
	КаталогОбменаАгента = КаталогОбменаАгента(Ложь);
	
	Если КаталогОбменаАгента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	ФайлТрек = ФайлОбменаТрек(КаталогОбменаАгента);
	
	Если ФайлТрек <> Неопределено Тогда
		КопироватьФайл(ФайлТрек.ПолноеИмя, Каталог + ФайлТрек.Имя);
		Попытка
			УдалитьФайлы(ФайлТрек.ПолноеИмя);
		Исключение
			Текст = "Не удалось удалить файл трека: " + ФайлТрек.ПолноеИмя + " по причине: " + ОписаниеОшибки();
			ОповеститьОСобытии(Текст, "ОшибкаОбмен",, "ТекущийАгент");
		КонецПопытки;
	КонецЕсли;

	Если Не РаспаковатьФайлОбменаВПапку(КаталогОбменаАгента, Каталог, Истина) Тогда
		Каталог = Неопределено;
	КонецЕсли;
	
	Возврат Каталог;

КонецФункции


Функция КОЗагрузитьФайл()
	
	Каталог = КаталогВременныхФайловАгента(); // функция всегда возвращает корректный результат
	
	КаталогОбменаАгента = КаталогОбменаАгента(Ложь);
	
	Если КаталогОбменаАгента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если Не РаспаковатьФайлОбменаВПапку(КаталогОбменаАгента, Каталог, Истина) Тогда
		Каталог = Неопределено;
	КонецЕсли;
	
	Возврат Каталог;
	
КонецФункции

// Функция возвращает путь к каталогу обмена для агента, указанного в реквизите обработки ВыбНастройкиАгента.
// Если настройки не заданы или если не удалось создать каталог, возращает Неопределено.
// 
// Параметры:
//	СоздаватьКаталог - Булево - Если Истина, то каталог будет создан (если его нет), иначе каталог будет только проверен на существование.
//
Функция КаталогОбменаАгента(СоздаватьКаталог)

	Если ПустаяСтрока(КаталогОбмена) Тогда
		
		ОповеститьОСобытии("Не указан каталог обмена в ""Настройках обмена"".", "ОшибкаНастройки");
		Результат = Неопределено;
		
	ИначеЕсли ПустаяСтрока(ВыбНастройкиАгента.КаталогОбмена) Тогда
		
		Текст = "Не указан каталог обмена для агента в ""Настройках агентов"", агент: " + Строка(ВыбНастройкиАгента.Пользователь);
		ОповеститьОСобытии(Текст, "ОшибкаНастройки", , "ТекущийАгент");
		Результат = Неопределено;
		
	ИначеЕсли Не СоздаватьКаталог Тогда // проверяем каталог на существование
		
		КаталогАгента = ДополнитьСлешВПуть(КаталогОбмена) + ВыбНастройкиАгента.КаталогОбмена;
		Если КаталогСуществует(КаталогАгента) Тогда
			Результат = ДополнитьСлешВПуть(КаталогАгента);
		Иначе
			Текст = "Не существует каталог """ + КаталогАгента + """, указанный в настройках агента. ";
			Если СпособОбмена = "АПСОД" Тогда
				Текст = Текст + "Обновите файл настроек службы СОД в ""Настройках обмена""."; 
			КонецЕсли;
			ОповеститьОСобытии(Текст, "ОшибкаНастройки", , "ТекущийАгентСообщить");
			Результат = Неопределено;			
		КонецЕсли;
		
	Иначе // пытаемся создать каталог, если его нет.
		
		ПроверитьИСоздатьКаталог(КаталогОбмена);
		КаталогАгента = ДополнитьСлешВПуть(КаталогОбмена) + ВыбНастройкиАгента.КаталогОбмена;
		ПроверитьИСоздатьКаталог(КаталогАгента);
		Если КаталогСуществует(КаталогАгента) Тогда
			Результат = ДополнитьСлешВПуть(КаталогАгента);
		Иначе
			Текст = "Не удалось создать каталог обмена для агента, каталог: " + КаталогАгента; 
			ОповеститьОСобытии(Текст, "ОшибкаНастройки", , "ТекущийАгент");
			Результат = Неопределено;
		КонецЕсли;			
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Процедура пытается получить каталог обмена данными для агента.
// Если попытка неудачная, то выводистя сообщение.
// Каталог вовзращается в параметре Каталог.
Процедура КаталогОбменаАгентаПолучитьИПроверить(Каталог)
	
	Каталог = КаталогОбменаАгента(Истина);
	Если Не ЗначениеЗаполнено(Каталог) Тогда
		Текст = "Данные для агента не выгружены - не задан каталог обмена агента.";
		ОповеститьОСобытии(Текст,,, "ТекущийАгентСообщить");
	КонецЕсли; 
	
КонецПроцедуры

// Загружает данные из файла обмена по данным из внешнего события.
// Содержимое массива мПараметры:
//	0-й - идентификатор МУ
//	1-й - псевдоним торгвого агента (владельца КПК)
//	2-й - директория обмена данными 
//	3-й - имя полученного с КПК файла с директорией
//	4-й - время сеанса
//	5-й - контрольная сумма полученного файла
Функция СОДЗагрузитьДанныеПоВнешнемуСобытию(мПараметры, ЗагрузитьВсеНастройки = Ложь) Экспорт
	
	стрИдМУ 	= мПараметры[0];
	Псевдоним 	= мПараметры[1];
	
	СтррРезультат = Новый Структура("ЕстьОшибки,Сообщения", Ложь, Новый Массив);
	
	Если ЗагрузитьВсеНастройки Тогда
		ЗагрузитьНастройкиДляРаботыОбмена();
	КонецЕсли;
	
#Область ПроверкаСправочников

	Если Не ВременныеТаблицы.Свойство("МобильныеУстройства") Тогда
		ВывестиСообщение(СтррРезультат, НСтр("ru = 'Не заполнен справочник мобильных устройств.'"), Истина);
	КонецЕсли;
	
	Если Не ВременныеТаблицы.Свойство("НастройкиАгентов") Тогда 
		ВывестиСообщение(СтррРезультат, НСтр("ru = 'Не заполнены настройки торговых агентов.'"), Истина);
	КонецЕсли;
	
	Если СтррРезультат.ЕстьОшибки Тогда
		Возврат СтррРезультат;
	КонецЕсли;
	
	идМУ = Новый УникальныйИдентификатор(стрИдМУ);
	ЭлементМУ = ВременныеТаблицы.МобильныеУстройства.Найти(идМУ, "ИдентификаторМУ");
	Если ЭлементМУ = Неопределено Тогда
		Текст = СтрШаблон_(НСтр("ru = 'Не найдено мобильное устройство с идентификатором ""%1"".'"), стрИдМУ);
		ВывестиСообщение(СтррРезультат, Текст, Истина);
		ВывестиСообщение(СтррРезультат, НСтр("ru = 'Проверьте настройки агентов и обновите файл настроек обмена СОД.'"));
		Возврат СтррРезультат;
	КонецЕсли;
	
	ЭлементАгент = ВременныеТаблицы.НастройкиАгентов.Найти(ЭлементМУ.ID, "СсылкаМУ");
	Если ЭлементАгент = Неопределено Тогда
		Текст = СтрШаблон_(НСтр("ru = 'Не найден агент для мобильного устройства с идентификатором ""%1"" (%2).'"), стрИдМУ, ЭлементМУ.Наименование);
		ВывестиСообщение(СтррРезультат, Текст, Истина);
		ВывестиСообщение(СтррРезультат, НСтр("ru = 'Проверьте настройки агентов и обновите файл настроек обмена СОД.'"));
		Возврат СтррРезультат;
	КонецЕсли;
	
	КаталогОбменаИзСпрАгентов = СокрЛП(ЭлементАгент.КаталогОбмена);
	КаталогОбменаИзСОД = СокрЛП(мПараметры[2]);
	Если НРег(КаталогОбменаИзСпрАгентов) <> НРег(КаталогОбменаИзСОД) Тогда
		Текст = СтрШаблон_(НСтр("ru = 'По сведениям из настроек СОД поступили данные от агента ""%1"", папка: ""%2"".'"), Псевдоним, КаталогОбменаИзСОД);
		ВывестиСообщение(СтррРезультат, Текст, Истина);
		Текст = СтрШаблон_(НСтр("ru = 'По сведениям из настроек агентов указаны другие данные (агент ""%1"", папка: ""%2"")!'"), ЭлементАгент.Пользователь, КаталогОбменаИзСпрАгентов);
		ВывестиСообщение(СтррРезультат, Текст);
		ВывестиСообщение(СтррРезультат, НСтр("ru = 'Папки обмена отличаются! Проверьте настройки агентов и обновите файл настроек обмена СОД.'"));
		Возврат СтррРезультат;
	КонецЕсли;

// ПроверкаСправочников
#КонецОбласти 

	ЗагрузитьДанныеДляАгента(ЭлементАгент.Пользователь);
	
	Возврат СтррРезультат;
	
КонецФункции

Функция СОДПопыткаСгенерироватьФайлНастройки() Экспорт

	СпособОбмена = ПрочитатьЗначениеНастройки("СпособОбмена");
	
	Если СпособОбмена = "АПСОД" Тогда
		Возврат СОДСгенерироватьФайлНастройки();
	Иначе
		мЗамечания = Новый Массив;
		ДобавитьЗамечание(мЗамечания, НСтр("ru='В настройках выключен способ обмена через Агент Плюс СОД'"), "СпособОбмена");
		Возврат Новый Структура("Замечания", мЗамечания);
	КонецЕсли;

КонецФункции

// Добавляет сообщение в массив сообщений для будущего вывода на Клиенте.
Процедура ДобавитьЗамечание(мЗамечания, Описание, Реквизит)
	СтррЗамечание = Новый Структура("Описание,Реквизит", Описание, Реквизит);
	мЗамечания.Добавить(СтррЗамечание);
КонецПроцедуры

// Функция генерирует и возвращает текст файла настройки СОД.
// Предварительно проверяет зависимые настройки СОД.
// Фукнкция не проверяет существование папки обмена, т.к. запускается на Сервере.
Функция СОДСгенерироватьФайлНастройки() Экспорт
	
	СтррРезультат = Новый Структура;
	
	СтррЗначения = ПрочитатьЗначенияНастроек("НастройкиАгентов,МобильныеУстройства,СОДПорт,КаталогОбмена");
	
	ТЗНастройкиАгентов = СтррЗначения.НастройкиАгентов;
	ТЗМУ 			   = СтррЗначения.МобильныеУстройства;
	
#Область ПроверкаРеквизитовИСправочников
	// Проверяем значения настроек СОД и зависимых настроек
	мЗамечания = Новый Массив;
	
	Если ПустаяСтрока(СтррЗначения.КаталогОбмена) Тогда
		ДобавитьЗамечание(мЗамечания, НСтр("ru='Не указано значение настройки ""Каталог обмена""!'"), "КаталогОбмена");
	КонецЕсли;
	
	Если СтррЗначения.СОДПорт = 0 Тогда
		ДобавитьЗамечание(мЗамечания, НСтр("ru='Не указан порт службы Агент Плюс СОД'"), "СОДПорт");
	КонецЕсли;
	
	СтррСтатус = СправочникАгентовПроверитьГотовность(ТЗНастройкиАгентов);
	Если Не СтррСтатус.Готов Тогда
		ДобавитьЗамечание(мЗамечания, СтррСтатус.Описание, "НастройкиАгентов");
	КонецЕсли;
	
	СтррСтатус = СправочникМобильныхУстройствПроверитьГотовность(ТЗМУ);
	Если Не СтррСтатус.Готов Тогда
		ДобавитьЗамечание(мЗамечания, СтррСтатус.Описание, "МобильныеУстройства");
	КонецЕсли;
	
	СтррРезультат.Вставить("Замечания", мЗамечания);
	
	Если мЗамечания.Количество() > 0 Тогда
		Возврат СтррРезультат;
	КонецЕсли;
	
// ПроверкаРеквизитовИСправочников
#КонецОбласти 
	
	ИдКонфигурации = ВРег(Строка(Новый УникальныйИдентификатор));
	
	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку("<?xml version=""1.0"" encoding=""UTF-16""?>");
	Текст.ДобавитьСтроку("<APlusServer VERSION=""2.5"">");
	Текст.ДобавитьСтроку("<ServerConfig PortExternal=""" + Формат(СтррЗначения.СОДПорт, "ЧГ=0'") 
		+ """ ConfigID=""" + ИдКонфигурации + """ />");
	Текст.ДобавитьСтроку("<!-- PortExternal - номер порта для запросов от мобильного устройства -->");
	Текст.ДобавитьСтроку("<!-- Образец описания настроек для мобильного устройства: -->");
	Текст.ДобавитьСтроку("<!-- PPC DEVICE_ID=""00000000-0000-0000-0000-000000000000"" PSEUDONIM=""Agent1"" DIRECTORY=""PPC1"" -->");
	
	КоличествоАгентов  = 0;
	
	Для Каждого НастройкаАгента Из ТЗНастройкиАгентов Цикл
		
		Если НастройкаАгента.СтатусНастроек <> 1 Тогда // включаем только для агентов с зелеными галками - для неработающих агентов МУ от обмена отключаем
			Продолжить;
		КонецЕсли;
		
		СсылкаМУ = НастройкаАгента.СсылкаМУ;
		МУ = ТЗМУ.Найти(СсылкаМУ, "ID");
		
		Если МУ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИдМУ 		= ВРег(Строка(МУ.ИдентификаторМУ));
		Псевдоним 	= СокрЛП(Строка(НастройкаАгента.Пользователь)) + " (" + СокрЛП(МУ.Наименование) + ")";
		Каталог		= НастройкаАгента.КаталогОбмена;
		
		Текст.ДобавитьСтроку("<PPC DEVICE_ID=""" + ИдМУ + """ PSEUDONIM=""" + Лев(Псевдоним, 60) + """ DIRECTORY=""" + Каталог + """ />");
		КоличествоАгентов = КоличествоАгентов + 1;
		
	КонецЦикла;
	
	Текст.ДобавитьСтроку("</APlusServer>");
	
	ПолноеИмяФайла = ДополнитьСлешВПуть(СтррЗначения.КаталогОбмена) + "config.xml";
	
	СтррРезультат.Вставить("Текст", 			Текст);
	СтррРезультат.Вставить("Кодировка", 		КодировкаТекста.UTF16);
	СтррРезультат.Вставить("ПолноеИмяФайла", 	ПолноеИмяФайла);
	СтррРезультат.Вставить("КоличествоАгентов", КоличествоАгентов);
	
	Возврат СтррРезультат;
	
КонецФункции // СгенерироватьФайлНастройкиСОД

// ПрограммныйИнтерфейс_ОбменДанными_СОД
#КонецОбласти

// Преобразует исходную строку в транслит.
Функция СтрокаЛатиницей(Знач Строка) Экспорт
	
	Результат = "";
	
	Буквы = "аa,бb,вv,гg,дd,еe,ёe,жzh,зz,иi,йy,кk,лl,мm,нn,оo,пp,рr,сs,тt,уu,фf,хkh,цts,чch,шsh,щshch,ъ,ыy,ь,эe,юyu,яya,";
	
	ПредыдущийСимвол = "";
	Для Позиция = 1 По СтрДлина(Строка) Цикл
		Символ = Сред(Строка, Позиция, 1);
		Если КодСимвола(Символ) < 128 Тогда
			СимволЛатиницей = Символ;
		Иначе
			ПозНачала = Найти(Буквы, НРег(Символ)); // Поиск соответствия без учета регистра.			
			Если ПозНачала = 0 Тогда
				// Другие символы остаются "как есть".
				СимволЛатиницей = Символ;
			Иначе
				ПозНачала = ПозНачала + 1;
				ПозКонца = ПозНачала;
				Пока Сред(Буквы, ПозКонца, 1) <> "," Цикл
					ПозКонца = ПозКонца + 1;
				КонецЦикла;
				СимволЛатиницей = Сред(Буквы, ПозНачала, ПозКонца - ПозНачала);
				Если Символ = ВРег(Символ) Тогда
					СимволЛатиницей = ВРег(СимволЛатиницей); // восстанавливаем регистр
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Результат = Результат + СимволЛатиницей;
		ПредыдущийСимвол = СимволЛатиницей;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция сокращает слово до N символов. Слово передается латиницей.
Функция СократитьСлово(Слово, МаксДлина)
	
	Длина = СтрДлина(Слово);
	Если Длина <= МаксДлина Тогда
		Возврат Слово;
	КонецЕсли;
	
	Результат = Лев(Слово, МаксДлина - 1); // пытаемся последним символом добавить согласную букву
	Для Поз = МаксДлина По Длина Цикл
		Символ = Сред(Слово, Поз, 1);
		Если 0 = Найти("aeiou", Символ) Тогда // согласная буква
			Результат = Результат + Символ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрДлина(Результат) <> МаксДлина Тогда
		Результат = Лев(Слово, МаксДлина);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает уникальное название для имени файла на основе переданного имени.
// Если в переданном имени есть несколько слов, то функция стремится первые три слова включить в название по правилу:
// первые 4 символа - от первого слова + по одному символу от второго и третьего слова (т.е. сокращение от фамилии и инициалов).
// 
// Параметры:
//	Название - Строка - исходная строка, на основании которой генерировать название.
//	мЗапретныеНазвания - Массив - массив названий для проверки на уникальность.
//
Функция ПреобразоватьВНазваниеКаталога(Знач Название, мЗапретныеНазвания)
	
	Название = НРег(СтрокаЛатиницей(СокрЛП(Название)));
	
	ИсключаемыеСимволы = ",;:?!-+\/=<>~'""@#$%^&*()[]{}|&"; // запрещенные символы в названии имен файлов
	ВсегоИсключать = СтрДлина(ИсключаемыеСимволы);
	Для Поз = 1 По ВсегоИсключать Цикл // цикл исключения запрещенных символов
		ИсключитьСимвол = Сред(ИсключаемыеСимволы, Поз, 1);
		Название = СтрЗаменить(Название, ИсключитьСимвол, "");
	КонецЦикла;
	
	Название = СокрЛП(СтрЗаменить(Название, ".", " ")); // заменяем точки на пробелы
	
	// исключаем идущие подряд пробелы
	ПрежнееНазвание = Неопределено;
	Пока Название <> ПрежнееНазвание Цикл
		ПрежнееНазвание = Название;
		Название = СтрЗаменить(Название, "  ", " ");
	КонецЦикла;
	
	Если ПустаяСтрока(Название) Тогда
		Название = "folder";
	ИначеЕсли СтрДлина(Название) < 6 Тогда
		Название = Лев(Название + "_fldr", 6);
	Иначе
		мСлова = СтрРазделить_(Название, " ");
		Если мСлова.Количество() > 1 Тогда // название из 2 и более слов
			Название = СократитьСлово(мСлова[0], 4) + Лев(мСлова[1], 1) + ?(мСлова.Количество() > 2, Лев(мСлова[2], 1), "") + "_fldr";
		КонецЕсли;
		Название = Лев(Название, 6);		
	КонецЕсли;
	
	ПрежнееНазвание = Название;
	Номер = 1;
	Пока мЗапретныеНазвания.Найти(Название) <> Неопределено Цикл
		Название = ПрежнееНазвание + Строка(Номер);
		Номер = Номер + 1;
	КонецЦикла;
	
	Возврат Название;
	
КонецФункции

// Функция генерирует имя папки 
Функция ПреобразоватьВНазваниеКаталогаИзИдентификатораМУ(СсылкаМУ, тзМУ)
	
	Результат = "";	
	Идентификатор = Неопределено;

	стзМУ = тзМУ.Найти(СсылкаМУ, "ID");
	Если стзМУ = Неопределено Тогда // ошибка - МУ с идентификатором СсылкаМУ не найдено
	ИначеЕсли ЗначениеЗаполнено(стзМУ.ИдентификаторМУ) Тогда
		Идентификатор = стзМУ.ИдентификаторМУ;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Результат = НРег(СтрЗаменить(Строка(Идентификатор), "-" ,""));
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

// Название каталога, которое интерпретируется как автоматически генерируемое.
Функция НазваниеАвтоКаталога() Экспорт
	
	Возврат НСтр("ru = 'Авто'");
	
КонецФункции

// Процедура заполняет названия каталогов агентов уникальными значениями.
Процедура ЗаполнитьНазванияКаталоговАгентов() Экспорт

	мНазванияКаталогов = НастройкиАгентов.ВыгрузитьКолонку("КаталогОбмена");
	АвтоКаталог = НРег(НазваниеАвтоКаталога());
	ИменаПодкаталоговНаОсновеФИО = ПрочитатьЗначениеНастройки("ИменаПодкаталоговОбменаНаОсновеФИО");
	Если ИменаПодкаталоговНаОсновеФИО = Неопределено Тогда
		ИменаПодкаталоговНаОсновеФИО = Ложь;
	КонецЕсли; 
	
	Если Не ИменаПодкаталоговНаОсновеФИО Тогда
	    тзМУ = ПрочитатьЗначениеНастройки("МобильныеУстройства");
		Если ТипЗнч(тзМУ) <> Тип("ТаблицаЗначений") Тогда // МУ еще нет в БД, задать каталоги не можем
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Для Каждого СтрокаТ Из НастройкиАгентов Цикл
		Если ПустаяСтрока(СтрокаТ.КаталогОбмена) Или СокрЛП(НРег(СтрокаТ.КаталогОбмена)) = АвтоКаталог Тогда
			Если ИменаПодкаталоговНаОсновеФИО Тогда // название каталога на основе ФИО
				СтрокаТ.КаталогОбмена = ПреобразоватьВНазваниеКаталога(СтрокаТ.Пользователь.Наименование, мНазванияКаталогов);
			Иначе // 
			    СтрокаТ.КаталогОбмена = ПреобразоватьВНазваниеКаталогаИзИдентификатораМУ(СтрокаТ.СсылкаМУ, тзМУ);
			КонецЕсли; 
			мНазванияКаталогов.Добавить(СтрокаТ.КаталогОбмена);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// ПрограммныйИнтерфейс_ОбменДанными
#КонецОбласти

// Возвращает настройки агента.
Функция ПолучитьНастройкиАгента(Агент)

	ТЗ = ВременныеТаблицы.НастройкиАгентов;
	СтрокаТ = ТЗ.Найти(Агент, "Пользователь");
	Если СтрокаТ = Неопределено Тогда
		Результат = Неопределено;
	Иначе
		Результат = Новый Структура;		
		Для Каждого Колонка Из ТЗ.Колонки Цикл
			Результат.Вставить(Колонка.Имя, СтрокаТ[Колонка.Имя]);
		КонецЦикла;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Функция возвращает настройки агента. В отличии от функции ПолучитьНастройкиАгента() читает данные сразу из временного хранилища.
Функция ПолучитьНастройкиАгентаИзВХ(Агент, стрРеквизиты = Неопределено) Экспорт

	Результат = Неопределено;
	
	ТЗ = ПрочитатьЗначениеНастройки("НастройкиАгентов");
	Если ТипЗнч(ТЗ) = Тип("ТаблицаЗначений") Тогда
		СтрокаТ = ТЗ.Найти(Агент, "Пользователь");
		Если СтрокаТ <> Неопределено Тогда
			Если стрРеквизиты = Неопределено Тогда
				Результат = Новый Структура;
				Для Каждого Колонка Из ТЗ.Колонки Цикл
					Результат.Вставить(Колонка.Имя, СтрокаТ[Колонка.Имя]);
				КонецЦикла;
			Иначе
				Результат = Новый Структура(стрРеквизиты);
				Для Каждого ЭлементСтруктуры Из Результат Цикл
					Результат[ЭлементСтруктуры.Ключ] = СтрокаТ[ЭлементСтруктуры.Ключ];
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

Функция НастройкиДляТекущегоАгента() Экспорт
	
	ЗагрузитьНастройкиДляРаботыОбмена();
	ВыбНастройкиАгента = ПолучитьНастройкиАгента(ВыбАгент);
	стррРезультат = Новый Структура("ВыбНастройкиАгента,Организации", ВыбНастройкиАгента, ОрганизацииВыгрузки());
	Возврат стррРезультат;
	
КонецФункции

Функция ЗапросыОбновления()

	Если Не ВременныеТаблицы.Свойство("ЗапросыМобильныхУстройств") Тогда // значит статусы партнеров не задавались
		Возврат Новый ТаблицаЗначений;
	Иначе
		Возврат ВременныеТаблицы.ЗапросыМобильныхУстройств;
	КонецЕсли;
	
КонецФункции // ЗапросыОбновления()

#Область ДополнительныеРеквизиты

Функция ИмяСвойстваДокументШирота()
	Возврат "АгентПлюсДокументШирота";
КонецФункции 

Функция ИмяСвойстваДокументДолгота() 
	Возврат "АгентПлюсДокументДолгота";
КонецФункции 

Функция ИмяСвойстваДокументВремяНачала()
	Возврат "АгентПлюсДокументВремяНачала";
КонецФункции 

Функция ИмяСвойстваДокументВремяОкончания()
	Возврат "АгентПлюсДокументВремяОкончания";
КонецФункции 

Функция ИмяСвойстваШиротаПартнер() Экспорт
	Возврат "АгентПлюсШиротаПартнер";
КонецФункции 

Функция ИмяСвойстваДолготаПартнер() Экспорт
	Возврат "АгентПлюсДолготаПартнер";
КонецФункции 

Функция ИмяСвойстваАдресИзСервисаПартнер() Экспорт
	Возврат "АгентПлюсАдресИзСервиса";
КонецФункции 

Функция ДополнительноеСвойствоПоНаименованию(ИмяСвойства) Экспорт

	//{{dm_180508
	ОпределитьВерсиюКонфигурации();
	Если гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11") Тогда //dm_180523 : ПоколениеКонфигурации
		Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(ИмяСвойства, Истина);
	Иначе
		Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ИмяСвойства, Истина);
	КонецЕсли;
	//}}dm_180508
	Возврат Свойство;
	 
КонецФункции 

Функция ТипСвойстваКоординатыGPS()
	Возврат Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(20));
КонецФункции 

Функция ПроверитьДополнительныеРеквизитыСправочникаПартнеры() Экспорт

	ствРеквизиты = Новый Соответствие;
	ствРеквизиты.Вставить(ИмяСвойстваШиротаПартнер(), 0);
	ствРеквизиты.Вставить(ИмяСвойстваДолготаПартнер(), 0);
	ствРеквизиты.Вставить(ИмяСвойстваАдресИзСервисаПартнер(), 0);
	
	//НаборСсылка = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Общие; в УТ общие наборы хранятся с пустым значением реквизита "НаборСвойств"

	//{{dm_180523
	ОпределитьВерсиюКонфигурации();
	Если гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11") Тогда
		Отбор = Новый Структура("НазначениеСвойства", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты); 
		Выборка = ПланыВидовХарактеристик.СвойстваОбъектов.Выбрать(, Отбор);
	Иначе                                                                    
		Выборка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Выбрать();
	КонецЕсли;
	//}}dm_180523
	
	              
	Пока Выборка.Следующий() Цикл
		//{{dm_180523
		Если (гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11")) ИЛИ Не ЗначениеЗаполнено(Выборка.НаборСвойств) Тогда
			Наименование = Выборка.Наименование;
			Значение = ствРеквизиты.Получить(Наименование);
			Если Значение <> Неопределено Тогда
				ствРеквизиты[Наименование] = Значение + 1;
			КонецЕсли;
		КонецЕсли;
		//}}dm_180523
	КонецЦикла; 
	
	СтрДубли  = "";	
	СтрПустые = "";

	Для каждого Элемент Из ствРеквизиты Цикл
		Если Элемент.Значение > 1 Или Элемент.Значение = 0 Тогда
			Если Элемент.Значение > 1 Тогда
				СтрДубли  = СтрДубли  + ?(СтрДубли  = "", "", ", ") + Элемент.Ключ + " (" + Строка(Элемент.Значение) + ")";
			Иначе
				СтрПустые = СтрПустые + ?(СтрПустые = "", "", ", ") + Элемент.Ключ;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	мСообщения = Новый Массив;
	
	//{{dm_180523
	Если НЕ (гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11")) Тогда
		Если Константы.ИспользоватьДополнительныеРеквизитыИСведения.Получить() = Ложь Тогда
			Текст = "Выключен режим ""Использовать дополнительные реквизиты и сведения"" - координаты партнеров не сохранятся. Перейдите в ""Общие настройки"" 1С:Предприятия и выберите флажок ""Использовать дополнительные реквизиты и сведения"".";
			мСообщения.Добавить(Текст);
		КонецЕсли;
		ОбъектПВХ = "ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения";
	Иначе
		ОбъектПВХ = "ПланВидовХарактеристик.СвойстваОбъектов";
	КонецЕсли;
	//}}dm_180523
	
	
	
	Если СтрДубли <> "" Тогда
		//{{dm_180523
		Текст = "В объекте """ + ОбъектПВХ + """ указаны дубли названий реквизитов:";
		//}}dm_180523
		Текст = Текст + ?(СтрДлина(СтрДубли) > 30, Символы.ПС, " ") + СтрДубли + "." + Символы.ПС + "Удалите лишние реквизиты!";
		мСообщения.Добавить(Текст);
	КонецЕсли;
	
	Если СтрПустые <> "" Тогда
		//{{dm_180523
		Текст = "В объекте """ + ОбъектПВХ + """ не указаны реквизиты:";
		//}}dm_180523
		Текст = Текст + ?(СтрДлина(СтрПустые) > 30, Символы.ПС, " ") + СтрПустые + "." + Символы.ПС + "Создайте недостающие реквизиты!";
		мСообщения.Добавить(Текст);
	КонецЕсли;
	
	Возврат Новый Структура("ЕстьОшибки,Сообщения", мСообщения.Количество() <> 0, мСообщения);

КонецФункции

Процедура СоздатьДополнительныеРеквизитыДокументов() Экспорт

	ОпределитьВерсиюКонфигурации();
	
	//{{dm_180523
	Назначение = ?((гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11")), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы, Неопределено);
	//}}dm_180523
	
	ИмяСвойства = ИмяСвойстваДокументШирота();
	Свойство = ДополнительноеСвойствоПоНаименованию(ИмяСвойства);
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		//{{dm_180523
		Если гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11") Тогда
			СоздатьДополнительноеСведениеДляДокументов_KZ(ИмяСвойства, Назначение, ТипСвойстваКоординатыGPS());
		Иначе
			СоздатьДополнительноеСведениеДляДокументов(ИмяСвойства, "МУ: Широта", 
				ТипСвойстваКоординатыGPS(), НСтр("ru = 'Географическая широта места создания документа'"));
		КонецЕсли;
		//}}dm_180523
	КонецЕсли;
	
	ИмяСвойства = ИмяСвойстваДокументДолгота();
	Свойство = ДополнительноеСвойствоПоНаименованию(ИмяСвойства);
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		//{{dm_180523
		Если гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11") Тогда
			СоздатьДополнительноеСведениеДляДокументов_KZ(ИмяСвойства, Назначение, ТипСвойстваКоординатыGPS());
		Иначе
			СоздатьДополнительноеСведениеДляДокументов(ИмяСвойства, "МУ: Долгота", 
				ТипСвойстваКоординатыGPS(), НСтр("ru = 'Географическая долгота места создания документа'"));
		КонецЕсли;
		//}}dm_180523
	КонецЕсли;
	
	ИмяСвойства = ИмяСвойстваДокументВремяНачала();
	Свойство = ДополнительноеСвойствоПоНаименованию(ИмяСвойства);
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		ТипСвойства = Новый ОписаниеТипов("Дата", , , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
		//{{dm_180523
		Если гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11") Тогда
			СоздатьДополнительноеСведениеДляДокументов_KZ(ИмяСвойства, Назначение, ТипСвойства);
		Иначе
			СоздатьДополнительноеСведениеДляДокументов(ИмяСвойства, "МУ: Время начала", 
				ТипСвойства, НСтр("ru = 'Время начала работы с документом в МУ'"));
		КонецЕсли;
		//}}dm_180523
	КонецЕсли;
	
	ИмяСвойства = ИмяСвойстваДокументВремяОкончания();
	Свойство = ДополнительноеСвойствоПоНаименованию(ИмяСвойства);
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		ТипСвойства = Новый ОписаниеТипов("Дата", , , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
		//{{dm_180523
		Если гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11") Тогда
			СоздатьДополнительноеСведениеДляДокументов_KZ(ИмяСвойства, Назначение, ТипСвойства);
		Иначе
			СоздатьДополнительноеСведениеДляДокументов(ИмяСвойства, "МУ: Время окончания", 
				ТипСвойства, НСтр("ru = 'Время окончания работы с документом в МУ'"));
		КонецЕсли;
		//}}dm_180523
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьДополнительныеРеквизитыСправочников() Экспорт

	ОпределитьВерсиюКонфигурации();
	
	//{{dm_180523
	Назначение = ?((гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11")), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты, Неопределено);
	//}}dm_180523
	
	ИмяСвойства = ИмяСвойстваШиротаПартнер();
	Свойство = ДополнительноеСвойствоПоНаименованию(ИмяСвойства);
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		Подсказка = НСтр("ru = 'Географическая широта местоположения (в формате NMEA)'");
		//{{dm_180510
		СоздатьДополнительныйРеквизитПартнера(ИмяСвойства, "Широта", ТипСвойстваКоординатыGPS(), Подсказка, Назначение);
		//}}dm_180510
	КонецЕсли;
	
	ИмяСвойства = ИмяСвойстваДолготаПартнер();
	Свойство = ДополнительноеСвойствоПоНаименованию(ИмяСвойства);
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		Подсказка = НСтр("ru = 'Географическая долгота местоположения (в формате NMEA)'");
		//{{dm_180510
		СоздатьДополнительныйРеквизитПартнера(ИмяСвойства, "Долгота", ТипСвойстваКоординатыGPS(), Подсказка, Назначение);
		//}}dm_180510
	КонецЕсли;
	
	ИмяСвойства = ИмяСвойстваАдресИзСервисаПартнер();
	Свойство = ДополнительноеСвойствоПоНаименованию(ИмяСвойства);
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		ТипСвойства = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(128));
		Подсказка = НСтр("ru = 'Адрес, полученный из веб-сервиса определения координат'");
		//{{dm_180510
		СоздатьДополнительныйРеквизитПартнера(ИмяСвойства, "Адрес из веб-сервиса", ТипСвойства, Подсказка, Назначение);
		//}}dm_180510
	КонецЕсли;

КонецПроцедуры

//DM:ВРЕМЕННЫЕ ИЗМЕНЕНИЯ
Процедура СоздатьДСДляРеализации(Свойство)
	
	
	НовыйЭлемент = Свойство.Ссылка;
	мНаборы = Новый Массив;
	мНаборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РеализацияТоваровУслуг);
	Для Каждого НаборСсылка Из мНаборы Цикл
		ДобавитьНовыйДополнительныйРеквизитИлиСведениеВНабор(НаборСсылка, НовыйЭлемент);
	КонецЦикла;

КонецПроцедуры //DM:ВРЕМЕННЫЕ ИЗМЕНЕНИЯ
	
Процедура СоздатьДополнительноеСведениеДляДокументов(ИмяСвойства, ПредставлениеСвойства, ОписаниеТипа, Подсказка)

	НовыйЭлемент = НовыйДополнительныйРеквизитИлиСведение(ИмяСвойства, ПредставлениеСвойства, ОписаниеТипа, Истина, Подсказка);
	
	мНаборы = Новый Массив;
	
	//++Дейнеко ВГ 2017-09-29 Ратмир
	мНаборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СчетНаОплатуПокупателю);
	//Замена
	//мНаборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ЗаказКлиента);
	//++Дейнеко ВГ 2017-09-29 Ратмир
	
	мНаборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходныйКассовыйОрдер);
	мНаборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходныйКассовыйОрдер);
	//{{dm_171010
	мНаборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РеализацияТоваровУслуг);
	//}}dm_171010
	
	Для Каждого НаборСсылка Из мНаборы Цикл
		ДобавитьНовыйДополнительныйРеквизитИлиСведениеВНабор(НаборСсылка, НовыйЭлемент);
	КонецЦикла;

КонецПроцедуры

//{{dm_180510
Процедура СоздатьДополнительноеСведениеДляДокументов_KZ(ИмяСвойства, Назначение, ОписаниеТипа)
	
	НовыйЭлемент = НовыйДополнительныйРеквизитИлиСведение_KZ(ИмяСвойства, Назначение, ОписаниеТипа);
	
	ДобавитьНовыйДополнительныйРеквизитИлиСведениеВНабор_KZ(НовыйЭлемент);

КонецПроцедуры
//}}dm_180510

Процедура СоздатьДополнительныйРеквизитПартнера(ИмяСвойства, ПредставлениеСвойства, ОписаниеТипа, Подсказка, Назначение) //dm_180510 : Добавил Назначение

	//{{dm_180523
	Если гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11") Тогда
		НовыйЭлемент = НовыйДополнительныйРеквизитИлиСведение_KZ(ИмяСвойства, Назначение, ОписаниеТипа);
		
		//НаборСсылка = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Контрагенты;
	
		ДобавитьНовыйДополнительныйРеквизитИлиСведениеВНабор_KZ(НовыйЭлемент);
		
	Иначе
		НовыйЭлемент = НовыйДополнительныйРеквизитИлиСведение(ИмяСвойства, ПредставлениеСвойства, ОписаниеТипа, Ложь, Подсказка);
		//++Дейнеко ВГ 2017-09-29 Ратмир
		НаборСсылка = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Контрагенты;
		//Замена
		//НаборСсылка = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Общие;
		//--Дейнеко ВГ 2017-09-29 Ратмир
		
		ДобавитьНовыйДополнительныйРеквизитИлиСведениеВНабор(НаборСсылка, НовыйЭлемент);
	
	КонецЕсли;
	//}}dm_180523
	
КонецПроцедуры

Процедура ДобавитьНовыйДополнительныйРеквизитИлиСведениеВНабор(НаборСсылка, Элемент)

	НаборОбъект = НаборСсылка.ПолучитьОбъект();
	
	Если Элемент.ЭтоДополнительноеСведение Тогда
		
		НовоеСвойство = НаборОбъект.ДополнительныеСведения.Добавить();
		НовоеСвойство.Свойство = Элемент;
		СтароеКоличество = СтрЗаменить(НаборОбъект.КоличествоСведений, Символы.НПП, "");
		Если СтароеКоличество = "" Тогда
			СтароеКоличество = "0";
		КонецЕсли;
		НаборОбъект.КоличествоСведений = Число(СтароеКоличество) + 1;
		
	Иначе	
		
		НовыйРеквизит = НаборОбъект.ДополнительныеРеквизиты.Добавить();
		НовыйРеквизит.Свойство = Элемент;
		СтароеКоличество = СтрЗаменить(НаборОбъект.КоличествоРеквизитов, Символы.НПП, "");
		Если СтароеКоличество = "" Тогда
			СтароеКоличество = "0";
		КонецЕсли;
		НаборОбъект.КоличествоРеквизитов = Число(СтароеКоличество) + 1;
		
	КонецЕсли; 
	
	Если ПоколениеКонфигурации(">=УТ_11.2") Тогда
		НаборОбъект.Используется = Истина;	
	КонецЕсли; 
	
	НаборОбъект.Записать();

КонецПроцедуры

//{{dm_180510
Процедура ДобавитьНовыйДополнительныйРеквизитИлиСведениеВНабор_KZ(Элемент)

	НовоеСвойство = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
	
	НовоеСвойство.Владелец = Элемент;
	НовоеСвойство.Наименование = Элемент.Наименование;
	
	НовоеСвойство.Записать();
	
КонецПроцедуры
//}}dm_180510

Функция ДанныеОДополнительныхСвойствахДокументаДляМУ()

	Если гДанныеОДополнительныхСвойствахДокументаДляМУ = Неопределено Тогда
	
		стррДанные = Новый Структура("тзРеквизиты,стзШирота,стзДолгота,стзВремяНачала,стзВремяОкончания");
		
		тзРеквизиты = Новый ТаблицаЗначений;
		//{{dm_180523
		Если гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11") Тогда
			ТипСвойства = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СвойстваОбъектов");
		Иначе
			ТипСвойства = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения");
		КонецЕсли;
		//тзРеквизиты.Колонки.Добавить("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
		тзРеквизиты.Колонки.Добавить("Свойство", ТипСвойства);
		//}}dm_180523
		тзРеквизиты.Колонки.Добавить("Значение");
		
		стррДанные.тзРеквизиты = тзРеквизиты;
		
		СтрокаТ = тзРеквизиты.Добавить();	
		СтрокаТ.Свойство  = ДополнительноеСвойствоПоНаименованию(ИмяСвойстваДокументШирота());
		стррДанные.стзШирота = СтрокаТ;
		
		СтрокаТ = тзРеквизиты.Добавить();
		СтрокаТ.Свойство = ДополнительноеСвойствоПоНаименованию(ИмяСвойстваДокументДолгота());
		стррДанные.стзДолгота = СтрокаТ;
		
		СтрокаТ = тзРеквизиты.Добавить();
		СтрокаТ.Свойство = ДополнительноеСвойствоПоНаименованию(ИмяСвойстваДокументВремяНачала());
		стррДанные.стзВремяНачала = СтрокаТ;
		
		СтрокаТ = тзРеквизиты.Добавить();
		СтрокаТ.Свойство = ДополнительноеСвойствоПоНаименованию(ИмяСвойстваДокументВремяОкончания());
		стррДанные.стзВремяОкончания = СтрокаТ;
		
		гДанныеОДополнительныхСвойствахДокументаДляМУ = стррДанные;
		
	КонецЕсли; 
	
	Возврат гДанныеОДополнительныхСвойствахДокументаДляМУ;

КонецФункции  

// Запись дополнительных свойств документа.
Процедура ЗаписатьДополнительныеСвойстваДокумента(ДокументСсылка, стррДокумент)

	стррДанные = ДанныеОДополнительныхСвойствахДокументаДляМУ();
	
	стррДокумент.Свойство("Широта", 		стррДанные.стзШирота.Значение);
	стррДокумент.Свойство("Долгота", 		стррДанные.стзДолгота.Значение);
	стррДокумент.Свойство("ДатаНачала", 	стррДанные.стзВремяНачала.Значение);
	стррДокумент.Свойство("ДатаОкончания", 	стррДанные.стзВремяОкончания.Значение);
	//{{dm_180523
	Если гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11") Тогда
		ЗаписатьСвойстваУОбъекта(ДокументСсылка, стррДанные.тзРеквизиты);
	Иначе
		ОбщийМодуль = Вычислить("УправлениеСвойствами");
		ОбщийМодуль.ЗаписатьСвойстваУОбъекта(ДокументСсылка, стррДанные.тзРеквизиты);
	КонецЕсли;
	//}}dm_180523
КонецПроцедуры

// ДополнительныеРеквизиты
#КонецОбласти

Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт

	Попытка
		Возврат ПолучитьМакет(ИмяМакета);
	Исключение
		Возврат Неопределено;
	КонецПопытки; 
	
КонецФункции

#Область ВнешняяОбработка

Функция СведенияОВнешнейОбработке() Экспорт

	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", "Обмен даннми с приложением 'Агент плюс'");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Версия", ВерсияОбработки());
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	РегистрационныеДанные.Вставить("Информация", "Обработка обмена данными с приложением 'Агент плюс: Мобильная торговля'");

	тзКоманд = Новый ТаблицаЗначений;
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");

	стзКоманд = тзКоманд.Добавить();
	стзКоманд.Идентификатор = "ОткрытьОтчет";
	стзКоманд.Представление = "Открыть";
	стзКоманд.Использование = "ОткрытиеФормы";
	стзКоманд.ПоказыватьОповещение = Истина;	
	
	//стзКоманд = тзКоманд.Добавить();
	//стзКоманд.Идентификатор = "Загрузить";
	//стзКоманд.Представление = "Загрузить данные";
	//стзКоманд.Использование = "ВызовСерверногоМетода";
	//стзКоманд.ПоказыватьОповещение = Истина;	

	//стзКоманд = тзКоманд.Добавить();
	//стзКоманд.Идентификатор = "Выгрузить";
	//стзКоманд.Представление = "Выгрузить данные";
	//стзКоманд.Использование = "ВызовСерверногоМетода";
	//стзКоманд.ПоказыватьОповещение = Истина;	

	РегистрационныеДанные.Вставить("Команды", тзКоманд);

	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска логики обработки.
Процедура ВыполнитьКоманду(ИмяКоманды, ПараметрыВыполнения = Неопределено) Экспорт

	// Общие действия перед началом выполнения команд.
	УстановитьПривилегированныйРежим(Истина);

	//Диспетчеризация обработчиков команд.
	Если ИмяКоманды = "Загрузить" Тогда
		ЗагрузитьДанные(Неопределено);
	ИначеЕсли ИмяКоманды = "Выгрузить" Тогда
		ВыгрузитьДанные(Неопределено);
	КонецЕсли;

КонецПроцедуры

// Возвращает номер версии обработки. Номер версии обработки указывается в синониме обработки в круглых скобках.
Функция ВерсияОбработки() Экспорт
	
	Комментарий = Метаданные().Комментарий;
	ПозНачала = Найти(Комментарий, "(");
	ПозКонца  = Найти(Комментарий, ")");
	
	Если ПозНачала = 0 Или ПозКонца = 0 Тогда
		ВызватьИсключение("В Комментарии обработки в метаданных не указана версия обработки! Версия должна указываться в круглых скобках!");
	КонецЕсли;
	
	Результат = ИзвлечьВерсию(Сред(Комментарий, ПозНачала+1, ПозКонца - ПозНачала - 1));
	
	Возврат Результат;
	
КонецФункции

Функция ИзвлечьВерсию(стрВерсия)
	
	Результат = "";
	МаксИндекс = стрДлина(стрВерсия);
	
	Для Индекс = 1 По МаксИндекс Цикл
		Символ = Сред(стрВерсия, Индекс, 1);
		Код = КодСимвола(Символ);
		Если Код > 45 И Код < 58 И Код <> 47  Тогда
			Результат = Результат + Символ;
		КонецЕсли; 
	КонецЦикла;
	
	Пока Лев(стрВерсия, 1) = "."  Цикл
		Результат = Сред(стрВерсия, 2);
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

// ВнешняяОбработка
#КонецОбласти

#Область ПрограммныйИнтерфейс_ПланПосещений

Функция ПланПосещенийНомерПунктаВнеПлана() Экспорт
	Возврат 99999;
КонецФункции


//dm_171010:Внесены изменения
// Функция возвращает таблицу плана посещений, сгенерированную из "Cписка торговых точек", переданного в параметре.
// 
// Параметры:
// 
//	стррПараметры - Структура - структура со свойствами:
//  	Период - СтандартныйПериод - период отчета
//  	СсылкаСписокТТ  - Строка или УникальныйИдентификатор - идентификатор списка торговых точек
//  
// Возвращаемое значение:
//  ТаблицаЗначений, в структуре стррПараметры возвращается свойство "ВсегоДней" - сколько дней в таблице плана посещений.
//  
Функция ПолучитьПланПосещенийДляОтчета(стррПараметры) Экспорт

	стррОбъект = ПолучитьОбъектИзХранилища("СпрСТТ", стррПараметры.СсылкаСписокТТ);
	
	ИспользуетсяГрафик = Неопределено;
	ИспользуетсяПП 	   = Неопределено;
	
	Если Не стррПараметры.Свойство("ИгнорироватьОтсутствиеПлана") Или стррПараметры.ИгнорироватьОтсутствиеПлана = Ложь Тогда
		Если стррОбъект = Неопределено Тогда
		    ВызватьИсключение("Не найден список торговых точек с идентификатором: " + стррПараметры.СсылкаСписокТТ);
		КонецЕсли; 
	КонецЕсли; 
	
	Период = стррПараметры.Период;	
	ВсегоДней = (НачалоДня(Период.ДатаОкончания) - НачалоДня(Период.ДатаНачала)) / 86400 + 1;			
	
	Если стррОбъект <> Неопределено Тогда 
		
		СписокБезПланаИГрафика = Не СписокТорговыхТочекИспользуетсяДляПланированияПосещений(стррОбъект, ИспользуетсяГрафик, ИспользуетсяПП);
		
		ПериодПлана = стррОбъект.ПериодГрафикаПлана;
		
		ПромДатаНачала = ?(ПериодПлана = 7, НачалоНедели(Период.ДатаНачала), стррОбъект.ДатаНачала); // дата начала плана посещений
		РазницаДней = (Период.ДатаНачала - ПромДатаНачала) / 86400;
		
	КонецЕсли;
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(5, 0);
	ТипЧисло  = Новый ОписаниеТипов("Число", КвалификаторЧисла);
	ТипСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки());
	
	ТЗРезультат = Новый ТаблицаЗначений;
	//dm_171010:Замена
	//ТЗРезультат.Колонки.Добавить("Партнер", 	Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ТЗРезультат.Колонки.Добавить("Партнер", 	Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗРезультат.Колонки.Добавить("Адрес", 		ТипСтрока);
	ТЗРезультат.Колонки.Добавить("НомерВПлане",	ТипЧисло); // номер строки в ТЗ "Состав" списка ТТ
	
	стррПараметры.Вставить("ВсегоДней", ВсегоДней);
	
	Для День = 1 По ВсегоДней Цикл
		ТЗРезультат.Колонки.Добавить("Д" + День, ТипСтрока);  // факт посещения
		ТЗРезультат.Колонки.Добавить("П" + День, ТипЧисло); // план посещения (порядковые номера посещения, если заданы)
	КонецЦикла;
	
	Если стррОбъект = Неопределено Тогда
		
		Возврат ТЗРезультат;
		
	КонецЕсли; 
	
	НомерВнеПлана = ПланПосещенийНомерПунктаВнеПлана();
	
	тзСостав = стррОбъект.Состав;	
	
	Если ИспользуетсяПП Тогда // Детализация списка ТТ по плану посещения
		
		СмещениеОтНачалаПлана = РазницаДней % ПериодПлана; // количество дней от начала плана для вывода первого дня в отчете		
		
		тзПланПосещений = стррОбъект.ПланПосещений;
		тзПланПосещений.Сортировать("Партнер,День");

		ТекПартнер = Неопределено;
		
		Для каждого СтрокаТ Из тзПланПосещений Цикл
			Если СтрокаТ.День > ПериодПлана Тогда // Такое возможно, если в списке ранее был создан план с бОльшим периодом, а потом был период изменен 
				Продолжить; 					  // на меньший - пункты от бОльшего периода в списке на всякий случай сохраняются.
			КонецЕсли; 
			Если СтрокаТ.Партнер <> ТекПартнер Тогда
				ТекПартнер = СтрокаТ.Партнер;				
				стзРезультат = ТЗРезультат.Добавить();
				стзРезультат.Партнер = ТекПартнер;
				стзСостав = тзСостав.Найти(ТекПартнер, "Партнер");
				стзРезультат.НомерВПлане = ?(стзСостав = Неопределено, НомерВнеПлана, тзСостав.Индекс(стзСостав));
			КонецЕсли;
			НомерДня = СтрокаТ.День - СмещениеОтНачалаПлана;
			НормироватьПоМодулю(НомерДня, ПериодПлана);
			Пока НомерДня <= ВсегоДней Цикл // цикл занесения дней в план с учетом, что период отчета может быть больше циклического периода плана
				стзРезультат["П" + НомерДня] = СтрокаТ.Порядок;
				НомерДня = НомерДня + ПериодПлана;
			КонецЦикла; 
		КонецЦикла;
		
		ТЗРезультат.Сортировать("НомерВПлане,Партнер");		
		
	ИначеЕсли ИспользуетсяГрафик Тогда // Детализация списка ТТ по графику посещения
		  // Графики указаны в таблице тзСостав
		Пункт = Неопределено;
		Для каждого стзСостав Из тзСостав Цикл
			стррГрафик = стзСостав.График;
			Если стррГрафик = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			стррПункты = стррГрафик.Пункты;
			Если стррПункты = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			ПериодГрафика = стррГрафик.ПериодГрафика;
			СмещениеОтНачалаГрафика = РазницаДней % ПериодГрафика; // количество дней от начала графика для вывода первого дня в отчете					
			стзРезультат = ТЗРезультат.Добавить();
			стзРезультат.Партнер = стзСостав.Партнер;
			стзРезультат.НомерВПлане = тзСостав.Индекс(стзСостав);
			Для НомерДня = 1 По ВсегоДней Цикл
				ДеньГрафика = НомерДня + СмещениеОтНачалаГрафика;
				НормироватьПоМодулю(ДеньГрафика, ПериодГрафика);
				Если стррПункты.Свойство("П"+Строка(ДеньГрафика-1), Пункт) И Пункт.Выбран Тогда // пункты в графике нумеруются с 0
					стзРезультат["П" + НомерДня] = 1000; // признак включения дня в план посещений
				КонецЕсли; 
			КонецЦикла;
		КонецЦикла
		
	Иначе // список ТТ без плана и графика, просто переносим партнеров
		
		Для каждого стзСостав Из тзСостав Цикл
			стзРезультат = ТЗРезультат.Добавить();
			стзРезультат.Партнер = стзСостав.Партнер;
		КонецЦикла
		
	КонецЕсли;
	
	Возврат ТЗРезультат;
	
КонецФункции

//dm_171010,dm_180523:Внесены изменения
//
// Функция возвращает факты посещений (т.е. документы, созданные при посещении ТТ) в виде таблицы значений.
// 
// Параметры:
// 
//	стррПараметры - Структура - структура со свойствами:
//  	Агент - СправочникСсылка.Пользователи - агент, документы которого считать фактами посещений.
//  	Период - СтандартныйПериод - период отчета
//		День - ДатаВремя - дата формирования отчета (указывается, если нет свойства "Период").
//		ТолькоПроведенныеДокументы - Булево - признак включать / не включать проведенные документы в таблицу.
//		списокВидыДокументов - СписокЗначений - список видов документов для получения фактов.
//  
// Возвращаемое значение:
//  ТаблицаЗначений.
//  
Функция ПолучитьФактПосещенийДляОтчета(стррПараметры) Экспорт

	//{{dm_180523
	ОпределитьВерсиюКонфигурации();
	стррЛитералы = Новый Структура("Регистр");
	Если гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11") Тогда
		стррЛитералы.Регистр = "ЗначенияСвойствОбъектов";
	Иначе
		стррЛитералы.Регистр = "ДополнительныеСведения";
	КонецЕсли;
	
		Текст = "
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Объект
		|ПОМЕСТИТЬ ДокументыСоСведениями
		|ИЗ
		|	РегистрСведений.[Регистр] КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &СвойствоВремяНачала
		|	И ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК ДАТА) МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Агент КАК Агент,
		|	ВложенныйЗапрос.Партнер КАК Партнер,
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	ВложенныйЗапрос.Дата КАК Дата
		|ПОМЕСТИТЬ Документы
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПриходныйКассовыйОрдер.Ответственный КАК Агент,
		|		ПриходныйКассовыйОрдер.Контрагент КАК Партнер,
		|		ПриходныйКассовыйОрдер.Ссылка КАК Ссылка,
		|		ПриходныйКассовыйОрдер.Дата КАК Дата
		|	ИЗ
		|		Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер,
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыСоСведениями КАК ДокументыСоСведениями
		|		ПО ПриходныйКассовыйОрдер.Ссылка = ДокументыСоСведениями.Объект
		|	ГДЕ
		|		&ПриходныйКассовыйОрдер И ПриходныйКассовыйОрдер.Ответственный = &Агент
		|		И ВЫБОР
		|				КОГДА &ТолькоПроведенныеДокументы
		|					ТОГДА ПриходныйКассовыйОрдер.Проведен
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И НЕ ПриходныйКассовыйОрдер.ПометкаУдаления
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасходныйКассовыйОрдер.Ответственный,
		|		РасходныйКассовыйОрдер.Контрагент,
		|		РасходныйКассовыйОрдер.Ссылка,
		|		РасходныйКассовыйОрдер.Дата
		|	ИЗ
		|		Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер,
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыСоСведениями КАК ДокументыСоСведениями
		|		ПО РасходныйКассовыйОрдер.Ссылка = ДокументыСоСведениями.Объект
		|	ГДЕ
		|		&РасходныйКассовыйОрдер И РасходныйКассовыйОрдер.Ответственный = &Агент 
		|		И ВЫБОР
		|				КОГДА &ТолькоПроведенныеДокументы
		|					ТОГДА РасходныйКассовыйОрдер.Проведен
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И НЕ РасходныйКассовыйОрдер.ПометкаУдаления
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РеализацияТоваровУслуг.Ответственный,
		|		РеализацияТоваровУслуг.Контрагент,
		|		РеализацияТоваровУслуг.Ссылка,
		|		РеализацияТоваровУслуг.Дата
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг,
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыСоСведениями КАК ДокументыСоСведениями
		|		ПО РеализацияТоваровУслуг.Ссылка = ДокументыСоСведениями.Объект
		|	ГДЕ
		|		&РеализацияТоваровУслуг И РеализацияТоваровУслуг.Ответственный = &Агент
		|		И ВЫБОР
		|				КОГДА &ТолькоПроведенныеДокументы
		|					ТОГДА РеализацияТоваровУслуг.Проведен
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВозвратТоваровОтКлиента.Ответственный,
		|		ВозвратТоваровОтКлиента.Контрагент,
		|		ВозвратТоваровОтКлиента.Ссылка,
		|		ВозвратТоваровОтКлиента.Дата
		|	ИЗ
		|		Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтКлиента,
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыСоСведениями КАК ДокументыСоСведениями
		|		ПО ВозвратТоваровОтКлиента.Ссылка = ДокументыСоСведениями.Объект
		|	ГДЕ
		|		&ВозвратТоваровОтПокупателя И ВозвратТоваровОтКлиента.Ответственный = &Агент 
		|		И ВЫБОР
		|				КОГДА &ТолькоПроведенныеДокументы
		|					ТОГДА ВозвратТоваровОтКлиента.Проведен
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И НЕ ВозвратТоваровОтКлиента.ПометкаУдаления
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗаказКлиента.Ответственный КАК Агент,
		|		ЗаказКлиента.Контрагент,
		|		ЗаказКлиента.Ссылка,
		|		ЗаказКлиента.Дата
		|	ИЗ
		|		Документ.СчетНаОплатуПокупателю КАК ЗаказКлиента,
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыСоСведениями КАК ДокументыСоСведениями
		|		ПО ЗаказКлиента.Ссылка = ДокументыСоСведениями.Объект
		|	ГДЕ
		|		&СчетНаОплатуПокупателю И ЗаказКлиента.Ответственный = &Агент 
		|		И ВЫБОР
		|				КОГДА &ТолькоПроведенныеДокументы
		|					ТОГДА ЗаказКлиента.Проведен
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И НЕ ЗаказКлиента.ПометкаУдаления
		|	) КАК ВложенныйЗапрос
		|; 
		|	
		|///////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Документы.Агент,
		|	Документы.Партнер,
		|	Документы.Дата,
		|	Документы.Ссылка КАК Ссылка,
		|	СведенияШирота.Значение КАК Широта,
		|	СведенияДолгота.Значение КАК Долгота,
		|	СведенияВремяНачала.Значение КАК ВремяНачала,
		|	СведенияВремяОкончания.Значение КАК ВремяОкончания
		|ИЗ
		|	Документы КАК Документы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.[Регистр] КАК СведенияШирота
		|		ПО Документы.Ссылка = СведенияШирота.Объект	И СведенияШирота.Свойство = &СвойствоШирота
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.[Регистр] КАК СведенияДолгота
		|		ПО Документы.Ссылка = СведенияДолгота.Объект И СведенияДолгота.Свойство = &СвойствоДолгота
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.[Регистр] КАК СведенияВремяНачала
		|		ПО Документы.Ссылка = СведенияВремяНачала.Объект И СведенияВремяНачала.Свойство = &СвойствоВремяНачала
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.[Регистр] КАК СведенияВремяОкончания
		|		ПО Документы.Ссылка = СведенияВремяОкончания.Объект И СведенияВремяОкончания.Свойство = &СвойствоВремяОкончания
		|УПОРЯДОЧИТЬ ПО
		|	Документы.Партнер
		|";
		
	ЗаменитьЛитералы(Текст, стррЛитералы);
	//}}dm_180523
	
	Если стррПараметры.Свойство("ДобавитьВремяПосещения") И стррПараметры.ДобавитьВремяПосещения = Истина Тогда
		Текст = Текст + ", СведенияВремяНачала.Значение";
	КонецЕсли;
	
	
		   
	Запрос = Новый Запрос(Текст);			   
	Запрос.УстановитьПараметр("Агент", 					 	стррПараметры.Агент);
	Запрос.УстановитьПараметр("ТолькоПроведенныеДокументы", стррПараметры.ТолькоПроведенныеДокументы);
	Если стррПараметры.Свойство("Период") Тогда
		Запрос.УстановитьПараметр("НачалоПериода", 	стррПараметры.Период.ДатаНачала);
		Запрос.УстановитьПараметр("КонецПериода",  	стррПараметры.Период.ДатаОкончания);
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода", 	НачалоДня(стррПараметры.Дата));
		Запрос.УстановитьПараметр("КонецПериода",  	КонецДня(стррПараметры.Дата));
	КонецЕсли; 
	
	СвойствоШирота  		= ДополнительноеСвойствоПоНаименованию(ИмяСвойстваДокументШирота());	
	СвойствоДолгота 		= ДополнительноеСвойствоПоНаименованию(ИмяСвойстваДокументДолгота());
	СвойствоВремяНачала    	= ДополнительноеСвойствоПоНаименованию(ИмяСвойстваДокументВремяНачала());
	СвойствоВремяОкончания	= ДополнительноеСвойствоПоНаименованию(ИмяСвойстваДокументВремяОкончания());
	
	Запрос.УстановитьПараметр("СвойствоШирота",  		СвойствоШирота);
	Запрос.УстановитьПараметр("СвойствоДолгота",  		СвойствоДолгота);
	Запрос.УстановитьПараметр("СвойствоВремяНачала", 	СвойствоВремяНачала);
	Запрос.УстановитьПараметр("СвойствоВремяОкончания", СвойствоВремяОкончания);
	
	//{{dm_180516
	стрДокументы = "ПриходныйКассовыйОрдер,РасходныйКассовыйОрдер,РеализацияТоваровУслуг,ВозвратТоваровОтПокупателя,СчетНаОплатуПокупателю";
	мВидыДокументов = СтрРазделить_(стрДокументы);
	//}}dm_180516
	
	списокВидыДокументов = стррПараметры.СписокВидыДокументов;
	Для Каждого ВидДокумента Из мВидыДокументов Цикл
		Запрос.УстановитьПараметр(ВидДокумента, списокВидыДокументов.НайтиПоЗначению(ВидДокумента) <> Неопределено);
	КонецЦикла;

	тзФакт = Запрос.Выполнить().Выгрузить();
	
	Возврат тзФакт;
		   
КонецФункции

// Функция возвращает таблицу значений плана-факта посещений.
//	
//	Параметры:
//	
//	стррПараметры - Структура - структура со свойствами:
//  	Агент, Период, СсылкаСписокТТ, ТолькоПроведенныеДокументы, списокВидыДокументов, ПронумероватьФактыПосещений - описание см. в комментариях 
//		к функциям ПолучитьПланПосещенийДляОтчета() и ПолучитьФактПосещенийДляОтчета().
//		
Функция ПолучитьПланФактПосещений(стррПараметры) Экспорт
	
	тзПланПосешений = ПолучитьПланПосещенийДляОтчета(стррПараметры); // используются свойства: Период, СсылкаСписокТТ, создается свойство ВсегоДней 
	тзФактПосещений = ПолучитьФактПосещенийДляОтчета(стррПараметры); // используются свойства: Период, Агент, ТолькоПроведенныеДокументы, списокВидыДокументов
	
	НомерВнеПлана = ПланПосещенийНомерПунктаВнеПлана();
	
	ДатаНачала = стррПараметры.Период.ДатаНачала;
	
	ТекПартнер = Неопределено;
	
	Для каждого стзФакт Из тзФактПосещений Цикл
		ТекПартнер = стзФакт.Партнер;
		стзПлан = тзПланПосешений.Найти(ТекПартнер, "Партнер");
		Если стзПлан = Неопределено Тогда
			стзПлан = тзПланПосешений.Добавить();
			стзПлан.Партнер 	= ТекПартнер;
			стзПлан.НомерВПлане = НомерВнеПлана;
		КонецЕсли;
		ВремяНачала = ?(ЗначениеЗаполнено(стзФакт.ВремяНачала),	стзФакт.ВремяНачала, стзФакт.Дата);
		НомерДня = (НачалоДня(ВремяНачала) - ДатаНачала) / 86400 + 1;
		стрВремяНачала    = Формат(ВремяНачала, "ДФ=""HH:mm""");
		стрВремяОкончания = Формат(?(ЗначениеЗаполнено(стзФакт.ВремяОкончания), стзФакт.ВремяОкончания, ВремяНачала), "ДФ=""HH:mm""");
		стрТекИнтервал = стзПлан["Д" + НомерДня];
		Если ЗначениеЗаполнено(стрТекИнтервал) Тогда
			стрТекВремяНачала    = Лев(стрТекИнтервал, 5);
			стрТекВремяОкончания = Прав(стрТекИнтервал, 5);
			стзПлан["Д" + НомерДня] = 
				?(стрВремяНачала < стрТекВремяНачала, стрВремяНачала, стрТекВремяНачала) 
				+ " - " 
				+ ?(стрВремяОкончания > стрТекВремяОкончания, стрВремяОкончания, стрТекВремяОкончания);
		Иначе
			стзПлан["Д" + НомерДня] = стрВремяНачала + " - " + стрВремяОкончания;
		КонецЕсли; 
		
	КонецЦикла;
	
	Если стррПараметры.Свойство("ПронумероватьФактыПосещений") И стррПараметры.ПронумероватьФактыПосещений = Истина Тогда
		ДобавитьНомераФактовПосещений(тзПланПосешений, стррПараметры.ВсегоДней);
	КонецЕсли;
	
	тзПланПосешений.Сортировать("НомерВПлане,Партнер");
	
	ДобавитьАдресаПартнеров(тзПланПосешений);
	
	Если стррПараметры.Свойство("ДобавитьКоординатыПартнеров") И стррПараметры.ДобавитьКоординатыПартнеров = Истина Тогда
		ДобавитьКоординатыПартнеров(тзПланПосешений);
	КонецЕсли; 
	
	Если стррПараметры.Свойство("ВернутьФактПосещений") И стррПараметры.ВернутьФактПосещений = Истина Тогда
		стррПараметры.Вставить("тзФактПосещений", тзФактПосещений);
	КонецЕсли; 

	Возврат тзПланПосешений;
	
КонецФункции

// Функция циклически приводит число Значение в число в диапазоне [1; Модуль]
Процедура НормироватьПоМодулю(Значение, Модуль)
	Если Значение < 1 Тогда
		Значение = Значение + Модуль * Цел((Модуль - Значение) / Модуль);
	ИначеЕсли Значение > Модуль Тогда
		Значение = Значение % Модуль;
		Если Значение = 0 Тогда
			Значение = Модуль;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

// Функция возвращает структуру с основными свойствами списка торговых точек, закрепленного за агентом.
// В свойстве ТекстОшибки возвращается описание ошибки (если возникла ошибка).
Функция ПрочитатьИПроверитьСписокТорговыхТочекАгента(Агент, ДляПоляВыбора = Истина) Экспорт 

	стррРезультат = Новый Структура("ТекстОшибки,КодОшибки,НаименованиеСписокТТ,СсылкаСписокТТ,ИспользуетсяДляПланированияСписокТТ,ИспользоватьПорядокСписокТТ");
	
	стррРезультат.НаименованиеСписокТТ = "";
	стррРезультат.ИспользоватьПорядокСписокТТ = Ложь;
	
	стррРеквизиты = ПолучитьНастройкиАгентаИзВХ(Агент, "СсылкаСписокТТ");
	Если стррРеквизиты = Неопределено Тогда
		
		стррРезультат.КодОшибки = "НетНастроекАгента";		
		Текст = НСтр("ru = 'Не найдено настроек для торгового агента. Проверьте настройки агента [подсказка].'");
		
	ИначеЕсли Не ЗначениеЗаполнено(стррРеквизиты.СсылкаСписокТТ) Тогда
		
		стррРезультат.КодОшибки = "НеУказанСТТ";		
		Текст = НСтр("ru = 'У торгового агента не указан ""Список торговых точек"". Задайте список торговых точек для агента [подсказка].'");
		
	Иначе
		стррРезультат.СсылкаСписокТТ = стррРеквизиты.СсылкаСписокТТ;
		стррОбъект = ПолучитьОбъектИзХранилища("СпрСТТ", стррРеквизиты.СсылкаСписокТТ);
		Если стррОбъект = Неопределено Тогда
			
			стррРезультат.КодОшибки = "ОшибкаСсылкиСТТ";			
			Текст = НСтр("ru = 'У торгового агента указан несуществующий ""Список торговых точек"". Задайте список торговых точек для агента [подсказка].'");
			
		Иначе
			стррРезультат.НаименованиеСписокТТ = стррОбъект.Наименование;
			Если стррОбъект.Состав.Количество() = 0 Тогда
				
				стррРезультат.КодОшибки = "УказанПустойСТТ";				
				Текст = НСтр("ru = 'У торгового агента указан пустой ""Список торговых точек"". Укажите заполненный список торговых точек для агента [подсказка].'");
				
			Иначе
				стррРезультат.ИспользуетсяДляПланированияСписокТТ = СписокТорговыхТочекИспользуетсяДляПланированияПосещений(стррОбъект);
				Если стррРезультат.ИспользуетсяДляПланированияСписокТТ Тогда
					
					стррРезультат.ИспользоватьПорядокСписокТТ = стррОбъект.ИспользоватьПорядок;
					
				Иначе
					
					стррРезультат.КодОшибки = "ДетализацияСТТБезПланаГрафика";
					Текст = НСтр("ru = 'У торгового агента указан ""Список торговых точек"" без детализации по ""Графику"" или ""Плану посещений"". Укажите для агента список торговых точек с одним из указанных вариантов детализации [подсказка].'");
					
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	Если Текст <> "" Тогда
		Если ДляПоляВыбора Тогда
			стррРезультат.ТекстОшибки = СтрЗаменить(Текст, "[подсказка]", НСтр("ru = '(для этого нажмите кнопку ""Открыть"" справа от агента)'"));
		Иначе
			стррРезультат.ТекстОшибки = СтрЗаменить(Текст, " [подсказка]", "");
		КонецЕсли; 
	КонецЕсли; 
	 
	Возврат стррРезультат;

КонецФункции

//dm_171010:Внесены изменения
Процедура ДобавитьАдресаПартнеров(ТЗ)
	
	мПартнеры = ТЗ.ВыгрузитьКолонку("Партнер");
	Если мПартнеры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 

	мВидыКИ = Новый Массив;
	//dm_171010:
	мВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	
	//{{dm_180423
	Если Конфигурация("Бухгалтерия_KZ") Тогда
		тзАдреса = КонтактнаяИнформацияОбъектов(мПартнеры,, мВидыКИ);
	Иначе
		//тзАдреса = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(мПартнеры,, мВидыКИ);
		ОбщийМодуль = Вычислить("УправлениеКонтактнойИнформацией");
		тзАдреса = ОбщийМодуль.КонтактнаяИнформацияОбъектов(мПартнеры,, мВидыКИ);
	КонецЕсли;
	//}}dm_180423
	Для каждого СтрокаТ Из ТЗ Цикл
		
		стзАдреса = тзАдреса.Найти(СтрокаТ.Партнер, "Объект");
		Если стзАдреса <> Неопределено Тогда
			СтрокаТ.Адрес = стзАдреса.Представление;
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры

// Процедура добавляет номер факта посещений. Сортировка ТЗ меняется!
// В таблицу добавляются колонки вида НФ<N>, где N - номер дня в плане. В колонках указываются порядковые номера посещений ТТ.
Процедура ДобавитьНомераФактовПосещений(ТЗ, ВсегоДней)
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(5, 0);
	ТипЧисло = Новый ОписаниеТипов("Число", КвалификаторЧисла);
	
	Для Индекс = 1 По ВсегоДней Цикл
		ТЗ.Колонки.Добавить("НФ" + Строка(Индекс), ТипЧисло);
	КонецЦикла; 		

	Для Индекс = 1 По ВсегоДней Цикл
		стрИндекс = Строка(Индекс);
		КолонкаФакта = "Д" + Строка(Индекс);
		КолонкаНФ = "НФ" + Строка(Индекс);
		НомерФакта = 0;
		ТЗ.Сортировать(КолонкаФакта);
		Для каждого СтрокаТ Из ТЗ Цикл
			Если Не ПустаяСтрока(СтрокаТ[КолонкаФакта]) Тогда
				НомерФакта = НомерФакта + 1;
				СтрокаТ[КолонкаНФ] = НомерФакта;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры

Процедура ДобавитьКоординатыПартнеров(ТЗ)
	
	мПартнеры = ТЗ.ВыгрузитьКолонку("Партнер");
	тзКоординаты = ПолучитьТЗКоординатПартнеров(мПартнеры);
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(10, 4);
	ТипЧисло  = Новый ОписаниеТипов("Число", КвалификаторЧисла);
	ТЗ.Колонки.Добавить("Широта", ТипЧисло);
	ТЗ.Колонки.Добавить("Долгота", ТипЧисло);
	Для Каждого СтрокаТ Из тзКоординаты Цикл
		сТЗ = ТЗ.Найти(СтрокаТ.Ссылка, "Партнер");
		Если сТЗ <> Неопределено Тогда
			сТЗ.Широта  = СтрокаТ.Широта;
			сТЗ.Долгота = СтрокаТ.Долгота;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

// ПрограммныйИнтерфейс_ПланПосещений
#КонецОбласти 


#Область ПрограммныйИнтерфейс_КартыСервер

Функция ПолучитьКоординатыПартнера(Партнер, стррКоординаты) Экспорт
	
	мПартнеры = Новый Массив;
	мПартнеры.Добавить(Партнер);
	тз = ПолучитьТЗКоординатПартнеров(мПартнеры);
	Если тз.Количество() = 0 Тогда
		стррКоординаты.Широта  = 0;
		стррКоординаты.Долгота = 0;
		Возврат Ложь;
	Иначе
		стррКоординаты.Широта  = тз[0].Широта;
		стррКоординаты.Долгота = тз[0].Долгота;
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции

//dm_171010,dm_180523:Внесены изменения
Функция ПолучитьТЗКоординатПартнеров(мПартнеры) Экспорт
	
	//{{dm_180523
	ОпределитьВерсиюКонфигурации();
	Если гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации("<=Бухгалтерия_3.0.5.11") Тогда
		Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Партнеры.Ссылка,
		|	СвойстваДолготы.Долгота,
		|	СвойстваШироты.Широта,
		|	СвойстваАдреса.Адрес
		|ИЗ
		|	Справочник.Контрагенты КАК Партнеры
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		ПартнерыДополнительныеРеквизиты.Объект КАК Партнер,
		|		ПартнерыДополнительныеРеквизиты.Значение КАК Широта
		|	ИЗ
		|		РегистрСведений.ЗначенияСвойствОбъектов КАК ПартнерыДополнительныеРеквизиты
		|	ГДЕ
		|		ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоШирота) КАК СвойстваШироты
		|	ПО (СвойстваШироты.Партнер = Партнеры.Ссылка)
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		ПартнерыДополнительныеРеквизиты.Объект КАК Партнер,
		|		ПартнерыДополнительныеРеквизиты.Значение КАК Долгота
		|	ИЗ
		|		РегистрСведений.ЗначенияСвойствОбъектов КАК ПартнерыДополнительныеРеквизиты
		|	ГДЕ
		|		ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоДолгота) КАК СвойстваДолготы
		|	ПО (СвойстваДолготы.Партнер = Партнеры.Ссылка)
		|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		ПартнерыДополнительныеРеквизиты.Объект КАК Партнер,
		|		ПартнерыДополнительныеРеквизиты.Значение КАК Адрес
		|	ИЗ
		|		РегистрСведений.ЗначенияСвойствОбъектов КАК ПартнерыДополнительныеРеквизиты
		|	ГДЕ
		|		ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоАдрес) КАК СвойстваАдреса
		|	ПО (СвойстваАдреса.Партнер = Партнеры.Ссылка)
		|ГДЕ 
		|	Партнеры.Ссылка В (&мПартнеры)";	
	Иначе
		Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Партнеры.Ссылка,
		|	СвойстваДолготы.Долгота,
		|	СвойстваШироты.Широта,
		|	СвойстваАдреса.Адрес
		|ИЗ
		|	Справочник.Контрагенты КАК Партнеры
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		ПартнерыДополнительныеРеквизиты.Ссылка КАК Партнер,
		|		ПартнерыДополнительныеРеквизиты.Значение КАК Широта
		|	ИЗ
		|		Справочник.Контрагенты.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|	ГДЕ
		|		ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоШирота) КАК СвойстваШироты
		|	ПО (СвойстваШироты.Партнер = Партнеры.Ссылка)
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		ПартнерыДополнительныеРеквизиты.Ссылка КАК Партнер,
		|		ПартнерыДополнительныеРеквизиты.Значение КАК Долгота
		|	ИЗ
		|		Справочник.Контрагенты.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|	ГДЕ
		|		ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоДолгота) КАК СвойстваДолготы
		|	ПО (СвойстваДолготы.Партнер = Партнеры.Ссылка)
		|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		ПартнерыДополнительныеРеквизиты.Ссылка КАК Партнер,
		|		ПартнерыДополнительныеРеквизиты.Значение КАК Адрес
		|	ИЗ
		|		Справочник.Контрагенты.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|	ГДЕ
		|		ПартнерыДополнительныеРеквизиты.Свойство = &СвойствоАдрес) КАК СвойстваАдреса
		|	ПО (СвойстваАдреса.Партнер = Партнеры.Ссылка)
		|ГДЕ 
		|	Партнеры.Ссылка В (&мПартнеры)";
	КонецЕсли;
	//}}dm_180523
		
	СвойствоШирота  = ДополнительноеСвойствоПоНаименованию(ИмяСвойстваШиротаПартнер());	
	СвойствоДолгота = ДополнительноеСвойствоПоНаименованию(ИмяСвойстваДолготаПартнер());
	СвойствоАдрес   = ДополнительноеСвойствоПоНаименованию(ИмяСвойстваАдресИзСервисаПартнер());
	
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("СвойствоШирота",  СвойствоШирота);
	Запрос.УстановитьПараметр("СвойствоДолгота", СвойствоДолгота);
	Запрос.УстановитьПараметр("СвойствоАдрес",   СвойствоАдрес);
	Запрос.УстановитьПараметр("мПартнеры", 		 мПартнеры);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПолучитьВебКаталогИконок() Экспорт

	Возврат "http://www.agentplus.ru/tmp/configs/map/"; //"http://www.agentplus.ru/download/1CModules/8/8.2/11/icons/";

КонецФункции
 
// ПрограммныйИнтерфейс_КартыСервер
#КонецОбласти 


#Область ПрограммныйИнтерфейс_ГруппаПользователей

Функция ПолучитьГруппуПользователейТорговыеАгенты() Экспорт

	ИмяГруппы = "Торговые агенты (Агент Плюс)";
	
	Результат = Справочники.ГруппыПользователей.НайтиПоНаименованию(ИмяГруппы, Истина); 
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Элемент = Справочники.ГруппыПользователей.СоздатьЭлемент();
		Элемент.Наименование = ИмяГруппы;
		Элемент.Комментарий  = НСтр("ru = 'Группа пользователей, использующих ПО ""Агент Плюс: Мобильная торговля"". Создана автоматически.'");
		Элемент.Записать();
		Результат = Элемент.Ссылка;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// ПрограммныйИнтерфейс_ГруппаПользователей
#КонецОбласти 

// ПрограммныйИнтерфейс
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область ХарактеристикиНоменклатуры

Функция ПолучитьХарактеристикуНоменклатуры(ИдХарактеристики)
	
	Если ИспользоватьХарактеристики Тогда
		
		Если ИдХарактеристики = Неопределено Или ЭтоПустойИдентификатор(ИдХарактеристики) Тогда
			Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Иначе 		
			НайденнаяСтрока = ВременныеТаблицы.СпрХарактеристикиНоменклатурыСлужебный.Найти(Новый УникальныйИдентификатор(ИдХарактеристики));
			Характеристика = ?(НайденнаяСтрока = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), НайденнаяСтрока.Характеристика);
		КонецЕсли;
		
	Иначе 
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();	
	КонецЕсли;
	
	Возврат Характеристика;
	
КонецФункции

Функция ИдентификаторХарактеристикиНоменклатуры(Номенклатура, Характеристика)
	
	Если Не ИспользоватьХарактеристики Или Не ЗначениеЗаполнено(Характеристика) Тогда 
		Возврат ""; // Gri++ 20.07.17 !!! правильно возвращать характеристику? возникает "плавающее" поведение функции - возвращает результат разных типов
	КонецЕсли;
	
	Отбор = Новый Структура();
	Отбор.Вставить("Номенклатура", Номенклатура);
	Отбор.Вставить("Характеристика", Характеристика);
	
	Результат = ВременныеТаблицы.СпрХарактеристикиНоменклатурыСлужебный.НайтиСтроки(Отбор);	
	
	Если Результат.Количество() = 0 Тогда 
		НоваяСтрока = ВременныеТаблицы.СпрХарактеристикиНоменклатурыСлужебный.Добавить();
		НоваяСтрока.Номенклатура 	= Номенклатура;
		НоваяСтрока.Характеристика 	= Характеристика;
		НоваяСтрока.Идентификатор 	= Новый УникальныйИдентификатор;
		Результат = НоваяСтрока.Идентификатор;
		гОбновитьСпрХарактеристикиНоменклатурыСлужебный = Истина;
	Иначе 
		Результат = Результат[0].Идентификатор;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// ХарактеристикиНоменклатуры
#КонецОбласти 

#Область РеквизитыОбъекта

Функция ЕстьРеквизитОбъекта(ИмяРеквизита, Объект) Экспорт
	
	ПроверкаРеквизита = Новый Структура(ИмяРеквизита, "2B8C0DC0-38EE-4B6A-883D-F432FCC0C5E1");
	ЗаполнитьЗначенияСвойств(ПроверкаРеквизита, Объект);
	Возврат ПроверкаРеквизита[ИмяРеквизита] <> "2B8C0DC0-38EE-4B6A-883D-F432FCC0C5E1";
	
КонецФункции

// Функция возвращает название реквизита, найденного среди реквизитов метаданных объекта.
// Ищутся названия реквизитов, указанных в параметре стрРеквизиты.
// Если ни один из реквизитов не найден, возвращается Неопределено.
Функция РеквизитОбъектаИзСписка(МетаданныеОбъекта, стрРеквизиты) Экспорт
	
	Результат = Неопределено;
	
	мРеквизиты = СтрРазделить_(стрРеквизиты);
	мтдРеквизиты = МетаданныеОбъекта.Реквизиты;
	Для Каждого стрРеквизит Из мРеквизиты Цикл
		Если мтдРеквизиты.Найти(стрРеквизит) <> Неопределено Тогда
			Результат = стрРеквизит;
			Прервать;
		КонецЕсли; 
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

Функция РеквизитОбъекта(ИмяРеквизита)
	
	Значение = гКэшРеквизитыОбъектов.Получить(ИмяРеквизита);
	
	Если Значение = Неопределено Тогда
		
		Если ИмяРеквизита = "Спр_Пользователи_Подразделение" Тогда
			Реквизиты = Метаданные.Справочники.Пользователи.Реквизиты;
			Если Реквизиты.Найти("ТекущееПодразделение") <> Неопределено Тогда
				Значение = "ТекущееПодразделение";
			ИначеЕсли Реквизиты.Найти("Подразделение") <> Неопределено Тогда
				Значение = "Подразделение";
			Иначе
				ВызватьИсключение("Не удалось найти реквизит для объекта: " + ИмяРеквизита);
			КонецЕсли;
		Иначе
			ВызватьИсключение("Функция РеквизитОбъекта(), неизвестный параметр = " + ИмяРеквизита);
			
		КонецЕсли;
		
		гКэшРеквизитыОбъектов.Вставить(ИмяРеквизита, Значение);		
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// РеквизитыОбъекта
#КонецОбласти 

#Область ПреобразованияЦветСтрока

Функция ЦветВСтроку(Цвет)
	
	Возврат СтрЗаменить(Строка(Цвет), " ", "");
	
КонецФункции

Функция ЦветИзСтроки(Знач СтрЦвет)
	
	Если СтрЧислоВхождений(СтрЦвет, ",") <> 2 Тогда // неверный формат значения в СтрЦвет
		СтрЦвет = "0,0,0";
	КонецЕсли;
	
	мЦвета = СтрРазделить_(СтрЦвет, ",");
	
	Красный = СтрокуВЧислоЦвета(мЦвета[0]);
	Зеленый = СтрокуВЧислоЦвета(мЦвета[1]);
	Синий   = СтрокуВЧислоЦвета(мЦвета[2]);
	
	Возврат Новый Цвет(Красный, Зеленый, Синий);
	
КонецФункции

Функция СтрокуВЧислоЦвета(Строка)
	
	СтрРезультат = "";
	
	Для Поз = 1 По СтрДлина(Строка) Цикл
		Символ = Сред(Строка, Поз, 1);
		Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда
			СтрРезультат = СтрРезультат + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ?(СтрДлина(СтрРезультат) = 0, 0, Число(СтрРезультат) % 256);
	
КонецФункции

// ПреобразованияЦветСтрока
#КонецОбласти 

#Область ПроверкаФайлов

Функция КаталогСуществует(ПутьККаталогу)
	
	ОбъектКаталог = Новый Файл(ПутьККаталогу);
	Возврат ОбъектКаталог.Существует() И ОбъектКаталог.ЭтоКаталог();
	
КонецФункции

Функция ФайлСуществует(ПутьКФайлу)
	
	ФайлОбъект = Новый Файл(ПутьКФайлу);
	Возврат ФайлОбъект.Существует();
	
КонецФункции

// Проверяет существование каталога, если он не существует, то создается новый.
Функция ПроверитьИСоздатьКаталог(ПутьККаталогу, ПроверитьПослеСоздания = Ложь)

	Если Не КаталогСуществует(ПутьККаталогу) Тогда
		СоздатьКаталог(ПутьККаталогу);
		Если ПроверитьПослеСоздания Тогда
			Возврат КаталогСуществует(ПутьККаталогу);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

// Применяется только для сервера.
Функция ДополнитьСлешВПуть(Каталог, Слеш = Неопределено) Экспорт

	Если Слеш = Неопределено Тогда
		Слеш = ?(ЭтоLinuxСервер(), "/", "\");
	КонецЕсли; 
	
	Если Прав(Каталог, 1) <> Слеш Тогда
		Возврат Каталог + Слеш;
	Иначе
		Возврат Каталог;		
	КонецЕсли;

КонецФункции 

// ПроверкаФайлов
#КонецОбласти

Функция НайтиПоЗначению(Коллекция, Значение)

	Результат = Неопределено;
	
	Для Каждого Элемент Из Коллекция Цикл
		Если Элемент.Значение = Значение Тогда
			Результат = Элемент;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция ЭтоLinuxСервер() Экспорт
	
	Если гЭтоLinuxСервер = Неопределено Тогда
		СистемнаяИнформация = Новый СистемнаяИнформация;
		гЭтоLinuxСервер = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86
		             Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	КонецЕсли; 
				 
	Возврат гЭтоLinuxСервер;
	
КонецФункции

Функция ЭтоСсылкаНаНайденныйОбъект(Ссылка)
	
	Если Ссылка = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Стр = НРег(Строка(Ссылка));
		Если Лев(Стр, 1) = "<" И 0 <> Найти(Стр, ">") И 0 <> Найти(Стр, "объект") Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПользовательНастроек() Экспорт

	Возврат "АгентПлюсОбменДанными";
	
КонецФункции // ПользовательНастроек()

Функция КлючНастроекОбмена() Экспорт

	Возврат "АгентПлюсОбменДанными";
	
КонецФункции // ПользовательНастроек()

Функция КомпоновщикНастроекАгента(СхемаКомпоновки) Экспорт

	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки);
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);

	// Добавим выбранные поля
	Для Каждого Элемент из КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.Элементы Цикл
		Если НЕ Элемент.Папка Тогда
			ВыбранноеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Использование = Истина;
			ВыбранноеПоле.Поле = Элемент.Поле;
		КонецЕсли;
	КонецЦикла;

	// Добавим группировку
	ГруппировкаНастроек = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Поле = ГруппировкаНастроек.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));

	Возврат КомпоновщикНастроек.Настройки;
КонецФункции

Функция ЭлементОтбораПоЛевомуЗначению(стрЛевоеЗначение, стрНазванияДополнительныхЭлементов = Неопределено )

	ЭлементОтбора = Неопределено;
	ОтборыАгента = ВыбНастройкиАгента.ВыгружаемыеОбъекты;
	
	// gi_170902 {
	Если ТипЗнч(ОтборыАгента) <> Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		Текст = НСтр("ru = 'Агент: ""%1"", не заполнены ""Выгружаемые данные""! Проверьте ""Выгружаемые данные"" в настройках агента.'");
		Текст = СтрШаблон_(Текст, ВыбНастройкиАгента.Пользователь);
		ВызватьИсключение(Текст);
	КонецЕсли; 
	// gi_170902 }
	
	Для Каждого Элемент Из ОтборыАгента.Элементы Цикл
		Если Строка(Элемент.ЛевоеЗначение) = стрЛевоеЗначение Тогда
			ЭлементОтбора = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда // не найден элемент отбора с представлением ПредставлениеОтбора
		Текст = НСтр("ru = 'Агент: ""%1"", не найдено поле СКД ""%2""! Проверьте ""Выгружаемые данные"" в настройках агента.'");
		Текст = СтрШаблон_(Текст, ВыбНастройкиАгента.Пользователь, стрЛевоеЗначение);
		ВызватьИсключение(Текст);
	КонецЕсли; 
	
	// проверяем существование ссылки в отборе
	Если ЭлементОтбора.Использование И Не ЭтоСсылкаНаНайденныйОбъект(ЭлементОтбора.ПравоеЗначение) Тогда
		Текст = НСтр("ru = 'Агент: ""%1"", параметр отбора: %2. Найдена ссылка на несуществующий объект: %3!Проверьте ""Выгружаемые данные"" в настройках агента.'");
		Текст = СтрШаблон_(Текст, ВыбНастройкиАгента.Пользователь, стрЛевоеЗначение, ЭлементОтбора.ПравоеЗначение);
		ВызватьИсключение(Текст);
	КонецЕсли;
	
	// Значения дополнительных элементов отбора ищем когда найдено значение основного элемента отбора 
	Если стрНазванияДополнительныхЭлементов <> Неопределено Тогда 
		
		мОтборы = ПолучитьОтборыДляДополнительныхЭлементов(стрЛевоеЗначение, ОтборыАгента, стрНазванияДополнительныхЭлементов);
		
		Если мОтборы.Количество() <> 0 Тогда
			
			мОтборы.Вставить(0, ЭлементОтбора);
			
			Возврат мОтборы;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат ЭлементОтбора;		
	
КонецФункции

//{{dm_180521 
//Функция возвращает структуру отборов:
//		-	Маршруты : список партнеров по выгружаемым маршрутам;
//		-	Отборы	 : отборы портнеров из выгружаемых данных
Функция ЭлементОтбораПоЛевомуЗначениюПартнеры(стрЛевоеЗначение, стрНазванияДополнительныхЭлементов = Неопределено )

	ЭлементОтбора = Неопределено;
	ОтборыАгента = ВыбНастройкиАгента.ВыгружаемыеОбъекты;
	стррОтборы = Новый Структура("Маршруты, Отборы");
	мОтборы = Новый Массив;
	// gi_170902 {
	Если ТипЗнч(ОтборыАгента) <> Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		Текст = НСтр("ru = 'Агент: ""%1"", не заполнены ""Выгружаемые данные""! Проверьте ""Выгружаемые данные"" в настройках агента.'");
		Текст = СтрШаблон_(Текст, ВыбНастройкиАгента.Пользователь);
		ВызватьИсключение(Текст);
	КонецЕсли; 
	// gi_170902 }
	
	Для Каждого Элемент Из ОтборыАгента.Элементы Цикл
		Если Строка(Элемент.ЛевоеЗначение) = стрЛевоеЗначение Тогда
			ЭлементОтбора = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда // не найден элемент отбора с представлением ПредставлениеОтбора
		Текст = НСтр("ru = 'Агент: ""%1"", не найдено поле СКД ""%2""! Проверьте ""Выгружаемые данные"" в настройках агента.'");
		Текст = СтрШаблон_(Текст, ВыбНастройкиАгента.Пользователь, стрЛевоеЗначение);
		ВызватьИсключение(Текст);
	КонецЕсли; 
	
	// проверяем существование ссылки в отборе
	Если ЭлементОтбора.Использование И Не ЭтоСсылкаНаНайденныйОбъект(ЭлементОтбора.ПравоеЗначение) Тогда
		Текст = НСтр("ru = 'Агент: ""%1"", параметр отбора: %2. Найдена ссылка на несуществующий объект: %3!Проверьте ""Выгружаемые данные"" в настройках агента.'");
		Текст = СтрШаблон_(Текст, ВыбНастройкиАгента.Пользователь, стрЛевоеЗначение, ЭлементОтбора.ПравоеЗначение);
		ВызватьИсключение(Текст);
	КонецЕсли;
	
	// Значения дополнительных элементов отбора ищем когда найдено значение основного элемента отбора 
	Если стрНазванияДополнительныхЭлементов <> Неопределено Тогда 
		
		мМаршруты = ПолучитьОтборыДляДополнительныхЭлементов(стрЛевоеЗначение, ОтборыАгента, стрНазванияДополнительныхЭлементов);
		
		стррОтборы.Вставить("Маршруты", мМаршруты);
		//Если мМаршруты.Количество() <> 0 Тогда
		//	мМаршруты.Вставить(0, ЭлементОтбора);
		//	Возврат мМаршруты;
		//КонецЕсли; 
		
	КонецЕсли;
	мОтборы.Добавить(ЭлементОтбора);
	стррОтборы.Вставить("Отборы", мОтборы);
	
	//Возврат ЭлементОтбора;
	Возврат стррОтборы;
	
КонецФункции

Функция ПолучитьОтборыДляДополнительныхЭлементов(стрЛевоеЗначение, ОтборыАгента, НазванияДополнительныхЭлементов)

	мНазвания = СтрРазделить_(НазванияДополнительныхЭлементов);
	мРезультат = Новый Массив;	
	
	Для Каждого Название Из мНазвания Цикл
		
		ВРегНазвание = ВРег(Название);
		ДопЭлементОтбора = Неопределено;
		
		Для Каждого Элемент Из ОтборыАгента.Элементы Цикл // ищем элемент отбора среди элементов отбора в СКД
			Если ВРег(Элемент.ЛевоеЗначение) = ВРегНазвание Тогда
				ДопЭлементОтбора = Элемент;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ПодготовитьДополнительныйЭлементОтбора(ДопЭлементОтбора, ОтборыАгента, стрЛевоеЗначение, Название);
		
		Если ДопЭлементОтбора <> Неопределено И ДопЭлементОтбора.Использование И ДопЭлементОтбора.ПравоеЗначение <> Неопределено Тогда
			мРезультат.Добавить(ДопЭлементОтбора);
		КонецЕсли; 
	
	КонецЦикла;
	
	Возврат мРезультат;
	
КонецФункции

Процедура ДобавитьУсловиеВключенияПартнера(стрУсловие, ПравоеЗначение, мРеквизиты, ОперацияСравнения, ОперацияСоединения)
	
	ЭтоСписокЗначений = (ТипЗнч(ПравоеЗначение) = Тип("СписокЗначений"));
	Для Каждого ИмяРеквизита Из мРеквизиты Цикл
		ВключатьВУсловие = Ложь;
		Если ЭтоСписокЗначений И ПравоеЗначение.НайтиПоЗначению(ИмяРеквизита) <> Неопределено Тогда
			ВключатьВУсловие = Истина;
		ИначеЕсли ИмяРеквизита = ПравоеЗначение Тогда
			ВключатьВУсловие = Истина;
		КонецЕсли; 
		Если ВключатьВУсловие Тогда
			стрУсловие = стрУсловие + ?(ПустаяСтрока(стрУсловие), "", " " + ОперацияСоединения + " ")
				+ "Партнеры." + ИмяРеквизита + " " + ОперацияСравнения + " ИСТИНА ";
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

Функция ПартнерыПоТипу(ВидСравнения, ПравоеЗначение)
	
	Если Не ЗначениеЗаполнено(ПравоеЗначение) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	мРеквизиты = СтрРазделить_("Клиент,Поставщик,Конкурент");
	
	стрУсловие = "";
	Если ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Или ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
		ДобавитьУсловиеВключенияПартнера(стрУсловие, ПравоеЗначение, мРеквизиты, "=", "ИЛИ");
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Или ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
		ДобавитьУсловиеВключенияПартнера(стрУсловие, ПравоеЗначение, мРеквизиты, "<>", "И");
	Иначе
		Возврат Неопределено; 
	КонецЕсли;
	
	Если ПустаяСтрока(стрУсловие) Тогда
		Возврат Неопределено; 
	КонецЕсли; 
	
	Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Партнеры.Ссылка
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|ГДЕ 
		|	Партнеры.ПометкаУдаления = ЛОЖЬ
		|	И ([Условие])";
		
	Текст = СтрЗаменить(Текст, "[Условие]", стрУсловие);
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Пользователь", ВыбНастройкиАгента.Пользователь);
	мПартнеры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат мПартнеры;
	
КонецФункции	

Процедура ПодготовитьДополнительныйЭлементОтбора(ЭлементОтбора, ОтборыАгента, стрЛевоеЗначение, НазваниеДополнительногоЭлемента)
	
	Если ЭлементОтбора = Неопределено Тогда // значит правое значение отбора должны взять из настроек агента 
		Если Не ВыбНастройкиАгента.Свойство(НазваниеДополнительногоЭлемента) Тогда // такой реквизит в настройках агента отсутствует
			Возврат;
		КонецЕсли; 
		ЗначениеНастройки = ВыбНастройкиАгента[НазваниеДополнительногоЭлемента];
		Если Не ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			Возврат;
		КонецЕсли;
	Иначе // элемент отбора найден в СКД
		Если Не ЭлементОтбора.Использование Тогда
			ЭлементОтбора = Неопределено;
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	Если НазваниеДополнительногоЭлемента = "СсылкаСписокТТ" 
		Или НазваниеДополнительногоЭлемента = "ТолькоПартнерыОсновногоМенеджера"  
		Или НазваниеДополнительногоЭлемента = "ТипПартнера"  
	Тогда
		
		мПартнеры = Неопределено;
		
		Если НазваниеДополнительногоЭлемента = "СсылкаСписокТТ" Тогда // ЗначениеНастройки - это GUID списка ТТ
			//{{dm_180516
			Если НЕ ВыгружатьМаршруты Тогда
				Возврат;
			КонецЕсли;
			//}}dm_180516
			СтррОбъект = ПолучитьОбъектИзХранилища("СпрСТТ", ЗначениеНастройки);
			Если СтррОбъект <> Неопределено Тогда
				мПартнеры = СтррОбъект.Состав.ВыгрузитьКолонку("Партнер");
			КонецЕсли; 
			
		ИначеЕсли НазваниеДополнительногоЭлемента = "ТолькоПартнерыОсновногоМенеджера" Тогда // булево значение - признак отбора партнеров по атрибуту ОсновнойМенеджер
			// проверяем условие отбора для этого элемента
			Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно И ЭлементОтбора.ПравоеЗначение = Истина Тогда // используем отбор
			ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно И ЭлементОтбора.ПравоеЗначение = Ложь Тогда // используем отбор
			Иначе
				Возврат; // не используем отбор партнеров по полю "ОсновнойМенеджер"
			КонецЕсли; 
			Запрос = Новый Запрос("
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Партнеры.Ссылка
				|ИЗ
				|	Справочник.Партнеры КАК Партнеры
				|ГДЕ 
				|	Партнеры.ПометкаУдаления = ЛОЖЬ
				|	И Партнеры.ОсновнойМенеджер = &Пользователь");
			Запрос.УстановитьПараметр("Пользователь", ВыбНастройкиАгента.Пользователь);
			мПартнеры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			
		ИначеЕсли НазваниеДополнительногоЭлемента = "ТипПартнера" Тогда // строковое значение: "Клиент", "Поставщик" или "Конкурент"

			мПартнеры = ПартнерыПоТипу(ЭлементОтбора.ВидСравнения, ЭлементОтбора.ПравоеЗначение);			
			
		Иначе
			ВызватьИсключение("Процедура ПодготовитьДополнительныйЭлементОтбора() - Неизвестное значение параметра НазваниеДополнительногоЭлемента = """ 
				+ НазваниеДополнительногоЭлемента + """");
		КонецЕсли; 
		
		Если мПартнеры = Неопределено Или мПартнеры.Количество() = 0 Тогда
			ЭлементОтбора = Неопределено;
			Возврат;
		КонецЕсли; 
		
		Список = Новый СписокЗначений;
		Список.ЗагрузитьЗначения(мПартнеры);
		
		ЭлементОтбора = ОтборыАгента.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); // всегда создаем новый элемент отбора, т.к. используем новое стрЛевоеЗначение
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(стрЛевоеЗначение);
		ЭлементОтбора.ИдентификаторПользовательскойНастройки = Строка(Новый УникальныйИдентификатор);
		
		ЭлементОтбора.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = Список;
		ЭлементОтбора.Использование  = Истина;				
		
	Иначе // используем найденный элемент отбора 
		// пока таких примеров нет
	КонецЕсли; 

КонецПроцедуры

Функция СхемаКомпоновкиДанныхДляОбъекта(ТекстЗапроса) Экспорт

	СхемаКомпоновки = Новый СхемаКомпоновкиДанных();

	Источник = СхемаКомпоновки.ИсточникиДанных.Добавить();
	Источник.Имя = "ИсточникДанных";
	Источник.СтрокаСоединения = "";
	Источник.ТипИсточникаДанных = "Local";

	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных";
	НаборДанных.ИсточникДанных = "ИсточникДанных";
	НаборДанных.Запрос = ТекстЗапроса;

	Возврат СхемаКомпоновки;
КонецФункции

// Функция возвращает массив элементов справочника в соответствии с текстом запроса.
// 
// Параметры:
//	ТекстЗапроса - Строка - текст запроса выборки из справочника;
//  ЭлементОтбора - ЭлементОтбораКомпоновкиДанных - элемент (условия) отбора.
//  
// Возвращаемое значение:
//  Массив - элементы справочника.
//
Функция ВыборкаИзСправочника(ТекстЗапроса, ЭлементОтбора = Неопределено)

	Если ЭлементОтбора <> Неопределено И ЭлементОтбора.Использование Тогда // задействован ЭлементОтбораКомпоновкиДанных
		МакетКомпоновки = СформированныйМакетКомпоновкиДанных(ЭлементОтбора, ТекстЗапроса);
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
		ТаблицаРезультата = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		Возврат ТаблицаРезультата.ВыгрузитьКолонку("Ссылка");
	Иначе // условие без отбора данных
		Запрос = Новый Запрос(ТекстЗапроса);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		Возврат РезультатЗапроса.ВыгрузитьКолонку("Ссылка");
	КонецЕсли; 
	
КонецФункции

Функция РезультатЗапросаВВидеТЗ(ТекстЗапроса, ОтборыСКД = Неопределено)
	
	Если ОтборыСКД <> Неопределено И ОтборыСКД.Использование Тогда
		МакетКомпоновки = СформированныйМакетКомпоновкиДанных(ОтборыСКД, ТекстЗапроса);
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
		Возврат ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Иначе
		Запрос = Новый Запрос(ТекстЗапроса);
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
КонецФункции

Функция ИдентификаторСсылки(ОбъектСсылка)

	Если ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Возврат Строка(ОбъектСсылка.Ссылка.УникальныйИдентификатор());
	Иначе
		Возврат "";
	КонецЕсли; 

КонецФункции 
 
Функция КаталогВременныхФайловАгента()

	Результат = КаталогВременныхФайлов() + "AP20TMP";
	ПроверитьИСоздатьКаталог(Результат);
	
	Результат = ДополнитьСлешВПуть(Результат) + ВыбНастройкиАгента.КаталогОбмена;
	ПроверитьИСоздатьКаталог(Результат);
	
	Возврат ДополнитьСлешВПуть(Результат);
	
КонецФункции

Функция КаталогВременныхФайловДляТранспорта(Подкаталог = "") Экспорт
	
	Каталог = КаталогВременныхФайлов() + "APtmp";
	Результат = ПроверитьИСоздатьКаталог(Каталог, Истина);
	Если Не Результат Тогда
		ВызватьИсключение("Не удалось создать временный каталог для обмена данными: " + Каталог);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Подкаталог) Тогда
		Каталог = ДополнитьСлешВПуть(Каталог) + Подкаталог;
		Результат = ПроверитьИСоздатьКаталог(Каталог, Истина);
		Если Не Результат Тогда
			ВызватьИсключение("Не удалось создать временный подкаталог для обмена данными: " + Каталог);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДополнитьСлешВПуть(Каталог);
	
КонецФункции

//dm_171012:Внесены изменения в алгоритм, + у функции добавлен параметр ВремКаталог
Функция КаталогФайловТрековАгента(ВремКаталог)

	КаталогТреков = ПодкаталогДанных("Треки");
	Если Не ПроверитьИСоздатьКаталог(КаталогТреков, Истина) Тогда
//{{dm_171012
// Сразу указываем ВремКаталогТрековАгента, так как путь в параметре ВремКаталог
// уже содержит каталог Агента, из ВыбНастройкиАгента.КаталогОбмена 
		Если СпособОбмена = "FTP" Тогда
			ВремКаталогТрековАгента = ДополнитьСлешВПуть(ВремКаталог) + "Tracks";
				Если Не ПроверитьИСоздатьКаталог(ВремКаталогТрековАгента, Истина) Тогда
	   				ВызватьИсключение("Не удалось создать каталог хранения треков """ + ВремКаталогТрековАгента + """!");
				Иначе
					Возврат ДополнитьСлешВПуть(ВремКаталогТрековАгента);
				КонецЕсли;
		Иначе
//}}dm_171012
	   		ВызватьИсключение("Не удалось создать каталог хранения треков """ + КаталогТреков + """!");
		КонецЕсли;
	КонецЕсли;
	
	КаталогТрековАгента = ДополнитьСлешВПуть(КаталогТреков) + ВыбНастройкиАгента.КаталогОбмена;
	Если Не ПроверитьИСоздатьКаталог(КаталогТрековАгента, Истина) Тогда
		Текст = "Не удалось создать каталог хранения треков для агента ""%1"", каталог - ""%2""!";
		Текст = СтрШаблон_(Текст, ВыбНастройкиАгента.Пользователь, КаталогТрековАгента);
		ВызватьИсключение(Текст);
	КонецЕсли;
	
	Возврат ДополнитьСлешВПуть(КаталогТрековАгента);
	
КонецФункции // КаталогФайловТрекинга()

// Функция упаковывает файл выгрузки в архив.
// Возвращает полный путь к архиву, 
// или Неопределено, если архив не удалось создать.
// 
Функция УпаковатьФайл(ИмяФайлаВыгрузки, ИмяАрхиваСКартинками)

	ПарольАрхива  = ""; // СокрЛП(ВыбНастройкиАгента.НастройкиМобильногоПриложения.ПарольНастроек.Значение);
	ПутьИмяАрхива = Лев(ИмяФайлаВыгрузки, СтрДлина(ИмяФайлаВыгрузки) - 3) + "zip";

	Архив = Новый ЗаписьZipФайла(ПутьИмяАрхива, ПарольАрхива,, МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);
	Архив.Добавить(ИмяФайлаВыгрузки);


	Если ЗначениеЗаполнено(ИмяАрхиваСКартинками) Тогда
		Архив.Добавить(ИмяАрхиваСКартинками);
	КонецЕсли;
	
#Область ПокаУбрано	

	//Если Не ПустаяСтрока(ПапкаСОтчетом) Тогда
	//	Архив.Добавить(ПапкаСОтчетом, РежимСохраненияПутейZIP.СохранятьОтносительныеПути);
	//	ЭтоВыгрузкаОтчетаПоЗапросу = Истина;
	//Иначе
	//	ЭтоВыгрузкаОтчетаПоЗапросу = Ложь;
	//КонецЕсли;

	//СписокБазДанных = Новый СписокЗначений;

	//// Сформируем файл-манифест
	//ДопНастройкиАгента = ВыбАгент.апНастройкиПриложения.Настройки.Получить();
	//
	//Если (Не ЭтоВыгрузкаОтчетаПоЗапросу) И (Не ДопНастройкиАгента = Неопределено) Тогда
	//	
	//	Для Каждого ВеткаДерева Из ДопНастройкиАгента.Строки Цикл 
	//		//Идентификатор     = ВеткаДерева.Идентификатор;
	//		//ЗначениеКонстанты = ВеткаДерева.Значение;
	//		Ключ			  = ВеткаДерева.Ключ;
	//		
	//		Если Ключ = "Общие" Тогда
	//			Для Каждого ВеткаДерева Из ВеткаДерева.Строки Цикл
	//				ЗначениеКонстанты = ВеткаДерева.Значение;
	//				Ключ			  = ВеткаДерева.Ключ;
	//				
	//				Если Ключ = "СписокБазДанных" Тогда
	//					МассивПодстрок = РазложитьСтрокуНаМассивПодстрок(ЗначениеКонстанты, ";");
	//					Для Сч = 0 По МассивПодстрок.Количество()-1 Цикл
	//						СписокБазДанных.Добавить(МассивПодстрок[Сч]);	
	//					КонецЦикла;
	//				КонецЕсли; //Если Ключ = "СписокБазДанных" Тогда					
	//			КонецЦикла; //Для Каждого ВеткаДерева Из ВеткаДерева.Строки Цикл				
	//		КонецЕсли; //Если Ключ = "Общие" Тогда			
	//	КонецЦикла; //Для Каждого ВеткаДерева Из ДопНастройкиАгента Цикл
	//	
	//КонецЕсли; //Если ДопНастройкиАгента <> Неопределено Тогда

	//Если (Не ЭтоВыгрузкаОтчетаПоЗапросу) И (СписокБазДанных.Количество() > 1) Тогда
	//	
	//	ПутьКФайлуМанифест = ВернутьКаталогВременныхФайлов(ПараметрыОбмена) + "manifest";
	//	
	//	Текст = Новый ЗаписьТекста(ПутьКФайлуМанифест, КодировкаТекста.ANSI);
	//	
	//	Текст.ЗаписатьСтроку("<manifest version=""1"">");
	//	
	//	Для Каждого ТекСтрока Из СписокБазДанных Цикл				
	//		Текст.ЗаписатьСтроку("<import db=" + """" + ТекСтрока + """" + " file=" + """" + "FromCDB.xml""" + " />");				
	//	КонецЦикла;
	//	
	//	Текст.ЗаписатьСтроку("</manifest>");
	//	
	//	Текст.Закрыть();
	//	
	//	Архив.Добавить(ПутьКФайлуМанифест);
	//	
	//КонецЕсли;
	
// ПокаУбрано
#КонецОбласти
	
	Архив.Записать();
	
	Если ФайлСуществует(ПутьИмяАрхива) Тогда
		Результат = ПутьИмяАрхива;
		Попытка
			Если ЗначениеЗаполнено(ИмяАрхиваСКартинками) Тогда
				УдалитьФайлы(ИмяАрхиваСКартинками);
			КонецЕсли; 
			УдалитьФайлы(ИмяФайлаВыгрузки);
		Исключение
		КонецПопытки; 
	Иначе
		Результат = Неопределено;
		ОповеститьОСобытии("Ошибка создания архива: " + ПутьИмяАрхива, "ОшибкаОбмен",, "ТекущийАгент");
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// sk_190718 Функция добавлена в рамках (MOD-236)
// Возвращает наименование Субконто "Склады" в счете "ТоварыНаСкладах" 
//
// Возвращаемое значение:
//   стрСубконто - 
//				  Строка - наименование субконто "Склады"
//				  Неопределено - субконто "Склады" не найдено
// 
Функция ПолучитьСубконтоПоСкладам()
	
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		СчТоварыНаСкладах = ПланыСчетов.Типовой.Товары;
		ВидСубконтоСклады = ПланыВидовХарактеристик.ВидыСубконтоТиповые.Склады;
	Иначе
		СчТоварыНаСкладах = ПланыСчетов.Хозрасчетный.Товары;
		ВидСубконтоСклады = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады;
	КонецЕсли;

	ВидСубконтоСкладыВСчТоварыНаСкладах = СчТоварыНаСкладах.ВидыСубконто.Найти(ВидСубконтоСклады, "ВидСубконто"); 		
	
	Если Не ВидСубконтоСкладыВСчТоварыНаСкладах = Неопределено Тогда 
		стрСубконто = "Субконто" + Строка(ВидСубконтоСкладыВСчТоварыНаСкладах.НомерСтроки);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	Возврат стрСубконто;
	
КонецФункции // ПолучитьСубконтоПоСкладам()

// sk_190722 Функция добавлена в рамках (MOD-523)
// Добавляет ставку ндс в структуру атрибутов табличной части
//
// Параметры: 
// 	 СтррАтрибуты - Структура - структура табличной части
//	 УчитыватьНДС - Булево - признак учета НДС
// 	 
//
Процедура ДобавитьСтавкуНДСВСтруктуруАтрибутовТЧ(СтррАтрибуты, УчитыватьНДС = Ложь)
	
	Если Не СтррАтрибуты.Свойство("Номенклатура") Тогда
		Возврат;
	КонецЕсли;
	
	текНоменклатура = СтррАтрибуты.Номенклатура; 
	
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		текБезНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("без НДС");
		текСтавкаНДС = ?(УчитыватьНДС, текНоменклатура.СтавкаНДС, текБезНДС);
	Иначе		
		текБезНДС = Перечисления.СтавкиНДС.БезНДС;
		
		Если ПоколениеКонфигурации(">=Бухгалтерия_3.0.67.38") Тогда
			текСтавкаНДС = ?(УчитыватьНДС, Справочники.Номенклатура.СтавкаНДС(текНоменклатура), текБезНДС);
		Иначе
			текСтавкаНДС = ?(УчитыватьНДС, текНоменклатура.СтавкаНДС, текБезНДС);
		КонецЕсли;
	КонецЕсли;
	
	СтррАтрибуты.Вставить("СтавкаНДС", текСтавкаНДС); 
	
КонецПроцедуры

#Область ВыводСообщений

Функция ВывестиИнформацию(СтррИнформация)

	// Заносим в журнал только ошибки
	Если Найти(СтррИнформация.ТипСобытия, "Ошибка") <> 0 Тогда
		Текст = ?(ЗначениеЗаполнено(СтррИнформация.Агент), СокрЛП(СтррИнформация.Агент) + ": ", "") + СтррИнформация.ТекстСообщения;
		ЗаписьЖурналаРегистрации(СтррИнформация.ТипСобытия, УровеньЖурналаРегистрации.Ошибка, Неопределено, СтррИнформация.СсылкаНаОбъект, Текст);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтррИнформация.ТекстСообщения);

КонецФункции 

Функция ОповеститьОСобытии(Текст, ТипСобытия = "АПИнформация", СсылкаНаОбъект = Неопределено, Агент = Неопределено)
	
	ТекстСообщения = Текст;
	Если Агент = "ТекущийАгент" Тогда
		Агент = ВыбНастройкиАгента.Пользователь;
	ИначеЕсли Агент = "ТекущийАгентСообщить" Тогда
		Агент = ВыбНастройкиАгента.Пользователь;
		ТекстСообщения = "Агент " + Строка(Агент) + ": " + Текст;
	ИначеЕсли ТипЗнч(Агент) = Тип("Строка") Тогда
		ВызватьИсключение("Функция ОповеститьОСобытии() - неизвестное значение параметра Агент = " + Агент);
	КонецЕсли;
	
	СтррИнформация = Новый Структура("ТекстСообщения,ТипСобытия,СсылкаНаОбъект,Агент", ТекстСообщения, ТипСобытия, СсылкаНаОбъект, Агент);
	ВывестиИнформацию(СтррИнформация);

КонецФункции 

Процедура ВывестиСообщение(СтррРезультат, Текст, ЕстьОшибки = Неопределено)
	
	СтррСообщение = Новый Структура("Описание", Текст);
	СтррРезультат.Сообщения.Добавить(СтррСообщение);
	Если ЕстьОшибки <> Неопределено Тогда
		СтррРезультат.ЕстьОшибки = ЕстьОшибки;
	КонецЕсли;
	
КонецПроцедуры

// ВыводСообщений
#КонецОбласти 

#Область ИдентификаторыПеречислений

Функция ПолучитьЗначениеПеречисленияПоИдентификатору(ВидПеречисления, Идентификатор)
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда 	//++{20.01.17
		Возврат Неопределено;
	КонецЕсли; 										//++}

	ПопыткаСоздатьТаблицыПеречислений();
	
	СтрокаТ = гТаблицыПеречислений[ВидПеречисления].Найти(НРег(Идентификатор), "Идентификатор");
	Если СтрокаТ = Неопределено Тогда
		ВызватьИсключение("Функция ПолучитьЗначениеПеречисленияПоИдентификатору(), неизвестный Идентификатор = " + Идентификатор);
	КонецЕсли;
	
	Возврат СтрокаТ.Значение;
	
КонецФункции

Функция ПолучитьИдентификаторПеречисленияПоЗначению(ВидПеречисления, Значение)

	ПопыткаСоздатьТаблицыПеречислений();
	
	СтрокаТ = гТаблицыПеречислений[ВидПеречисления].Найти(Значение, "Значение");
	Если СтрокаТ = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат СтрокаТ.Идентификатор;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьЗначениеПеречисления(ТЗ, Идентификатор, Значение)
	
	СтрокаТ = ТЗ.Добавить();
	СтрокаТ.Идентификатор = Идентификатор;
	СтрокаТ.Значение 	  = Значение;
	
КонецПроцедуры

Процедура ПопыткаСоздатьТаблицыПеречислений()
	
	Если гТаблицыПеречислений <> Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	гТаблицыПеречислений = Новый Структура("ТипыКонтактнойИнформации,ФормыОплаты");
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки());
		
	Для Каждого Элемент Из гТаблицыПеречислений Цикл
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Идентификатор", ОписаниеТипаСтрока); //идентификатор значения перечисления в МТ
		ТЗ.Колонки.Добавить("Значение"); 						  //значение перечисления в УТ
		гТаблицыПеречислений[Элемент.Ключ] = ТЗ;
	КонецЦикла;
	
	ТЗ = гТаблицыПеречислений.ТипыКонтактнойИнформации;
	ДобавитьЗначениеПеречисления(ТЗ, "a4d0f540-64ed-4f3e-b2bb-818da38f5ab2", Перечисления.ТипыКонтактнойИнформации.Адрес);
	ДобавитьЗначениеПеречисления(ТЗ, "52477200-af54-405b-9888-14b8bded0e19", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ДобавитьЗначениеПеречисления(ТЗ, "2c2cfc86-e2a0-414d-a116-5acadac53437", Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	ДобавитьЗначениеПеречисления(ТЗ, "e45419b3-0cfd-47ce-8b24-7037a1e86aed", Перечисления.ТипыКонтактнойИнформации.Другое);
	ДобавитьЗначениеПеречисления(ТЗ, "8fc8f351-14f0-48eb-952a-38bb313b28d5", Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	// Для видов оплаты использованы случайные идентификаторы, т.к. в мобильном приложении это справочник.
	// Это же соответствие используется при выгрузке видов оплат в мобильное приложение в процедуре "Выгрузка дополнительной информации"
	ТЗ = гТаблицыПеречислений.ФормыОплаты;
	ДобавитьЗначениеПеречисления(ТЗ, "4a73372b-48e3-4874-8b87-b964d5782e25", Перечисления.ФормыОплаты.Наличная);
	ДобавитьЗначениеПеречисления(ТЗ, "7e6a8955-0b5b-4a3d-9446-acce667ed741", Перечисления.ФормыОплаты.Безналичная);
	ДобавитьЗначениеПеречисления(ТЗ, "f2cf11e4-d6cc-4986-a5a2-0a440301876c", Перечисления.ФормыОплаты.Взаимозачет);
	ДобавитьЗначениеПеречисления(ТЗ, "bd9e3958-1e52-4d37-9685-6083e249702f", Перечисления.ФормыОплаты.ПлатежнаяКарта);
	
КонецПроцедуры

// ИдентификаторыПеречислений
#КонецОбласти 

#Область ИдентификаторыВидовСправочниковИДокументов

//dm_171012:Внесены изменения

// Процедура создает таблицы соответствия видов документов и справочников между МТ и УТ.
// Таблицы соответствий используются в процедурах ПолучитьВсеВидыОбъектовДляМУ(), ПолучитьВсеВидыОбъектовДля1С(), ВидОбъектаПоИдентификатору()...
Процедура ПопыткаСоздатьТаблицыВидовОбъектов()

	Если гТаблицыВидовОбъектов <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	стррТаблицы = Новый Структура("Документ,Справочник");
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки());
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	ОписаниеТипаИдентификатор = Новый ОписаниеТипов("УникальныйИдентификатор"); // sd_24082017
		
	Для Каждого Элемент Из стррТаблицы Цикл
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("ВидДляМТ",  	 ОписаниеТипаСтрока); //вид документа/справочника в МТ	
		ТЗ.Колонки.Добавить("Представление", ОписаниеТипаСтрока); //представление вида документа/справочника в МТ		
		ТЗ.Колонки.Добавить("Вид",  		 ОписаниеТипаСтрока); //вид документа/справочника в УТ
		ТЗ.Колонки.Добавить("ИдентификаторВида", 	ОписаниеТипаИдентификатор); // sd_24082017 //идентификатор вида документа/справочника в МТ // gi_170902 - изменено название колокни с "Идентификатор" на "ИдентификаторВида"
		ТЗ.Колонки.Добавить("ИнтерактивноОчищать", 	ОписаниеТипаБулево); //признак интерактивного выбора флага "Очищать перед загрузкой"
		стррТаблицы[Элемент.Ключ] = ТЗ;
	КонецЦикла;
	
	ТЗ = стррТаблицы.Документ; // виды документов в МТ
	//dm_171012:Изменены названия документов для 1С
	//ЗаказКлиента => СчетНаОплатуПокупателю
	//ВозвратТоваровОтКлиента => ВозвратТоваровОтПокупателя
	ДобавитьСвойстваВидаОбъекта(ТЗ, "Заказ",, 			"СчетНаОплатуПокупателю", 		   "e01e1f5c-d6e4-46e8-b923-3758b0d79bde");
	ДобавитьСвойстваВидаОбъекта(ТЗ, "ПКО",, 			"ПриходныйКассовыйОрдер",  "749be2e0-9b00-4d7b-9d4d-88ca53327511");
	ДобавитьСвойстваВидаОбъекта(ТЗ, "РКО",, 			"РасходныйКассовыйОрдер",  "3890d435-96ba-4481-abc0-23782e15b32f");
	ДобавитьСвойстваВидаОбъекта(ТЗ, "Реализация",,		"РеализацияТоваровУслуг",  "7ffb418c-73c9-4883-91c5-827fa5145a3a");
	ДобавитьСвойстваВидаОбъекта(ТЗ, "Перемещение",,		"ПеремещениеТоваров",	   "77525c87-cb2f-405e-a92e-6f373edeece7"); // sd_22082017
	ДобавитьСвойстваВидаОбъекта(ТЗ, "ВозвратТоваров", 	"Возврат товаров", "ВозвратТоваровОтПокупателя", "4971b041-beab-4fa6-b1e8-10138f04fe44");
	ДобавитьСвойстваВидаОбъекта(ТЗ, "Посещение",, 		"*Посещение",  			   "9f147c59-5ee8-4550-8289-12ecfe5d0617"); // знак "*" - признак виртуального документа (аналогичный вид документа в 1С отсутствует)
	ДобавитьСвойстваВидаОбъекта(ТЗ, "Мерчендайзинг",, 	"*Мерчендайзинг",  		   "61dee5fe-d0a8-4842-a6af-a8d33f298845"); // знак "*" - признак виртуального документа (аналогичный вид документа в 1С отсутствует)
	ДобавитьСвойстваВидаОбъекта(ТЗ, "Долг",, 			"*Взаиморасчеты",		   "a93aadfa-2a35-40fe-b88a-3768825cdd31", Ложь); // знак "*" - признак виртуального документа (аналогичный вид документа в 1С отсутствует)
	ДобавитьСвойстваВидаОбъекта(ТЗ, "Маршрут",, 		"*Маршрут",		   		   "43920fa1-745d-4499-84af-7000672ceeff", Ложь); // знак "*" - признак виртуального документа (аналогичный вид документа в 1С отсутствует)
	ДобавитьСвойстваВидаОбъекта(ТЗ, "ВнеплановыйМаршрут",,"*ВнеплановыйМаршрут",   "27205d6e-e956-4c06-aa21-9b573f5d752f", Ложь); // знак "*" - признак виртуального документа (аналогичный вид документа в 1С отсутствует)
	//{{dm_180528
	ДобавитьСвойстваВидаОбъекта(ТЗ, "Поступление", 	"Поступление товаров", "ПоступлениеТоваровУслуг", "c9850d61-bc15-445a-8b1a-e328cc45ddae");
	//}}dm_180528

	ТЗ = стррТаблицы.Справочник; // виды справочников в МТ
	//dm_171012:Изменены названия справочников для 1С
	//ВидыЦен => ТипыЦенНоменклатуры
	//СоглашенияСКлиентами => ДоговорыКонтрагентов
	//ХарактеристикиНоменклатуры => Х (нет такого)
	//ЕдиницыИзмерения => КлассификаторЕдиницИзмерения
	//Партнеры => Контрагенты
	//КонтактныеЛицаПартнеров => КонтактныеЛица
	ДобавитьСвойстваВидаОбъекта(ТЗ, "Организации",,,									"0e3cbaea-5467-45cd-8c86-fb1777da435b");
	ДобавитьСвойстваВидаОбъекта(ТЗ, "ТипыЦен","Типы цен","ТипыЦенНоменклатуры", 					"00f1ffe7-e16e-4ff4-9ef1-b8d0c54bdf59");
	ДобавитьСвойстваВидаОбъекта(ТЗ, "Склады",,, 										"2516ffce-f46f-4326-be00-438ef0871d30");
	ДобавитьСвойстваВидаОбъекта(ТЗ, "Договоры",,"ДоговорыКонтрагентов",					"735a9ce5-dcc1-4d1a-8f8d-643a50a6befc"); // sd_10082017 переименовал видспр для 1С СоглашенияСКлиентами
	ДобавитьСвойстваВидаОбъекта(ТЗ, "Номенклатура",,, 									"d6d52ada-0f38-4112-af3c-2f1e425a43d1");
	//ДобавитьСвойстваВидаОбъекта(ТЗ, "ХарактеристикиНоменклатуры", "Характеристики номенклатуры",, 	"cc552c31-f7de-4259-a6e3-66ef765d3b43");
	ДобавитьСвойстваВидаОбъекта(ТЗ, "ЕдиницыИзмерения","Единицы измерения","КлассификаторЕдиницИзмерения",	"80452c60-b442-4da9-a048-42f63270ca14");
	ДобавитьСвойстваВидаОбъекта(ТЗ, "КатегорииДокументов","Категории документов", "*", 	"f997f837-8721-4896-8fe8-3497c6c38206"); // знак "*" в параметре Вид - признак отсутствующего аналогичного справочника в УТ
	ДобавитьСвойстваВидаОбъекта(ТЗ, "СтатусыКонтрагентов","Статусы контрагентов", "*", 	"74046d94-b25d-4f3a-b553-27b7fdd3c60c"); 
	ДобавитьСвойстваВидаОбъекта(ТЗ, "Запросы",,"*", 									"cc458719-5078-4dc8-9a0c-fa19e3904f39"); 
	ДобавитьСвойстваВидаОбъекта(ТЗ, "ИсторияПродаж","История продаж","*", 				"af9faa26-9638-41c5-bfce-9514e670ef2e", Ложь); 
	//ДобавитьСвойстваВидаОбъекта(ТЗ, "ТорговыеТочки","Торговые точки","Контрагенты",		"d3dbb02e-681e-4fc2-ad0e-8ef1234e9f48");
	ДобавитьСвойстваВидаОбъекта(ТЗ, "Контрагенты",,"Контрагенты",							"9450980f-fb59-47e3-bae2-aa3c58441b1a");
	ДобавитьСвойстваВидаОбъекта(ТЗ, "КонтактныеЛица","Контактные лица","КонтактныеЛица", 	"cf387a58-4655-41b5-a460-85884d1f20d0");
	//ДобавитьСвойстваВидаОбъекта(ТЗ, "КонтактнаяИнформация","Контактная информация","Партнеры.КонтактнаяИнформация",	"85b62882-0156-4881-85ba-b8fef05c867b");
	ДобавитьСвойстваВидаОбъекта(ТЗ, "КонтактнаяИнформация","Контактная информация","ВидыКонтактнойИнформации",	"85b62882-0156-4881-85ba-b8fef05c867b"); // sd_10082017 для загрузки в УТ имя спр ВидыКонтактнойИнформации, загружаются отдельно
	ДобавитьСвойстваВидаОбъекта(ТЗ, "ВидыКонтактнойИнформации","Виды контактной информации",, 		"564e0eca-c498-4d28-83d7-4bdeaec558e2"); // sd_10082017 для выгрузки в МТ
	ДобавитьСвойстваВидаОбъекта(ТЗ, "ФотоСправочников","Фото справочников","*",			"e01cf3a3-6765-4fd3-801c-ccdbf85c78fc");
	ДобавитьСвойстваВидаОбъекта(тз, "ФотоДокументов","Фото документов","*",				"05ea7926-febb-4d82-97fc-19294dd5dd29"); // gi_180414 - для загрузки фотографий из МУ
	ДобавитьСвойстваВидаОбъекта(ТЗ, "ПечатныеФормыДокументов",,,						"17b09c65-5b6c-40d1-8616-3a655b99da8d", Ложь); // sd_10082017
	ДобавитьСвойстваВидаОбъекта(ТЗ, "ПечатныеФормыОрганизаций",,,						"c7b2883c-d872-4d19-8b32-e7cefaaceaca", Ложь); // sd_10082017
	ДобавитьСвойстваВидаОбъекта(ТЗ, "НастройкиОбмена",,,								"b20a258f-ffb6-49b4-b0fd-9853760cf70c", Ложь); // sd_10082017
	
	гТаблицыВидовОбъектов = стррТаблицы;
	
КонецПроцедуры

// Фунция возвращает вид объекта в УТ 11 в соответствии с идентификатором вида объекта в МТ.
//
// Параметры:
//	ИдентификаторВида - УникальныйИдентификатор - (GUID) идентификатор вида документа в МТ. // gi_170902: изменен тип из "Строка" на "УникальныйИдентификатор".
//	Для1С		  	- Булево - Указывается для какой системы необходимо определить вид объекта, если значение Ложь то будет возвращен вид объекта для МТ.
//	КорневойВид   	- Строка - К какому типу метаданных принадлежит идентификатор вида объекта в МТ, "Справочник" или "Документ".
//	
Функция ВидОбъектаПоИдентификатору(ИдентификаторВида, Для1С = Истина, КорневойВид = "Справочник") Экспорт // sd_20082017 Добавил описание параметров и третий входящий параметр
	
	СвойстваВида = СвойстваВидаОбъекта(ИдентификаторВида, "ИдентификаторВида", КорневойВид); // sd_24082017 (ИдентификаторВида); // sd_24082017 // gi_170902 изменено значение параметра с "Идентификатор" на "ИдентификаторВида"
	Если СвойстваВида <> Неопределено Тогда
		СвойстваВида = ?(Для1С, СвойстваВида.Вид, СвойстваВида.ВидДляМТ);
	КонецЕсли;
	
	Возврат СвойстваВида;
	
КонецФункции

// Функция вовзращает представдение вида Документа или Справочника для указания в комментарии в файле выгрузки
//
// Параметры:
//	КорневойВид - Строка - значения "Документ" или "Справочник".
//	СвойстваВида - СтрокаТаблицыЗначений - строка ТЗ объекта гТаблицыВидовОбъектов.Документ или гТаблицыВидовОбъектов.Справочник.
//
Функция ПредставлениеВида(КорневойВид, СвойстваВида)
	
	Результат = КорневойВид + "." + СвойстваВида.ВидДляМТ;
	Если СвойстваВида.ВидДляМТ <> СвойстваВида.Вид Тогда
		Результат = Результат + " (" + СвойстваВида.Вид + ")";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Фунция возвращает строку ТЗ гТаблицыВидовОбъектов.Документ или гТаблицыВидовОбъектов.Справочник, 
// найдя ее по заданным значению и имени колонки.
//
// Параметры:
//	Значение - Строка, УникальныйИдентификатор - искомое значение.
//	Имя - Строка - название свойства (колонки) таблицы для поиска значения.
//	КорневойВид - Строка - значения Неопределено, или "Документ", или "Справочник". 
//						   Если указано Неопределено, то в параметре возвращается строка "Документ" или "Справочник".
//	
Функция СвойстваВидаОбъекта(Значение, Имя, КорневойВид = Неопределено)
	
	ПопыткаСоздатьТаблицыВидовОбъектов();
	
	Если КорневойВид = Неопределено Тогда // Значит в параметре Значение передана строка вида "Документ.X" или "Справочник.X"
		Поз = Найти(Значение, ".");
		Если Поз <> 0 Тогда
			КорневойВид 	= Лев(Значение, Поз-1);
			ИскатьЗначение 	= Сред(Значение, Поз+1);
		КонецЕсли;
	Иначе 							// Значит в параметре КорневойВид передана строка "Документ" или "Справочник",
		ИскатьЗначение = Значение; 	// а в параметре Значение - название вида документа или справочника.
	КонецЕсли;
		
	Если КорневойВид <> "Справочник" И КорневойВид <> "Документ" Тогда
		ВызватьИсключение("Процедура СвойстваВидаОбъекта() - неверный параметр Значение = " + Значение + " - "
			+ Символы.ПС + "Значение должно начинаться с ""Документ."" или ""Справочник.""!");
	КонецЕсли;
	
	// sd_25082017 Перенес условие ниже, чтобы не перезаписывалось значение перем "ИскатьЗначение", когда передается другое значение.
	Если Имя = "ИдентификаторВида" Тогда // в колонке "ИдентификаторВида" хранятся значения типа УникальныйИдентификатор // gi_170902 изменено значение переменной с "Идентификатор" на "ИдентификаторВида"
		ИскатьЗначение = ?(ТипЗнч(Значение) = Тип("Строка"), Новый УникальныйИдентификатор(Значение), Значение);
	КонецЕсли;
	
	СтрокаТ = гТаблицыВидовОбъектов[КорневойВид].Найти(ИскатьЗначение, Имя);
	Если СтрокаТ = Неопределено Тогда
		ВызватьИсключение("Функция СвойстваВидаОбъекта(), неизвестное Значение = " + Значение);
	КонецЕсли;
	
	Возврат СтрокаТ;	
	
КонецФункции

// Процедура добавляет свойства в таблицу соответствия видов документов и справочников между МТ и УТ.
//
// Параметры:
//	ТЗ 					- Таблица значений 	- таблица соответствий для документов или справочников.
//	ВидДляМТ			- Строка			- вид справочника/документа в МТ.
//	ПредставлениеДляМТ  - Строка			- представление справочника/документа в МТ.
//	Вид					- Строка			- вид справочника/документа в УТ.
//	Идентификатор		- Строка			- уникальный идентификатор справочника/документа в МТ.
//	ИнтерактивноОчищать	- Булево			- признак интерактивного выбора флага "Очищать перед загрузкой". 
//
Процедура ДобавитьСвойстваВидаОбъекта(ТЗ, ВидДляМТ, ПредставлениеДляМТ = "", Вид = "", ИдентификаторВида, ИнтерактивноОчищать = Истина)
	
	СтрокаТ = ТЗ.Добавить();
	СтрокаТ.ВидДляМТ 	  = ВидДляМТ;
	СтрокаТ.Представление = ?(ПредставлениеДляМТ = "", ВидДляМТ, ПредставлениеДляМТ);	
	//СтрокаТ.Вид 		  = ?(Вид = "", ВидДляМТ, Вид);
	Если Вид = "" Тогда
		СтрокаТ.Вид = ВидДляМТ;
	ИначеЕсли Вид = "*" Или Вид = "_" Тогда
		СтрокаТ.Вид = Вид + ВидДляМТ;
	Иначе
		СтрокаТ.Вид = Вид;
	КонецЕсли;
	СтрокаТ.ИдентификаторВида 	= Новый УникальныйИдентификатор(ИдентификаторВида); // sd_24082017 // gi_170902 изменено название свойства с "Идентификатор" на "ИдентификаторВида"
	СтрокаТ.ИнтерактивноОчищать = ИнтерактивноОчищать;
	
КонецПроцедуры

Функция ПолучитьВсеВидыОбъектовДляМУ(КорневойВид, ИнтерактивноОчищать = Неопределено) Экспорт
	
	ПопыткаСоздатьТаблицыВидовОбъектов();
	
	Список = Новый СписокЗначений;	
	ТЗ = гТаблицыВидовОбъектов[КорневойВид];
	Для Каждого СтрокаТ Из ТЗ Цикл
		Если ИнтерактивноОчищать = Неопределено Или ИнтерактивноОчищать = СтрокаТ.ИнтерактивноОчищать Тогда
			Список.Добавить(СтрокаТ.ВидДляМТ, СтрокаТ.Представление);
		КонецЕсли; 
	КонецЦикла;

	Возврат Список;
	
КонецФункции

Функция ПолучитьВсеВидыОбъектовДля1C(КорневойВид) Экспорт
	
	ПопыткаСоздатьТаблицыВидовОбъектов();
	
	Список = Новый СписокЗначений;	
	ТЗ = гТаблицыВидовОбъектов[КорневойВид];
	Для Каждого СтрокаТ Из ТЗ Цикл
		Если Лев(СтрокаТ.Вид, 1) <> "*" Тогда
			Список.Добавить(СтрокаТ.Вид, СтрокаТ.Представление);
		КонецЕсли;
	КонецЦикла;

	Возврат Список;
	
КонецФункции

Функция ВидДокументаПоступлениеТоваровУслуг() Экспорт

	Если гВидДокументаПоступлениеТоваровУслуг = Неопределено Тогда
		Если Метаданные.Документы.Найти("ПоступлениеТоваровУслуг") <> Неопределено Тогда
		    гВидДокументаПоступлениеТоваровУслуг = "ПоступлениеТоваровУслуг";
		ИначеЕсли Метаданные.Документы.Найти("ПриобретениеТоваровУслуг") <> Неопределено Тогда
			гВидДокументаПоступлениеТоваровУслуг = "ПриобретениеТоваровУслуг";
		Иначе
			Текст = СтрШаблон_("Для текущей конфигурации ""%1"" не удалось определить вид документа ""ПоступлениеТоваровУслуг"".", Метаданные.Синоним);
			ВызватьИсключение(Текст);
		КонецЕсли; 
	КонецЕсли; 

	Возврат гВидДокументаПоступлениеТоваровУслуг;

КонецФункции 

// ИдентификаторыВидовСправочниковИДокументов
#КонецОбласти

#Область СоответствияКонстант_МТ_УД

Функция КонстантыМТПолучитьСоответствие()

	ствРезультат = Новый Соответствие; // GUID считываемых констант и их названия
	ствРезультат.Вставить("79c698db-3c55-465e-acfe-4741acdd5655", "АгентЗагрузки");
	ствРезультат.Вставить("cf41ba05-a4ee-4492-9a2c-c96394c4864a", "КодЗапроса");
	
	Возврат ствРезультат;
	
КонецФункции 

Функция КонстантыМТПолучитьGUID(ИмяКонстанты)

	ствКонстанты = КонстантыМТПолучитьСоответствие();
	Элемент = НайтиПоЗначению(ствКонстанты, "АгентЗагрузки");
	Если Элемент = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Элемент.Ключ;
	КонецЕсли; 

КонецФункции 

// СоответствияКонстант_МТ_УД
#КонецОбласти

#Область ВиртуальныеОбъекты
// Виртуальные объекты (ВО)  - это виртуальные документы и виртуалные справочники.

#Область ВиртуальныеОбъекты_Надстройка
// Функции в области - надстройка над виртуальными документами и виртуальными справочниками - класс-обертка.
// Любая функция/процедура модуля применима и к виртуальному документу и к виртуальному справочнику.

#Область ВиртуальныеОбъекты_Надстройка_Форма

// Процедура дополняет контекст формы виртуального объекта (формы списка и формы элемента - справочника, документа).
// Параметры:
// 		СтррКонтекст - Структура - структура СтррКонтекст - реквизит формы.
// 		ВидОбъекта - Строка - вид виртуального объекта.
// 		ДляФормыСписка - Булево - контекст для формы списка (Истина) или для формы элемента (Ложь).
//
Процедура ВОКонтекстФормыДополнить(СтррКонтекст, ВидОбъекта, ДляФормыСписка) Экспорт
	
	стррВО = ВОСвойстваОбъекта(ВидОбъекта);
	
	СтррКонтекст.Вставить("ВО", стррВО); // ссылка на системные свойства виртуального объекта
	СтррКонтекст.Вставить("КодыИконок", ВОТЗИконкиСтатуса(стррВО));
	СтррКонтекст.Вставить("ЭтоФормаСписка", ДляФормыСписка);
	
	//СтррКонтекст.Вставить("СпрТоргТочки"); // KT2000_Alcohol_Trade признаки для получения свойств конфигурации и торговых точек	
	
	Если стррВО.КорневойВид = "Документ" Тогда
		ВДокКонтекстФормыДополнить(СтррКонтекст);
	ИначеЕсли стррВО.КорневойВид = "Справочник" Тогда
		ВСпрКонтекстФормыДополнить(СтррКонтекст);
	Иначе
		ВызватьИсключение("Процедура ВОКонтекстФормыДополнить() - неизвестное значение свойства КорневойВид = " + стррВО.КорневойВид);
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывается при создании формы элемента виртуального объекта.
// Должна вызываться после вызова ПрочестьОбъектИзХранилища() и ВОКонтекстФормыДополнить().
Процедура ВОПриСозданииФормыЭлемента(Модуль) Экспорт
	
	Параметры    = Модуль.Параметры;
	СтррКонтекст = Модуль.СтррКонтекст;
	
	Если Параметры.Свойство("Статус") Тогда
		Модуль.Статус = Параметры.Статус;
	ИначеЕсли Параметры.Свойство("Проведен") И Параметры.Свойство("ПометкаУдаления") Тогда
		Если Параметры.Проведен Тогда
			Модуль.Статус = СтррКонтекст.КодыИконок.Проведен;
		ИначеЕсли Параметры.ПометкаУдаления Тогда
			Модуль.Статус = СтррКонтекст.КодыИконок.Помечен;
		Иначе
			Модуль.Статус = СтррКонтекст.КодыИконок.Записан;
		КонецЕсли; 
	Иначе // нужно прочитать статус элемента из ТЗ элементов
		СтрокаТ = ВОТЗПолучитьСтроку(СтррКонтекст.ВО, Модуль.ID);
		Модуль.Статус = ?(СтрокаТ <> Неопределено, СтрокаТ.Статус, СтррКонтекст.КодыИконок.Записан);
	КонецЕсли; 
	
	Если Параметры.Свойство("Копирование") И Параметры.Копирование Тогда // форма открыта для копирования существующего документа, очищаем его идентификатор
		Модуль.ID = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		ДобавитьВСтрокуНомерКопии(Модуль.Комментарий);
	КонецЕсли;

КонецПроцедуры

// Процедура вызывается при создании формы элемента виртуального объекта.
// Должна вызываться после ПрочестьОбъектИзХранилища() и ВОКонтекстФормыДополнить().
Процедура ВОПриСозданииФормыСписка(Модуль) Экспорт
	
	Параметры    = Модуль.Параметры;
	СтррКонтекст = Модуль.СтррКонтекст;
	
	СтррКонтекст.Вставить("ДляВыбора", Параметры.Свойство("ДляВыбора") И (Параметры.ДляВыбора = Истина));
	
	Если СтррКонтекст.ДляВыбора Тогда
		Модуль.Элементы.ТПЭлементы.РежимВыбора 		  = Истина;
		Модуль.Элементы.ТПЭлементы.МножественныйВыбор = Истина;
		Модуль.Элементы.ТПЭлементы.ТолькоПросмотр 	  = Истина;
		Модуль.ЭтаФорма.РежимОткрытияОкна 			  = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;	
		СтррКонтекст.Вставить("ID", Параметры.ID);
	КонецЕсли; 

КонецПроцедуры

// ВиртуальныеОбъекты_Надстройка_Форма
#КонецОбласти

#Область ВиртуальныеОбъекты_Надстройка_СистемныеСвойства

// Функция вовзвращает структуру с системными свойствами для всех виртуальных объектов.
Функция ВОПолучитьВсеСвойства() Экспорт

	стррРезультат = Новый Структура("*РезультатыПосещений,*ШаблоныАнкет,*Мерчендайзинг,*Посещение");
	Для каждого Элемент Из стррРезультат Цикл
		стррРезультат[Элемент.Ключ] = ВОСвойстваОбъекта(Элемент.Ключ);
	КонецЦикла; 
	
	Возврат стррРезультат;
	
КонецФункции

// Функция возвращает системные свойства виртуального объекта (документа, справочника).
// Для ускорения - результат кэшируется.
// Параметры: 
// 	 ВидОбъекта - Строка - вид виртуального объекта (документа или справочника).
// 	 
// Возвращаемое значение:
//   Структура  - системные свойства виртуального объекта.
// 	 
Функция ВОСвойстваОбъекта(ВидОбъекта)

	Если гВОКэшСвойств = Неопределено Тогда // кэш сисиемных свойств виртуальных объектов
		гВОКэшСвойств = Новый Соответствие;
	КонецЕсли;
	
	стррРезультат = гВОКэшСвойств.Получить(ВидОбъекта);
	Если стррРезультат <> Неопределено Тогда
		Возврат стррРезультат;
	КонецЕсли; 
	
	стррРезультат = Новый Структура("ВидОбъекта,КорневойВид,РеквизитОбработки,Префикс,МаксКоличество,ФормаЭлемента");
	
	стррРезультат.ВидОбъекта = ВидОбъекта;
	
		// виртуальные справочники
	Если ВидОбъекта = "*РезультатыПосещений" Тогда
		
		стррРезультат.КорневойВид 		= "Справочник";
		стррРезультат.РеквизитОбработки = "СправочникРезультатыПосещений";
		стррРезультат.Префикс			= "СпрРезП"; // префикс для сохранения элементов справочника в процедурах СД... 
		стррРезультат.ФормаЭлемента		= "ЭлементСправочникаРезультатыПосещений";
		
	ИначеЕсли ВидОбъекта = "*ШаблоныАнкет" Тогда		
		
		стррРезультат.КорневойВид 		= "Справочник";
		стррРезультат.РеквизитОбработки = "СправочникШаблоныАнкет";
		стррРезультат.Префикс			= "СпрШблА"; // префикс для сохранения элементов справочника в процедурах СД... 
		стррРезультат.ФормаЭлемента		= "ЭлементСправочникаШаблоныАнкет";
		
		// виртуальные документы
	ИначеЕсли ВидОбъекта = "*Мерчендайзинг" Тогда
		
		стррРезультат.КорневойВид 		= "Документ";
		стррРезультат.РеквизитОбработки = "ДокументыМерчендайзинга";
		стррРезультат.Префикс			= "ДокМерч";
		стррРезультат.ФормаЭлемента		= "ДокументМерчендайзинг";
		// максимально допустимое количество документов в ТЗ списка документов:
		стррРезультат.МаксКоличество	= ПрочитатьЗначениеНастройкиПоУмолчанию("МаксКоличествоВиртуальныхДокументов", 1000); 
		
	ИначеЕсли ВидОбъекта = "*Посещение" Тогда
		
		стррРезультат.КорневойВид 		= "Документ";		
		стррРезультат.РеквизитОбработки = "ДокументыПосещений";
		стррРезультат.Префикс			= "ДокПсщ";
		стррРезультат.ФормаЭлемента		= "ДокументПосещение";
		// максимально допустимое количество документов в ТЗ списка документов:
		стррРезультат.МаксКоличество	= ПрочитатьЗначениеНастройкиПоУмолчанию("МаксКоличествоВиртуальныхДокументов", 1000); 
		
	Иначе
		ВызватьИсключение("Функция ВОСвойстваОбъекта(): неизвестное значение параметра ВидОбъекта - " + ВидОбъекта);
	КонецЕсли; 
	
	гВОКэшСвойств.Вставить(ВидОбъекта, стррРезультат);
	
	Возврат стррРезультат;

КонецФункции 

// ВиртуальныеОбъекты_Надстройка_СистемныеСвойства
#КонецОбласти

#Область ВиртуальныеОбъекты_Надстройка_ТЗ_Списка_Объектов

// Функция загружает таблицу значений виртуальных объектов из хранилища (аналог - список объектов, отображаемый в форме списка справочников или документов).
// Параметры: 
// 	 Параметр - Строка, Структура - вид объекта (строка) или его системные свойства (Струкутра).
// 	 ИспользоватьКэш - Булево - использовать кэш для прочитанных ранее результатов вызова функции.
// 	 
// Возвращаемое значение:
//   ТаблицаЗначений - таблица виртуальных объектов.
//
Функция ВОТЗЗагрузить(Параметр, ИспользоватьКэш = Ложь) Экспорт
	
	стррВО = ?(ТипЗнч(Параметр) = Тип("Структура"), Параметр, ВОСвойстваОбъекта(Параметр)); // системные свойства виртуального объекта
	
	тз = Неопределено;
	
	Если ИспользоватьКэш Тогда
		Если стррВО.КорневойВид = "Документ" Тогда
			Если гВДокКэшТЗЖурналов = Неопределено Тогда
				гВДокКэшТЗЖурналов = Новый Соответствие;
			КонецЕсли; 
			ствКэш = гВДокКэшТЗЖурналов;
		ИначеЕсли стррВО.КорневойВид = "Справочник" Тогда
			Если гВСпрКэшТЗСправочника = Неопределено Тогда
				гВСпрКэшТЗСправочника = Новый Соответствие;
			КонецЕсли; 
			ствКэш = гВСпрКэшТЗСправочника;
		Иначе
			ВызватьИсключение("Функция ВОТЗЗагрузить() - неизвестное значение свойства КорневойВид = " + стррВО.КорневойВид);
		КонецЕсли;
		тз = ствКэш.Получить(стррВО.ВидОбъекта);
	КонецЕсли; 
	
	Если тз = Неопределено Тогда
		тз = ПрочитатьЗначениеНастройки(стррВО.РеквизитОбработки);
		Если ТипЗнч(тз) <> Тип("ТаблицаЗначений") Тогда
			тз = ВОТЗСоздать(стррВО);
			ВОТЗСохранить(стррВО, тз);
		КонецЕсли;
		Если ИспользоватьКэш Тогда
			ствКэш.Вставить(стррВО.ВидОбъекта, тз);	
		КонецЕсли; 
	КонецЕсли; 
	
	ВОТЗСократить(стррВО, тз);
	
	Возврат тз;
	
КонецФункции

// Функция создает пустую таблицу значений виртуальных объектов (аналог - список объектов, отображаемый в форме списка справочников или документов).
// Параметры: 
// 	 стррВО - Структура - системные свойства виртуального объекта (результат вызова функции ВОСвойстваОбъекта()).
// 	 
// Возвращаемое значение:
//   ТаблицаЗначений - созданная таблица виртуальных объектов (объектов одного вида).
//
Функция ВОТЗСоздать(стррВО)
	
	Если стррВО.КорневойВид = "Документ" Тогда
		Возврат ВДокТЗСоздать(стррВО.ВидОбъекта);
	ИначеЕсли стррВО.КорневойВид = "Справочник" Тогда
		Возврат ВСпрТЗСоздать(стррВО.ВидОбъекта);
	Иначе
		ВызватьИсключение("Функция ВОСоздатьТЗ() - неизвестное значение свойства КорневойВид = " + стррВО.КорневойВид);
	КонецЕсли;

КонецФункции

// Процедура сохраняет таблицу значений виртуальных объектов в хранилище.
// Параметры: 
// 	 Параметр - Строка, Структура - вид объекта (строка) или его системные свойства (Струкутра).
// 	 тз - ТаблицаЗначений - таблица виртуальных объектов (объектов одного вида).
//
Процедура ВОТЗСохранить(Параметр, тз) Экспорт
	
	РеквизитОбработки = ?(ТипЗнч(Параметр) = Тип("Структура"), Параметр.РеквизитОбработки, ВОСвойстваОбъекта(Параметр).РеквизитОбработки);
	СохранитьЗначениеНастройки(РеквизитОбработки, тз);
	
КонецПроцедуры

// Процедура удаляет из хранилища лишние (устаревшие) элементы. 
// Параметры: 
// 	 стррВО - Структура - системные свойства виртуального объекта (результат вызова функции ВОСвойстваОбъекта()).
// 	 тз 	- ТаблицаЗначений - таблица элементов.
//
Процедура ВОТЗСократить(стррВО, тз)
	
	Если Не ЗначениеЗаполнено(стррВО.МаксКоличество) Тогда 
		Возврат;
	ИначеЕсли тз.Количество() <= стррВО.МаксКоличество Тогда 
		Возврат;
	КонецЕсли; 
	
	// нужно удалить устаревшие элементы
	Если стррВО.КорневойВид = "Документ" Тогда
		ВДокТЗСократить(стррВО, тз);
	Иначе // для справочников пока не предусмотрено удаление устаревших элементов
	КонецЕсли; 

КонецПроцедуры

// Функция находит строку в таблице элементов по идентификатору. 
// Параметры: 
// 	 стррВО - Структура - системные свойства виртуального объекта (результат вызова функции ВОСвойстваОбъекта()).
// 	 ID 	- УникальныйИдентификатор - идентификатор объекта.
// Возвращаемое значение: СтрокаТаблицыЗначений  - найденная по идентификатору строка таблицы значений.
// 
Функция ВОТЗПолучитьСтроку(стррВО, ID)
	
	тз = ВОТЗЗагрузить(стррВО, Истина);
	Возврат тз.Найти(ID, "ID");
	
КонецФункции

// Функция находит строку в таблице элементов виртуального объекта по идентификатору и возвращает значение реквизита (колонки) в найденой строке. 
// Параметры: 
// 	 тз - ТаблицаЗначений - таблица элементов виртуального объекта.
// 	 ID - УникальныйИдентификатор - идентификатор объекта.
//   ИмяРеквизита - Строка - название реквизита (колонки таблицы значений)
// Возвращаемое значение: Значение реквизита (колонки) если строка найдена или Неопределено, если строка не найдена.
// 
Функция ВОТЗПолучитьЗначениеРеквизита(ВидОбъекта, ID, ИмяРеквизита)
	
	тз = ВОТЗЗагрузить(ВидОбъекта, Истина);
	СтрокаТ = тз.Найти(ID, "ID");
	Если СтрокаТ = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат СтрокаТ[ИмяРеквизита];
	КонецЕсли; 
	
КонецФункции

// Функция возвращает коды иконок статуса элемента (виртуального объекта) для отображения на форме списка в первой колонке.
// Параметры: 
// 	 стррВО - Структура - системные свойства виртуального объекта (результат вызова функции ВОСвойстваОбъекта()).
// 	 
// Возвращаемое значение:
//   Число  - код иконки статуса элемента.
// 	 
Функция ВОТЗИконкиСтатуса(стррВО)

	Если стррВО.КорневойВид = "Справочник" Тогда
		стррРезультат = Новый Структура("Записан,Помечен", 3, 4);
	ИначеЕсли стррВО.КорневойВид = "Документ" Тогда
		стррРезультат = Новый Структура("Записан,Проведен,Помечен", 0, 1, 2);	
	Иначе
		ВызватьИсключение("Функция ВОИконкиСтатуса() - неизсвестное значение свойства КорневойВид = " + стррВО.КорневойВид);
	КонецЕсли; 
	
	Возврат стррРезультат;

КонецФункции 

// ВиртуальныеОбъекты_Надстройка_ТЗ_Списка_Объектов
#КонецОбласти 

#Область ВиртуальныеОбъекты_Надстройка_Элементы
// Элементы виртуальных объектов (для справочников - элементы справочника, для документов - документы)

// Сохранение виртуального объекта в хранилище значений (и самого объекта и обновление таблицы виртуальных объектов данного вида). 
// Параметры: 
// 	 стррВО - Структура - системные свойства виртуального объекта (результат вызова функции ВОСвойстваОбъекта()).
// 	 ID 	- УникальныйИдентификатор - идентификатор объекта.
// 	 стррОбъект - Структура - сохраняемый виртуальный объект.
//
Процедура ВОЭлементСохранить(стррВО, ID, стррОбъект) Экспорт

	// Этап 1. Сохранение самого элемента в хранилище.	
	СохранитьОбъектВХранилище(стррВО.Префикс, ID, стррОбъект);
	
	// Этап 2. Обновление в хранилище ТЗ списка элементов
	тз = ВОТЗЗагрузить(стррВО, Истина);
	
	СтрокаТ = тз.Найти(ID, "ID");
	Если СтрокаТ = Неопределено Тогда
		СтрокаТ = тз.Добавить();
		СтрокаТ.ID = ID;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаТ, стррОбъект);
	
	ВОТЗСохранить(стррВО, тз);

КонецПроцедуры

// Функция загружает виртуальный объект из хранилища.
// Параметры: 
// 	 стррВО - Структура - системные свойства виртуального объекта (результат вызова функции ВОСвойстваОбъекта()).
// 	 ID 	- УникальныйИдентификатор - идентификатор объекта.
// 	 
// Возвращаемое значение:
//   Структура  - виртуальный объект.
//
Функция ВОЭлементЗагрузить(стррВО, ID) Экспорт
	
	Возврат ПолучитьОбъектИзХранилища(стррВО.Префикс, ID);
	
КонецФункции 	

// Процедура удаляет виртуальные объекты из хранилища. Удаляются сами элементы 
// и обновляется таблица значений, ссылающиеся на элементы.
// Параметры: 
// 	 стррВО 		 - Структура - системные свойства виртуального объекта (результат вызова функции ВОСвойстваОбъекта()).
// 	 мИдентификаторы - Массив	 - массив значений типа УникальныйИдентификатор - идентификаторы удаляемых объектов.
// 	 ВключаяТЗ  	 - Булево    - удалять данные в т.ч. и в таблице значений.
//
Процедура ВОЭлементыУдалить(стррВО, мИдентификаторы, ВключаяТЗ = Истина) Экспорт
	
	УдалитьОбъектыИзХранилища(стррВО.Префикс, мИдентификаторы);
	
	Если ВключаяТЗ Тогда // нужно удалить записи из ТЗ списка элементов
		
		тз = ВОТЗЗагрузить(стррВО);
		Если ТипЗнч(тз) <> Тип("ТаблицаЗначений") Тогда
			Возврат;
		КонецЕсли; 
		
		Для каждого ИдОбъекта Из мИдентификаторы Цикл
			СтрокаТ = тз.Найти(ИдОбъекта, "ID");
			Если СтрокаТ <> Неопределено Тогда
				тз.Удалить(СтрокаТ);
			КонецЕсли;
		КонецЦикла; 
		
		ВОТЗСохранить(стррВО, тз); // записываем измененную таблицу
	
	КонецЕсли; 
	
КонецПроцедуры

// Процедура помечает на удаление виртуальные объекты в хранилище. 
// Параметры: 
// 	 стррВО 		 - Структура - системные свойства виртуального объекта (результат вызова функции ВОСвойстваОбъекта()).
// 	 мИдентификаторы - Массив	 - массив значений типа УникальныйИдентификатор - идентификаторы помечаемых на удаление объектов.
//
Процедура ВОЭлементыПометитьНаУдаление(стррВО, мИдентификаторы) Экспорт
	
	тз = ВОТЗЗагрузить(стррВО);
	Если ТипЗнч(тз) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли; 
	
	стррИконки = ВОТЗИконкиСтатуса(стррВО);
	СтатусПомечен = стррИконки.Помечен;
	СтатусЗаписан = стррИконки.Записан;
	
	Для каждого ИдОбъекта Из мИдентификаторы Цикл
		СтрокаТ = тз.Найти(ИдОбъекта, "ID");
		Если СтрокаТ <> Неопределено Тогда
			СтрокаТ.Статус = ?(СтрокаТ.Статус <> СтатусПомечен, СтатусПомечен, СтатусЗаписан);
		КонецЕсли;
	КонецЦикла; 
		
	// записываем измененную таблицу
	ВОТЗСохранить(стррВО, тз);
	
КонецПроцедуры

// ВиртуальныеОбъекты_Надстройка_Элементы
#КонецОбласти

// ВиртуальныеОбъекты_Надстройка
#КонецОбласти 

#Область ВиртуальныеОбъекты_Документы

// Функция возвращает представление виртуального документа в виде строки
Функция ВДокПредставление(ВидДокумента, стзЖурнала) Экспорт
	
	Возврат СвойстваВидаОбъекта(ВидДокумента, "Вид", "Документ").Представление 
		+ ?(ЗначениеЗаполнено(стзЖурнала.Номер), " " + СокрЛП(стзЖурнала.Номер), "") + " от " + стзЖурнала.Дата;
	
КонецФункции 

Функция ВДокЭтоВиртуальныйДокумент(ВидДокумента) Экспорт
	
	Возврат Лев(ВидДокумента, 1) = "*"; // названия вида виртуальных документов начинаются с "*"
		
КонецФункции

// Процедура дополняет контекст формы виртуального документа (формы списка и формы документа).
// Параметры:
// 		СтррКонтекст - Структура - структура СтррКонтекст - реквизит формы.
// 		ДляФормыСписка - Булево - контекст для формы списка (Истина) или для формы элемента (Ложь).
//
Процедура ВДокКонтекстФормыДополнить(СтррКонтекст)

	Если СтррКонтекст.ЭтоФормаСписка Тогда // процедура вызвана для формы списка документов
		//СтррКонтекст.Вставить("РедактироватьРеквизитыМТ", Истина); // признак разрешения редактирования координат		
		СтррКонтекст.Вставить("ДляВыбора", Ложь);
	Иначе // процедура вызвана для формы документа
		СтррКонтекст.Вставить("IDNew");
		СтррКонтекст.Вставить("ИспользоватьДоговоры", ВДокИспользоватьДоговоры(СтррКонтекст.ВО.ВидОбъекта));
	КонецЕсли; 
	
КонецПроцедуры

#Область ВиртуальныеОбъекты_Документы_Реквизиты

// Функция возвращает в виде строки список реквизтов шапки виртуального документа.
Функция ВДокРеквизитыШапки(ВидДокумента)

	Если ВидДокумента = "*Мерчендайзинг" Тогда
		Результат = "ID,Дата,Номер,Статус,Проведен,Контрагент,Организация,Менеджер,Комментарий,СуммаДокумента,ДокументОснование,ДатаНачала,ДатаОкончания,Широта,Долгота";
	ИначеЕсли ВидДокумента = "*Посещение" Тогда
		Результат = "ID,Дата,Номер,Статус,Партнер,Контрагент,Организация,Менеджер,Комментарий,РезультатПосещения,РезультатПосещения_Представление,ВремяНачала,ВремяОкончания,Широта,Долгота";
	Иначе
		ВызватьИсключение("Функция ВДокРеквизитыШапки(): неизвестное значение параметра ВидДокумента = """ + ВидДокумента + """!");
	КонецЕсли; 	
	
	Возврат Результат;

КонецФункции

// Функция возвращает массив реквизитов шапки виртуального документа.
Функция ВДокРеквизитыШапкиМассив(ВидДокумента) Экспорт
	
	Возврат СтрРазделить_(ВДокРеквизитыШапки(ВидДокумента));
	
КонецФункции

// Процедура добавляет в виртуальный документ табличную часть.
Процедура ВДокРеквизитыТЧДобавить(ВидДокумента, стррДокумент)

	ОписаниеТипаКоличество  = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 3));
	ОписаниеТипаСумма 		= Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2));
	ОписаниеТипаЧислоЦелое	= Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(5, 0));
	ОписаниеТипаСтрока		= Новый ОписаниеТипов("Строка");
	ОписаниеТипаЗначУпак	= Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(2, 0)); //dm_180621
	
	ТЗ = Новый ТаблицаЗначений;	
	
	Если ВидДокумента = "*Мерчендайзинг" Тогда
		
		ТЗ.Колонки.Добавить("Номенклатура",			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		//ТЗ.Колонки.Добавить("Характеристика",		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры")); //dm_180621
		ТЗ.Колонки.Добавить("Упаковка",				Новый ОписаниеТипов());  //dm_180621
		ТЗ.Колонки.Добавить("УпаковкаНаименование", ОписаниеТипаСтрока);
		ТЗ.Колонки.Добавить("ЗначУпак",				ОписаниеТипаЗначУпак); //dm_180621
		//ТЗ.Колонки.Добавить("КоличествоУпаковок",	ОписаниеТипаКоличество); //dm_180621     
		ТЗ.Колонки.Добавить("Количество", 			ОписаниеТипаКоличество);
		ТЗ.Колонки.Добавить("Цена",					ОписаниеТипаСумма);
		ТЗ.Колонки.Добавить("Сумма",				ОписаниеТипаСумма);
		ТЗ.Колонки.Добавить("ДоляПолки",			ОписаниеТипаСумма); 	// доля занимаемой полки товара на витрине в процентах
		ТЗ.Колонки.Добавить("КоличествоФейсов",		ОписаниеТипаЧислоЦелое);// количество фейсов товара на витрине
		
		стррДокумент.Вставить("Товары", ТЗ);
		
	КонецЕсли; 

КонецПроцедуры

// Функция возвращает признак - используются в виртуальном документе договоры/соглашения или нет.
Функция ВДокИспользоватьДоговоры(ВидДокумента) 
	
	Если ВидДокумента = "*Мерчендайзинг" Тогда
		Возврат Истина;	
	ИначеЕсли ВидДокумента = "*Посещение" Тогда
		Возврат Ложь;
	Иначе
		ВызватьИсключение("Функция ВДокИспользоватьДоговоры(): неизвеcтное значение параметра ВидДокумента - " + ВидДокумента);
	КонецЕсли; 
	
КонецФункции

// ВиртуальныеОбъекты_Документы_Реквизиты
#КонецОбласти 

// Процедура удаляет из таблицы значений устаревшие документы. Обновленную таблицу записывает в хранилище. 
// Параметры: 
// 	 стррВО - Структура - системные свойства виртуального объекта (результат вызова функции ВОСвойстваОбъекта()).
// 	 тз 	- ТаблицаЗначений - таблица документов.
//
Процедура ВДокТЗСократить(стррВО, тз)
	
	Если ЗначениеЗаполнено(стррВО.МаксКоличество) И тз.Количество() > стррВО.МаксКоличество Тогда // нужно удалить устаревшие документы
		
		КоличествоУдаляемых = тз.Количество() - стррВО.МаксКоличество;
		мИдентификаторы = Новый Массив;
		Для Шаг = 1 По КоличествоУдаляемых Цикл
			CтрокаТ = тз[0];
			Если Шаг = 1 Тогда
				ВремяНачала = CтрокаТ.Дата;
			ИначеЕсли Шаг = КоличествоУдаляемых Тогда
				ВремяОкончания = CтрокаТ.Дата;		
			КонецЕсли; 
			мИдентификаторы.Добавить(тз[0].ID);
			тз.Удалить(0);
		КонецЦикла;
		
		// записываем урезанную таблицу
		ВОТЗСохранить(стррВО, тз);

		// удаляем сами документы - по их идентификаторам
		ВОЭлементыУдалить(стррВО, мИдентификаторы, Ложь);
		
		Если КоличествоУдаляемых = 1 Тогда
			Текст = СтрШаблон_(НСтр("ru = 'Удален один устаревший документ от %1 для оптимизации журнала документов.'"), ВремяНачала);
		Иначе			
			стрУдалено = ЧислоЦифрамиПредметИсчисленияПрописью(КоличествоУдаляемых, НСтр("ru = 'документ, документа, документов'"));
			Текст = СтрШаблон_(НСтр("ru = 'Удалено %1 (с %2 по %3) для оптимизации журнала документов.'"), стрУдалено, ВремяНачала, ВремяОкончания);
		КонецЕсли; 
		
		Текст = Текст + " " + СтрШаблон_(НСтр("ru = 'Максимально допустимое количество документов в журнале: %1.'"), стррВО.МаксКоличество);
		Сообщить(Текст);
		
	КонецЕсли; 
	
КонецПроцедуры

// Функция создает пустую таблицу значений виртуальных объектов (аналог - список объектов, отображаемый в форме списка справочников или документов).
// Параметры: 
// 	 ВидСправочника - Строка - вид виртуального документа.
// 	 
// Возвращаемое значение:
//   ТаблицаЗначений - созданная таблица виртуальных объектов (элементов виртуального документа).
//   
Функция ВДокТЗСоздать(ВидДокумента)

	ОписаниеТипаИдентификатор = Новый ОписаниеТипов("УникальныйИдентификатор");
	ОписаниеТипаДатаВремя     = Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	ОписаниеТипаСтрока  	  = Новый ОписаниеТипов("Строка");
	ОписаниеТипаБулево  	  = Новый ОписаниеТипов("Булево");
	ОписаниеТипаСтатус  	  = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3, 0));
	ОписаниеТипаКоордината 	  = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(20));
	ОписаниеТипаСумма 		  = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2));
	ОписаниеТипаВсеДокументы  = Новый ОписаниеТипов(Документы.ТипВсеСсылки());
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ID",  	 		 	ОписаниеТипаИдентификатор); // идентификатор документа
	ТЗ.Колонки.Добавить("Дата",  	 		ОписаниеТипаДатаВремя);
	ТЗ.Колонки.Добавить("Номер",			ОписаниеТипаСтрока);
	ТЗ.Колонки.Добавить("Статус",			ОписаниеТипаСтатус);
	ТЗ.Колонки.Добавить("Комментарий",		ОписаниеТипаСтрока);
	
	Если ВидДокумента = "*Мерчендайзинг" Тогда
		ТЗ.Колонки.Добавить("СуммаДокумента",		ОписаниеТипаСумма);	
		ТЗ.Колонки.Добавить("ДокументОснование", 	ОписаниеТипаВсеДокументы);
	ИначеЕсли ВидДокумента = "*Посещение" Тогда
		ТЗ.Колонки.Добавить("РезультатПосещения",				ОписаниеТипаИдентификатор);
		ТЗ.Колонки.Добавить("РезультатПосещения_Представление",	ОписаниеТипаСтрока);
	Иначе
		ВызватьИсключение("Функция ВДокСоздатьТЗЖурнала(ВидДокумента): неизвестное значение параметра: " + ВидДокумента);
	КонецЕсли; 
	
	ТЗ.Колонки.Добавить("ВремяНачала",		ОписаниеТипаДатаВремя);
	ТЗ.Колонки.Добавить("ВремяОкончания",	ОписаниеТипаДатаВремя);
	ТЗ.Колонки.Добавить("Широта",			ОписаниеТипаКоордината);
	ТЗ.Колонки.Добавить("Долгота",			ОписаниеТипаКоордината);
	
	//ТЗ.Колонки.Добавить("Партнер",			Новый ОписаниеТипов("СправочникСсылка.Партнеры")); //dm_180621
	ТЗ.Колонки.Добавить("Контрагент",		Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗ.Колонки.Добавить("Организация",		Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТЗ.Колонки.Добавить("Менеджер",			Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	Возврат ТЗ;

КонецФункции

// ВиртуальныеОбъекты_Документы
#КонецОбласти

#Область ВиртуальныеОбъекты_Справочники

// Процедура дополняет контекст формы виртуального сроавочника (формы списка и формы документа).
// Параметры:
// 		СтррКонтекст - Структура - структура СтррКонтекст - реквизит формы.
// 		ВидСправочника - Строка - вид виртуального справочника.
// 		ДляФормыСписка - Булево - контекст для формы списка (Истина) или для формы элемента (Ложь).
//
Процедура ВСпрКонтекстФормыДополнить(СтррКонтекст)

	Если СтррКонтекст.ЭтоФормаСписка Тогда 
		СтррКонтекст.Вставить("ДляВыбора", Ложь);
	Иначе // процедура вызвана для формы элемента
		СтррКонтекст.Вставить("IDNew");	
	КонецЕсли; 
	
КонецПроцедуры

// Функция создает пустую таблицу значений виртуальных объектов (аналог - список объектов, отображаемый в форме списка справочников или документов).
// Параметры: 
// 	 ВидСправочника - Строка - вид виртуального справочника.
// 	 
// Возвращаемое значение:
//   ТаблицаЗначений - созданная таблица виртуальных объектов (элементов виртуального справочника).
//
Функция ВСпрТЗСоздать(ВидСправочника)
	
	ОписаниеТипаИдентификатор 	= Новый ОписаниеТипов("УникальныйИдентификатор");
	ОписаниеТипаСтатус  		= Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3, 0));
	ОписаниеТипаСтрока  		= Новый ОписаниеТипов("Строка");
	
	ТЗ = Новый ТаблицаЗначений;
	
	Если ВидСправочника = "_РезультатыПосещений" Тогда
	
		ТЗ.Колонки.Добавить("ID",  	 		 	ОписаниеТипаИдентификатор); // идентификатор элемента
		ТЗ.Колонки.Добавить("Статус",			ОписаниеТипаСтатус);		
		ТЗ.Колонки.Добавить("Наименование",  	Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));
		ТЗ.Колонки.Добавить("ШаблонАнкеты",		ОписаниеТипаИдентификатор);
		ТЗ.Колонки.Добавить("ШаблонАнкеты_Представление",	ОписаниеТипаСтрока);
		ТЗ.Колонки.Добавить("Комментарий",		ОписаниеТипаСтрока);
		
	ИначеЕсли ВидСправочника = "_ШаблоныАнкет" Тогда		
		
		ТЗ.Колонки.Добавить("ID",  	 		 	ОписаниеТипаИдентификатор); // идентификатор элемента
		ТЗ.Колонки.Добавить("Статус",			ОписаниеТипаСтатус);		
		ТЗ.Колонки.Добавить("Наименование",  	Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
		ТЗ.Колонки.Добавить("Комментарий",		ОписаниеТипаСтрока);
		
	Иначе
		
		ВызватьИсключение("Функция ВСпрИмяТЗЭлементов(): неизвестное значение параметра ВидСправочника - " + ВидСправочника);
		
	КонецЕсли; 
	
	Возврат ТЗ;
	
КонецФункции

// ВиртуальныеОбъекты_Справочники
#КонецОбласти

// ВиртуальныеОбъекты
#КонецОбласти

#Область СлужебныеДанные

Функция СДИмяФайлаДляМУ(СсылкаМУ)
	
	Возврат СДИдентификаторВИмяФайла(СсылкаМУ) + "_data.txt";
	
КонецФункции

// Чтение служебных данных
Функция СДПрочитать(Имя, СоздатьЕслиНетДанных = Ложь)
	
	Если ХранитьСлужебныеДанныеВФайлах() Тогда // gi_170902
		стррДанные = СДОткрытьФайл(ПодкаталогДанных("Входящие") + Имя);
	Иначе
		стррДанные = ПрочитатьЗначениеНастройки(Имя);
	КонецЕсли;
	
	Если ТипЗнч(стррДанные) <> Тип("Структура") И СоздатьЕслиНетДанных Тогда
		стррДанные = Новый Структура;
	КонецЕсли; 
	
	Возврат стррДанные;
	
КонецФункции

// Сохранение служебных данных
Функция СДЗаписать(Имя, Данные)
	
	Если ХранитьСлужебныеДанныеВФайлах() Тогда // gi_170902	
		ИмяФайла = ПодкаталогДанных("Входящие") + Имя;
		Попытка
			ЗначениеВФайл(ИмяФайла, Данные);
		Исключение
			Текст = "Не удалось сохранить служебные данные в файл. Проверьте права доступа. Файл: " + ИмяФайла;
			ОповеститьОСобытии(Текст, "ОшибкаЗаписи",, "ТекущийАгент");
			Возврат Ложь;
		КонецПопытки;
	Иначе
		СохранитьЗначениеНастройки(Имя, Данные);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Функция возвращает прочитанные служебные данные.
Функция СДОткрытьФайл(ИмяФайла)
	
	Результат = Неопределено;	
	
	Если ФайлСуществует(ИмяФайла) Тогда
		
		Попытка
		    Данные = ЗначениеИзФайла(ИмяФайла);
		Исключение
			Текст = "Ошибка чтения файла служебных данных. Файл: " + ИмяФайла;
			ОповеститьОСобытии(Текст, "ОшибкаЧтения",, "ТекущийАгент");
		КонецПопытки;
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Результат = Данные;			
		Иначе
			Текст = "Файл служебных данных поврежден. Будет создан новый файл: " + ИмяФайла;
			ОповеститьОСобытии(Текст, "ОшибкаЧтения",, "ТекущийАгент");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СДИдентификаторВИмяФайла(Идентификатор)
	
	Возврат СтрЗаменить(НРег(Строка(Идентификатор)), "-", "");
	
КонецФункции

Процедура СохранитьСпрХарактеристикиНоменклатурыСлужебный()
	
	Если ИспользоватьХарактеристики И гОбновитьСпрХарактеристикиНоменклатурыСлужебный Тогда 
		СохранитьЗначениеНастройки("СпрХарактеристикиНоменклатурыСлужебный", ВременныеТаблицы.СпрХарактеристикиНоменклатурыСлужебный);
	КонецЕсли;
	
КонецПроцедуры

// СлужебныеДанные
#КонецОбласти 

#Область ПодтвержденияСправочников
// { sd_10082017
Функция ИмяФайлаПодтвержденийСправочников(СсылкаМУ)
	
	Возврат СДИдентификаторВИмяФайла(СсылкаМУ) + "_ctlg.txt";
	
КонецФункции

Функция СДСохранитьПодтвержденияСправочников(СсылкаМУ, ТЗ)
	
	ИмяФайла = ИмяФайлаПодтвержденийСправочников(СсылкаМУ);
	
	Если ХранитьСлужебныеДанныеВФайлах() Тогда // gi_170902		
		Попытка
			ЗначениеВФайл(ПодкаталогДанных("Входящие") + ИмяФайла, ТЗ);
		Исключение
			Текст = "Не удалось сохранить файл подтверждений. Проверьте права доступа. Файл: " + ИмяФайла;
			ОповеститьОСобытии(Текст, "ОшибкаЗаписи",, "ТекущийАгент");
			Возврат Ложь;
		КонецПопытки;
	Иначе
		СохранитьЗначениеНастройки(ИмяФайла, ТЗ);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СДОткрытьПодтвержденияСправочников(СсылкаМУ, ДляЧтения) Экспорт
	
	ИмяФайла = ИмяФайлаПодтвержденийСправочников(СсылкаМУ);
	
	Если ХранитьСлужебныеДанныеВФайлах() Тогда // gi_170902
		Результат = ОткрытьФайлПодтверждений(ПодкаталогДанных("Входящие") + ИмяФайла, ДляЧтения);
	Иначе
		Результат = ПрочитатьЗначениеНастройки(ИмяФайла);
	КонецЕсли;
	
	Если Результат = Неопределено И Не ДляЧтения Тогда // создаем пустую ТЗ
		
		//ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки()); // gi_170830 убрал
		ОписаниеТипаДата   = Новый ОписаниеТипов("Дата",, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
		ОписаниеТипаИдентификатор = Новый ОписаниеТипов("УникальныйИдентификатор"); // sd_24082017
		
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Дата", ОписаниеТипаДата);
		ТЗ.Колонки.Добавить("Идентификатор", 		ОписаниеТипаИдентификатор); // GUID подтверждаемого элемента справочника
		ТЗ.Колонки.Добавить("ИдВидСправочникаМТ",	ОписаниеТипаИдентификатор); // gi_170830 идентификатор (GUID) справочника в МТ
		Результат = ТЗ;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьПодтвержденияСправочников(мСсылкиМУ = Неопределено) Экспорт
	
	Если мСсылкиМУ = Неопределено Тогда
		ТЗ = ПрочитатьЗначениеНастройки("МобильныеУстройства");
		Если ТЗ = Неопределено Тогда
			Возврат;
		Иначе
			мСсылкиМУ = ТЗ.ВыгрузитьКолонку("ID");
		КонецЕсли;
	КонецЕсли;
	
	мИмена = Новый Массив;	
	
	Для Каждого СсылкаМУ Из мСсылкиМУ Цикл
		мИмена.Добавить(ИмяФайлаПодтвержденийСправочников(СсылкаМУ));
	КонецЦикла;
	
	Если ХранитьСлужебныеДанныеВФайлах() Тогда // gi_170902	
		
		Каталог = ПодкаталогДанных("Входящие");
		Для Каждого ИмяФайла Из мИмена Цикл
			ПолныйПуть = Каталог + ИмяФайла;
			Попытка
				УдалитьФайлы(ПолныйПуть);
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	Иначе
		
		УдалитьЗначенияНастроек(мИмена);	
		
	КонецЕсли;
	
КонецПроцедуры
// } sd_10082017
// ПодтвержденияСправочников
#КонецОбласти 

#Область ПодтвержденияДокументов

Функция ИмяФайлаПодтвержденийДокументов(СсылкаМУ)
	
	Возврат СДИдентификаторВИмяФайла(СсылкаМУ) + "_doc.txt";
	
КонецФункции

// Функция возвращает таблицу значений с подтверждениями.
// Если параметр ДляЧтения = Истина и если файл подтверждений не существует или недоступен, то возвращается Неопределено.
// Если параметр ДляЧтения = Ложь и если файл подтверждений не существует или недоступен, то возвращается пустая таблица значений.
Функция ОткрытьФайлПодтверждений(ИмяФайла, ДляЧтения)
	
	Результат = Неопределено;	
	
	Если ФайлСуществует(ИмяФайла) Тогда
		
		Попытка
		    ТЗ = ЗначениеИзФайла(ИмяФайла);
		Исключение
			Текст = "Ошибка чтения файла подтверждений. Файл: " + ИмяФайла;
			ОповеститьОСобытии(Текст, "ОшибкаЧтения",, "ТекущийАгент");
		КонецПопытки;
		
		ТекстСоздание = ?(ДляЧтения, "", "Будет создан новый файл.") + " Файл: ";
		
		Если ТипЗнч(ТЗ) <> Тип("ТаблицаЗначений") Тогда
			Текст = "Файл подтверждений поврежден. " + ТекстСоздание + ИмяФайла;
			ОповеститьОСобытии(Текст, "ОшибкаЧтения",, "ТекущийАгент");
		Иначе
			Колонки = "Дата,Идентификатор,ВидДокумента";
			Если ЕстьКолонкиТаблицыЗначений(ТЗ, Колонки) Тогда
				Результат = ТЗ;
			Иначе
				Текст = "Таблица в файле подтверждений не содержит колонок: " + Колонки + ". " + ТекстСоздание + ИмяФайла;
				ОповеститьОСобытии(Текст, "ОшибкаЧтения",, "ТекущийАгент");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Служебные данные (СД). Сохранить подтверждения агента в файл или хранилище.
Функция СДСохранитьПодтвержденияДокументов(СсылкаМУ, ТЗ)
	
	ИмяФайла = ИмяФайлаПодтвержденийДокументов(СсылкаМУ);
	
	Если ХранитьСлужебныеДанныеВФайлах() Тогда // gi_170902		
		Попытка
			ЗначениеВФайл(ПодкаталогДанных("Входящие") + ИмяФайла, ТЗ);
		Исключение
			Текст = "Не удалось сохранить файл подтверждений. Проверьте права доступа. Файл: " + ИмяФайла;
			ОповеститьОСобытии(Текст, "ОшибкаЗаписи",, "ТекущийАгент");
			Возврат Ложь;
		КонецПопытки;
	Иначе
		СохранитьЗначениеНастройки(ИмяФайла, ТЗ);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Служебные данные (СД). Загрузить подтверждения агента из файла или хранилища в таблицу значений.
// Функция возвращает таблицу значений с подтверждениями.
// Если параметр ДляЧтения = Ложь и данные подтверждений отсутствуют, то возвращается пустая таблица подтверждений.
Функция СДОткрытьПодтвержденияДокументов(СсылкаМУ, ДляЧтения) Экспорт
	
	ИмяФайла = ИмяФайлаПодтвержденийДокументов(СсылкаМУ);
	
	Если ХранитьСлужебныеДанныеВФайлах() Тогда // gi_170902	
		Результат = ОткрытьФайлПодтверждений(ПодкаталогДанных("Входящие") + ИмяФайла, ДляЧтения);
	Иначе
		Результат = ПрочитатьЗначениеНастройки(ИмяФайла);
	КонецЕсли;
	
	Если Результат = Неопределено И Не ДляЧтения Тогда // создаем пустую ТЗ
		
		ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки());
		ОписаниеТипаДата   = Новый ОписаниеТипов("Дата",, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
		ОписаниеТипаИдентификатор = Новый ОписаниеТипов("УникальныйИдентификатор"); // sd_24082017
		
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Дата", ОписаниеТипаДата);
		ТЗ.Колонки.Добавить("Идентификатор", 	ОписаниеТипаИдентификатор); // GUID подтверждаемого документа
		ТЗ.Колонки.Добавить("ВидДокумента",  	ОписаниеТипаСтрока);
		ТЗ.Колонки.Добавить("ИдВидДокументаМТ", ОписаниеТипаИдентификатор); // gi_170830 идентификатор (GUID) вида документа в МТ
		Результат = ТЗ;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПодтвержденияСохранить(СсылкаМУ, ЗагружаемыеОбъекты)
	
	МаксКоличествоСтрок = 200; // максимальное количество документов в буфере перед добавлением новых документов.
	
	ТЗ = СДОткрытьПодтвержденияДокументов(СсылкаМУ, Ложь); // функция всегда возвращает таблицу значений
	
	ТЗ.Сортировать("Дата");  // сначала будут идти самые ранние документы, их и будем удалять.
	УдалитьСтрок = ТЗ.Количество() - МаксКоличествоСтрок;
	Если УдалитьСтрок > 0 Тогда
		Для Поз = 1 По УдалитьСтрок Цикл
			ТЗ.Удалить(ТЗ.Получить(0));
		КонецЦикла;
	КонецЕсли;
	
	ТекДата = ТекущаяДата();
	
	тзДокументы = ЗагружаемыеОбъекты.ТЗЗагруженныеДокументы;
	
	Для Каждого стзДокументы Из тзДокументы Цикл
		ИдДокумента = стзДокументы.Идентификатор; // gi_170830 это GUID
		СтрокаТ = ТЗ.Найти(ИдДокумента, "Идентификатор");
		Если СтрокаТ = Неопределено Тогда
			СтрокаТ = ТЗ.Добавить();
			СтрокаТ.Идентификатор 	 = ИдДокумента; // gi_170830 это GUID
			СтрокаТ.ВидДокумента  	 = стзДокументы.ВидДокумента;
			СтрокаТ.ИдВидДокументаМТ = стзДокументы.ИдВидДокументаМТ; // gi_170830 это GUID
		КонецЕсли;
		СтрокаТ.Дата = ТекДата;	// Если документ выгружается из МУ повторно, то обновляем в подтверждении его время загрузки
	КонецЦикла;
	
	СДСохранитьПодтвержденияДокументов(СсылкаМУ, ТЗ);
	
	// sd_10082017 {
	ТЗ = СДОткрытьПодтвержденияСправочников(СсылкаМУ, Ложь); // функция всегда возвращает таблицу значений
	
	ТЗ.Сортировать("Дата");  // сначала будут идти самые ранние справочники, их и будем удалять.
	УдалитьСтрок = ТЗ.Количество() - МаксКоличествоСтрок;
	Если УдалитьСтрок > 0 Тогда
		Для Поз = 1 По УдалитьСтрок Цикл
			ТЗ.Удалить(ТЗ.Получить(0));
		КонецЦикла;
	КонецЕсли;
	
	ТекДата = ТекущаяДата();
	
	тзСправочники = ЗагружаемыеОбъекты.ТЗЗагруженныеСправочники;
	
	Для Каждого стзСправочники Из тзСправочники Цикл
		ИдЭлементаСправочника = стзСправочники.Идентификатор; // gi_170902
		СтрокаТ = ТЗ.Найти(ИдЭлементаСправочника, "Идентификатор");
		Если СтрокаТ = Неопределено Тогда
			СтрокаТ = ТЗ.Добавить();
			СтрокаТ.Идентификатор 	 	= ИдЭлементаСправочника;
			СтрокаТ.ИдВидСправочникаМТ 	= сТЗСправочники.ИдВидСправочникаМТ;
		КонецЕсли;
		СтрокаТ.Дата = ТекДата;	// Если справочник выгружается из МУ повторно, то обновляем в подтверждении его время загрузки
	КонецЦикла;
	
	СДСохранитьПодтвержденияСправочников(СсылкаМУ, ТЗ);
	// } sd_10082017
	
КонецПроцедуры

// Процедура удаляет подтверждения документов.
Процедура УдалитьПодтвержденияДокументов(мСсылкиМУ = Неопределено) Экспорт
	
	Если мСсылкиМУ = Неопределено Тогда
		ТЗ = ПрочитатьЗначениеНастройки("МобильныеУстройства");
		Если ТЗ = Неопределено Тогда
			Возврат;
		Иначе
			мСсылкиМУ = ТЗ.ВыгрузитьКолонку("ID");
		КонецЕсли;
	КонецЕсли;
	
	мИмена = Новый Массив;	
	
	Для Каждого СсылкаМУ Из мСсылкиМУ Цикл
		мИмена.Добавить(ИмяФайлаПодтвержденийДокументов(СсылкаМУ));
	КонецЦикла;
	
	Если ХранитьСлужебныеДанныеВФайлах() Тогда // gi_170902
		
		Каталог = ПодкаталогДанных("Входящие");
		Для Каждого ИмяФайла Из мИмена Цикл
			ПолныйПуть = Каталог + ИмяФайла;
			Попытка
				УдалитьФайлы(ПолныйПуть);
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	Иначе
		
		УдалитьЗначенияНастроек(мИмена);	
		
	КонецЕсли;
	
КонецПроцедуры

// ПодтвержденияДокументов
#КонецОбласти 

#Область ВыгрузкаДанных

Функция СоздатьФайлВыгрузкиДанных(ИмяФайлаВыгрузки)

	ДокОбмена = Новый ЗаписьXML();
	Попытка
		ДокОбмена.ОткрытьФайл(ИмяФайлаВыгрузки);
		ДокОбмена.ЗаписатьОбъявлениеXML();	
		ДокОбмена.ЗаписатьНачалоЭлемента("DATA");

		ДокОбмена.ЗаписатьАтрибут("DBVERSION", "1977");
		
		ДокОбмена.ЗаписатьАтрибут("DATASOURCENAME", "МобильнаяТорговля");
		ДокОбмена.ЗаписатьАтрибут("DATASOURCEVERSION", "1.0.1"); // Ратмир

		ДокОбмена.ЗаписатьАтрибут("CONFIG1CNAME", СокрЛП(Метаданные.Имя));
		ДокОбмена.ЗаписатьАтрибут("CONFIG1CVERSION", СокрЛП(Метаданные.Версия));

		Возврат ДокОбмена;
	Исключение
		Текст = НСтр("ru = 'Ошибка создания файла выгрузки по причине:'") + " " + ОписаниеОшибки();
		ОповеститьОСобытии(Текст, "ОшибкаОбмен", , "ТекущийАгент");
		Возврат Неопределено;
	КонецПопытки;

КонецФункции 

Процедура ЗакрытьФайлВыгрузки(ДокОбмена)

	ДокОбмена.ЗаписатьКонецЭлемента();
	ДокОбмена.Закрыть();

КонецПроцедуры

Процедура ВыгрузитьКонстанты(ДокОбмена)

	ДокОбмена.ЗаписатьНачалоЭлемента("CONSTANTS");
	ДобавитьПоле(ДокОбмена, "Comment", "Константы");
	ДокОбмена.ЗаписатьНачалоЭлемента("ELEMENTS");
	
	Агент = ВыбНастройкиАгента.Пользователь;

	// НаименованиеАгента
	ДобавитьКонстанту(ДокОбмена, "a2e1cc68-0624-45a6-8057-efd35259b9fe", СокрЛП(Агент)); 
	
	// ИдентификаторАгента
	ДобавитьКонстанту(ДокОбмена, "79c698db-3c55-465e-acfe-4741acdd5655", Агент.УникальныйИдентификатор());
	
	// Дата последней выгрузки данных из ЦБД
	ДобавитьКонстанту(ДокОбмена, "d0604fdf-b2a5-44b7-b84d-db2a9a691918", Формат(ТекущаяДата(), "ДФ=гггг-ММ-дд'T'ЧЧ:мм:сс"));

	// Константа измененной нумерации - только для УТ 8, ред. 11
	ДобавитьКонстанту(ДокОбмена, "c186c395-658c-4b42-b007-f50da543a9d8", "1");
	
	// Константа ТорговляСКолес, при включенной настройке документ "Реализация" будет доступным для редактирования.  
	ДобавитьКонстанту(ДокОбмена, "72889bff-cc95-4c2e-9c4e-0d28e2efbf7c", ТорговляСКолес);
	
	// Основная организация
	ДобавитьКонстанту(ДокОбмена, "13faf2a0-3d1e-469e-bc53-cdada6ac1375", ИдентификаторСсылки(ВыбНастройкиАгента.ОсновнаяОрганизация)); 
	
	// Основной склад
	ДобавитьКонстанту(ДокОбмена, "86ba5dad-16d0-46b8-9d8d-3eab2cf08685", ИдентификаторСсылки(ВыбНастройкиАгента.ОсновнойСклад));
	
	// Мобильный склад
	ДобавитьКонстанту(ДокОбмена, "448b6fab-5e21-479c-9a9a-63e8eced59b9", 
			?(ТорговляСКолес И ЗначениеЗаполнено(ВыбНастройкиАгента.МобильныйСклад), ИдентификаторСсылки(ВыбНастройкиАгента.МобильныйСклад), ""));
	
	// Основной тип цены
	ДобавитьКонстанту(ДокОбмена, "7bc85296-f536-411e-aaa9-74ad5c7adea2", ИдентификаторСсылки(ВыбНастройкиАгента.ОсновнойТипЦены)); 

	ВалютаУчета = КонстантыПолучитьЗначение("ВалютаРегламентированногоУчета");
	//++Дейнеко ВГ 2017-09-18 Бухгалтерия
	//нет константы ВалютаУправленческогоУчета, но ВалютаРегламентированногоУчета почти тоже самое
	//Если ВалютаУчета.Пустая() Тогда
	//	ВалютаУчета = КонстантыПолучитьЗначение("ВалютаУправленческогоУчета");
	//КонецЕсли;
	//++Дейнеко ВГ 2017-09-18 Бухгалтерия
	
	ДобавитьКонстанту(ДокОбмена, "d2b5508c-7453-4a52-b803-a846992a485d", ВалютаУчета.Наименование);
	
	// Значение надписи поля "Код" в МУ
	ДобавитьКонстанту(ДокОбмена, "7268af8a-6532-4ad0-bc63-3832f3c0d96f", 
			?(РежимВыгрузкиКодовНоменклатуры = "АРТИКУЛ", "Артикул", "Код"));
	
	// 	Константа ЕдиницаИзмеренияВеса
	//++Дейнеко ВГ 2017-09-18 Бухгалтерия
	//Это для учета упаковеи, убираем
	ДобавитьКонстанту(ДокОбмена, "13af34a5-664d-4aad-a29c-eefc04fefca9", "");
	//Замена
	//ДобавитьКонстанту(ДокОбмена, "13af34a5-664d-4aad-a29c-eefc04fefca9", КонстантыПолучитьЗначение("ЕдиницаИзмеренияВеса").Наименование);
	//--Дейнеко ВГ 2017-09-18 Бухгалтерия
	
	
	// Константа ИспользоватьХарактеристикиНоменклатуры
	//++Дейнеко ВГ 2017-09-18 Бухгалтерия
	//Не успользуются в бух 30 ИспользоватьХарактеристикиНоменклатуры
	//Характеристика номенклатуры – это некоторые технические данные, относящиеся к данной номенклатуре (объем, длина, ширина, высота, цвет и т.д.).
	
	ДобавитьКонстанту(ДокОбмена, "6e9470db-c618-4bf8-b510-d1e39e2217f6", 
			ЗначениеВСтрокуДляXML(Ложь И ИспользоватьХарактеристики));
			
	//ДобавитьКонстанту(ДокОбмена, "6e9470db-c618-4bf8-b510-d1e39e2217f6", 
	//		ЗначениеВСтрокуДляXML(КонстантыПолучитьЗначение("ИспользоватьХарактеристикиНоменклатуры") И ИспользоватьХарактеристики));		
	//--Дейнеко ВГ 2017-09-18 Бухгалтерия		
			
	// Пересчет в базовые единицы
	//++Дейнеко ВГ 2017-09-18 Бухгалтерия
	//Не используем мы упаковки, тоесть ИспользоватьУпаковкиНоменклатуры = ложб поэтому убираем код
	//Если КонстантыПолучитьЗначение("ИспользоватьУпаковкиНоменклатуры") Тогда
	//	ДобавитьКонстанту(ДокОбмена, "0d0b118f-a77d-4a90-adfb-c79e5eb08cdb", "0");
	//КонецЕсли;
	//Замена
	//Если КонстантыПолучитьЗначение("ИспользоватьУпаковкиНоменклатуры") Тогда
	//	ДобавитьКонстанту(ДокОбмена, "0d0b118f-a77d-4a90-adfb-c79e5eb08cdb", "0");
	//КонецЕсли;
	//--Дейнеко ВГ 2017-09-18 Бухгалтерия
	
	// Точность цены, количества и скидки
	ДобавитьКонстанту(ДокОбмена, "27952ab3-1365-4b56-a0ef-34ec0133e5d3", "2");
	ДобавитьКонстанту(ДокОбмена, "5d54ed85-fdea-4027-8ecd-129c27bdbf64", "2");
	ДобавитьКонстанту(ДокОбмена, "a978f039-3f17-4705-b7f6-16c580c9ac5f", "2");
	
	ДобавитьКонстанту(ДокОбмена, "8c52bbbf-8bbb-447d-b18b-06860d372818", ИспользоватьКонтрагентов);	// В МТ - это константа "ИспользоватьТорговыеТочки"
	ДобавитьКонстанту(ДокОбмена, "b201164e-e265-4c1d-b3d0-0579bcd1fda6", ИспользоватьСоглашения);
	
	// Фактический адрес
	//++Дейнеко ВГ 2017-09-18 Бухгалтерия
	
	ДобавитьКонстанту(ДокОбмена, "1b3d41b2-eb00-4f25-a476-6a668c5e69f0", ЗначениеВСтрокуДляXML(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента));
	//Замена
	//ДобавитьКонстанту(ДокОбмена, "1b3d41b2-eb00-4f25-a476-6a668c5e69f0", ЗначениеВСтрокуДляXML(Справочники.ВидыКонтактнойИнформации.АдресПартнера));
	//--Дейнеко ВГ 2017-09-18 Бухгалтерия
	
	
	ДобавитьКонстанту(ДокОбмена, "0270b3d5-4213-419b-9e3a-48cba4caec04", ВыгружатьИсториюПродаж);

	Если ВыделятьЦветомПросроченныеДолги Тогда
		стрЦвет = ЦветВСтроку(ЦветПросроченныхДолгов);
		Если стрЦвет = "0,0,0" Тогда // Если не указан для агента определенный цвет, то по умолчанию выделяем красным
			стрЦвет = "255,0,0";
		КонецЕсли;
		// Цвет выделения просроченных долгов
		ДобавитьКонстанту(ДокОбмена, "9c60a778-7db0-4b3a-89d5-ebe6b56b1d7f", стрЦвет); // цвета передаем в виде строки R,G,B
	КонецЕсли;

	Если ИспользоватьПунктыРазгрузки Тогда 
		// Значения надписи поля "Торговая точка" в МУ
		НадписьТорговаяТочка = "Пункт разгрузки";
		НадписьТорговыеТочки = "Пункты разгрузки";
	Иначе 
		// Значения надписи поля "Контрагент" в МУ
		//{{dm_180523
		//ДобавитьКонстанту(ДокОбмена, "f2e1afa7-292c-42d4-950d-7da550d2fda4", "Партнер");
		ДобавитьКонстанту(ДокОбмена, "f2e1afa7-292c-42d4-950d-7da550d2fda4", "Контрагент");
		//}}dm_180523
		// Значения надписи поля "Торговая точка" в МУ
		НадписьТорговаяТочка = "Контрагент";
		НадписьТорговыеТочки = "Контрагенты";
	КонецЕсли;

	ДобавитьКонстанту(ДокОбмена, "5728ed47-0dbc-48a9-b37c-e7808766c48c", НадписьТорговаяТочка);
	ДобавитьКонстанту(ДокОбмена, "bcca6cef-853c-42f4-9b10-2ca02b1a5556", НадписьТорговыеТочки);
	
	// Служебные данные для МУ - в них хранится дата и время конца загруженного трека
	стррЗначения = СДПрочитать(СДИмяФайлаДляМУ(ВыбНастройкиАгента.СсылкаМУ)); // служебные данные для МУ
	Если Тип(стррЗначения) = Тип("Структура") И стррЗначения.Свойство("ПоследнееВремяТрека") Тогда
		ДобавитьКонстанту(ДокОбмена, "df297ad7-e2ce-478a-974e-fb399239e23e", стррЗначения.ПоследнееВремяТрека);
	КонецЕсли; 

	ВыгрузитьПерсональныеНастройкиАгента(ДокОбмена);

	ДокОбмена.ЗаписатьКонецЭлемента(); //ELEMENTS
	ДокОбмена.ЗаписатьКонецЭлемента(); //CONSTANTS

КонецПроцедуры

Процедура ВыгрузитьПерсональныеНастройкиАгента(ДокОбмена)

	Если Не ЗначениеЗаполнено(ВыбНастройкиАгента.НастройкиМобильногоПриложения) Тогда
		
		ОповеститьОСобытии("Не указаны настройки мобильного приложения.");
		
	Иначе
		
		Для Каждого ЭлементНастройки Из ВыбНастройкиАгента.НастройкиМобильногоПриложения Цикл
			ЭлементНастройки = ЭлементНастройки.Значение;
			Если Не ПустаяСтрока(ЭлементНастройки.Идентификатор) Тогда
				ДобавитьКонстанту(ДокОбмена, ЭлементНастройки.Идентификатор, ЗначениеВСтрокуДляXML(ЭлементНастройки.Значение));
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;
	
	ДобавитьКонстанту(ДокОбмена, "c21ed754-43d4-423d-bdb6-8d2f36b9f8d1", ВыбНастройкиАгента.Префикс);
	ВыгрузитьНастройкиФоновойПередачиТрека(ДокОбмена);

КонецПроцедуры

Процедура ВыгрузитьНастройкиФоновойПередачиТрека(ДокОбмена)

	Если ЗначениеЗаполнено(ВыбНастройкиАгента.НастройкиМобильногоПриложения) И 
		ВыбНастройкиАгента.НастройкиМобильногоПриложения.Свойство("РасписаниеВеденияТрека") Тогда 
		Расписание = ВыбНастройкиАгента.НастройкиМобильногоПриложения.РасписаниеВеденияТрека.Значение;
		Если ЕстьСвойстваСтруктуры(Расписание, "ВремяНачала,ВремяОкончания,ДниНедели,ПериодЗаписи") Тогда
			РабочееВремя = Расписание.ВремяНачала + "-" + Расписание.ВремяОкончания;
			ДобавитьКонстанту(ДокОбмена, "1de1dae1-a088-4c5b-a68e-4d233b49683a", РабочееВремя);
			ДобавитьКонстанту(ДокОбмена, "428f867c-0bf1-45b2-b812-ef1d284d3e3f", Расписание.ДниНедели);
			ДобавитьКонстанту(ДокОбмена, "e38fe34e-f36a-44c9-9dbd-a29f7c925940", Расписание.ПериодЗаписи);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#Область ВыгрузкаПодтверждений

Процедура ВыгрузитьПодтверждения(ДокОбмена) 
	// sd_10082017 немного переделал данную процедуру, разбив на две соответственно.
	ВыгрузитьПодтвержденияСправочников(ДокОбмена);
	ВыгрузитьПодтвержденияДокументов(ДокОбмена);
	
КонецПроцедуры

Процедура ВыгрузитьПодтвержденияСправочников(ДокОбмена)
	
	// sd_10082017 { выгрузка подтверждений для справочников
	ТЗ = СДОткрытьПодтвержденияСправочников(ВыбНастройкиАгента.СсылкаМУ, Истина);
	
	Если ТЗ = Неопределено Тогда
		Возврат; // файл подтверждений или отсутствует или заблокирован, соответствующее предупреждение уже выведено
	КонецЕсли;
	
	ТЗ.Сортировать("Дата Убыв");
	
	ДокОбмена.ЗаписатьНачалоЭлемента("CATALOGS");
	
	ДобавитьПоле(ДокОбмена, "Comment", "Подтверждения справочников");
		
		СтррЗапись = Новый Структура("GUID");
		
		ИдВидСправочникаМТ = Неопределено;
		
		Для Каждого СтрокаТ Из ТЗ Цикл
			
			Если СтрокаТ.ИдВидСправочникаМТ <> ИдВидСправочникаМТ Тогда
				
				Если ИдВидСправочникаМТ <> Неопределено Тогда
					ДокОбмена.ЗаписатьКонецЭлемента(); //CONFIRMATIONS
					ДокОбмена.ЗаписатьКонецЭлемента(); //CATALOG
				КонецЕсли;
				ИдВидСправочникаМТ = СтрокаТ.ИдВидСправочникаМТ;
				ДокОбмена.ЗаписатьНачалоЭлемента("CATALOG");
				ДобавитьПоле(ДокОбмена, "GUID", ИдВидСправочникаМТ);
				ДобавитьПоле(ДокОбмена, "Comment", "Подтверждения справочников " + ВидОбъектаПоИдентификатору(ИдВидСправочникаМТ, Ложь, "Справочник"));
				ДокОбмена.ЗаписатьНачалоЭлемента("CONFIRMATIONS");
				
				СтррЗапись.GUID = СтрокаТ.Идентификатор;
				ЗаписатьЭлементВДокументОбмена(ДокОбмена, СтррЗапись);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ИдВидСправочникаМТ <> Неопределено Тогда // закрываем открытые ранее теги
			ДокОбмена.ЗаписатьКонецЭлемента(); //CONFIRMATIONS
			ДокОбмена.ЗаписатьКонецЭлемента(); //CATALOG
		КонецЕсли;
	
	ДокОбмена.ЗаписатьКонецЭлемента(); //CATALOGS
	// } sd_10082017 выгрузка подтверждений для справочников
	
КонецПроцедуры

Процедура ВыгрузитьПодтвержденияДокументов(ДокОбмена)
	
	ТЗ = СДОткрытьПодтвержденияДокументов(ВыбНастройкиАгента.СсылкаМУ, Истина);

	Если ТЗ = Неопределено Тогда
		Возврат; // файл подтверждений или отсутствует или заблокирован, соответствующее предупреждение уже выведено
	КонецЕсли;
	
	//{{dm_180626
	стррТаблицыЖурналовВДок = Новый Структура; // кэш для таблиц журнала виртуальных документов - по этим таблицам проверяем наличие виртуального документа в БД.
	//}}dm_180626	
	
	ТЗ.Сортировать("ВидДокумента,Дата Убыв");
	
	ДокОбмена.ЗаписатьНачалоЭлемента("DOCUMENTS");
	
		ДобавитьПоле(ДокОбмена, "Comment", "Подтверждения документов");
		
		СтррЗапись = Новый Структура("GUID");
		
		ИдВидДокументаМТ = Неопределено;
		
		Для Каждого СтрокаТ Из ТЗ Цикл
			
			Если СтрокаТ.ИдВидДокументаМТ <> ИдВидДокументаМТ Тогда
				
				Если ИдВидДокументаМТ <> Неопределено Тогда
					ДокОбмена.ЗаписатьКонецЭлемента(); //CONFIRMATIONS
					ДокОбмена.ЗаписатьКонецЭлемента(); //DOCUMENT
				КонецЕсли;
				ИдВидДокументаМТ = СтрокаТ.ИдВидДокументаМТ;
				ВидДокументаМТ = ВидОбъектаПоИдентификатору(ИдВидДокументаМТ, Ложь, "Документ");
				ДокОбмена.ЗаписатьНачалоЭлемента("DOCUMENT");
				ДобавитьПоле(ДокОбмена, "GUID", ИдВидДокументаМТ);
				ДобавитьПоле(ДокОбмена, "Comment", "Подтверждения документов " + ВидДокументаМТ);
				ДокОбмена.ЗаписатьНачалоЭлемента("CONFIRMATIONS");
				ДокМенеджер = ?(ВДокЭтоВиртуальныйДокумент(СтрокаТ.ВидДокумента), Неопределено, Документы[СтрокаТ.ВидДокумента]);//dm_180626
				// ^ Если ДокМенеджер = Неопределено, это значит, что нужно проверить наличие в БД виртуального документа.
			КонецЕсли;
			
			Если ПодтвержденияТолькоДляПроведенных Тогда
				//{{dm_180626
				Если ДокМенеджер = Неопределено Тогда // это виртуальный документ
					ИмяСвойства = Прав(СтрокаТ.ВидДокумента, СтрДлина(СтрокаТ.ВидДокумента)-1);
					Если стррТаблицыЖурналовВДок.Свойство(ИмяСвойства) Тогда
						тзЖурнала = стррТаблицыЖурналовВДок[ИмяСвойства];
					Иначе
						тзЖурнала = ВОТЗЗагрузить(СтрокаТ.ВидДокумента, Истина);
						стррТаблицыЖурналовВДок.Вставить(ИмяСвойства, тзЖурнала);
					КонецЕсли; 
					стзЖурнала = тзЖурнала.Найти(СтрокаТ.Идентификатор, "ID");
					Если стзЖурнала = Неопределено Тогда
					    Продолжить; // не выгружаем, документ отсуствтует в БД
					ИначеЕсли стзЖурнала.Статус <> 1 Тогда // документ не проведен (у проведенного документа статус = 1)
						Продолжить;
					КонецЕсли; 
				Иначе // это обычный документ
				//}}dm_180626
					СсылкаДок = ДокМенеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТ.Идентификатор));
					Если Не ЭтоСсылкаНаНайденныйОбъект(СсылкаДок) Тогда 
						Продолжить; // не выгружаем, документ удален в ЦБД
					ИначеЕсли Не СсылкаДок.Проведен Тогда
						Продолжить; // не выгружаем, документ не проведен
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			СтррЗапись.GUID = СтрокаТ.Идентификатор;
			ЗаписатьЭлементВДокументОбмена(ДокОбмена, СтррЗапись);
			
		КонецЦикла;
		
		Если ИдВидДокументаМТ <> Неопределено Тогда // закрываем открытые ранее теги
			ДокОбмена.ЗаписатьКонецЭлемента(); //CONFIRMATIONS
			ДокОбмена.ЗаписатьКонецЭлемента(); //DOCUMENT
		КонецЕсли;
	
	ДокОбмена.ЗаписатьКонецЭлемента(); //DOCUMENTS
	
КонецПроцедуры

// ВыгрузкаПодтверждений
#КонецОбласти

#Область ВыгрузкаСправочников

// В параметре тзКартинки из процедуры возвращается ТЗ свойств картинок, 
// которые нужно выгрузить в МУ.
Процедура ВыгрузитьСправочники(ДокОбмена, МенеджерВТ, тзКартинки)

	ДокОбмена.ЗаписатьНачалоЭлемента("CATALOGS");
	ДобавитьПоле(ДокОбмена, "Comment", "Справочники");
	
	//++Дейнеко ВГ 2017-09-18 Бухгалтерия
	ВыгрузитьОрганизации(ДокОбмена);
	ВыгрузитьВидыКонтактнойИнформации(ДокОбмена);
	ВыгрузитьВидыЦен(ДокОбмена);
	ВыгрузитьСклады(ДокОбмена, МенеджерВТ);
	ВыгрузитьКатегорииДокументов(ДокОбмена);
	ВыгрузитьСтатусыПартнеров(ДокОбмена);
	ВыгрузитьЗапросыОбновления(ДокОбмена);

	ВыгрузитьПартнеров(ДокОбмена, МенеджерВТ); //dm: Контрагенты
	ВыгрузитьКонтактныхЛицПартнеров(ДокОбмена, МенеджерВТ);
	ВыгрузитьКонтактнуюИнформацию_УТ(ДокОбмена, МенеджерВТ);
	
	ВыгрузитьСоглашения(ДокОбмена, МенеджерВТ);

	ВыгрузитьНоменклатуру(ДокОбмена, МенеджерВТ);
	ВыгрузитьЕдиницыИзмерения(ДокОбмена, МенеджерВТ);
	
	//В бух30 нет характеристик номенклатуры
	//ВыгрузитьХарактеристикиНоменклатуры(ДокОбмена, МенеджерВТ);

	ВыгрузитьПечатныеФормы(ДокОбмена); // sd_10082017
	
	//в бух30 нет НоменклатураПрисоединенныеФайлы, не нашел замену
	тзКартинки = ВыгрузитьСправочникИзображений(ДокОбмена, МенеджерВТ);
	
	ВыгрузитьИсториюПродаж(ДокОбмена, МенеджерВТ);
	
	ДокОбмена.ЗаписатьКонецЭлемента(); //CATALOGS

КонецПроцедуры

Процедура ВыгрузитьОрганизации(ДокОбмена)

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.Организации");
	стррПоля = Новый Структура("GUID,Name,A02,A03,A04,A05,A06,A07,A09,A010,A017");
		
	тзОрганизации = ТЗОрганизацииВыгрузки();
	//{{dm_180423:dm_180523
	ОбщийМодуль = ?(гКонфигурация = "Бухгалтерия_KZ", Вычислить("ПроцедурыНалоговогоУчета"), Вычислить("УчетнаяПолитика"));
	//}}dm_180423
	Для Каждого СтрокаТ Из тзОрганизации Цикл
		
		Ссылка = СтрокаТ.Ссылка;
		
		//{{dm_180424
		//КонтактнаяИнформация = КонтактнаяИнформацияОрганизации(Ссылка);
		стрКонтактнаяИнформация = КонтактнаяИнформацияОрганизации(Ссылка);
		//}}dm_180424
		
		стррПоля.GUID 	= Ссылка.Ссылка.УникальныйИдентификатор();
		стррПоля.Name 	= Ссылка.Наименование;
		//{{dm_180423
		////++Дейнеко ВГ 2017-09-15 Бухгалтерия
		////стррПоля.A02	= УчетнаяПолитика.ПлательщикНДС(Ссылка, ТекущаяДата()) И НЕ УчетнаяПолитика.ПрименяетсяОсвобождениеОтУплатыНДС(Ссылка, ТекущаяДата());;
		////Замена
		////стррПоля.A02	= УчетнаяПолитикаПереопределяемый.ПлательщикНДС(Ссылка, ТекущаяДата()) И НЕ УчетнаяПолитикаПереопределяемый.ПрименяетсяОсвобождениеОтУплатыНДС(Ссылка, ТекущаяДата());
		////--Дейнеко ВГ 2017-09-15
		Если гКонфигурация = "Бухгалтерия_KZ" Тогда
			стррПоля.A02	= ОбщийМодуль.ПолучитьПризнакПлательщикаНДС(Ссылка, ТекущаяДата());
		Иначе
			стррПоля.A02	= ОбщийМодуль.ПлательщикНДС(Ссылка, ТекущаяДата());
		КонецЕсли;
		//}}dm_180423
		
		стррПоля.A03	= стрКонтактнаяИнформация.ЮрАдрес; //КонтактнаяИнформация.ЮрАдрес;  //dm_180424
		стррПоля.A04	= стрКонтактнаяИнформация.Телефон;  //КонтактнаяИнформация.Телефон;  //dm_180424
		стррПоля.A05	= СтрокаТ.ИНН;
		стррПоля.A06	= СтрокаТ.КПП;
		стррПоля.A07	= СтрокаТ.ОГРН;
		стррПоля.A09	= стрКонтактнаяИнформация.ФактАдрес;  //КонтактнаяИнформация.ФактАдрес;  //dm_180424
		стррПоля.A010	= ПрефиксОрганизацииИБ(СтрокаТ.Префикс);
		стррПоля.A017	= СокрЛП(СтрокаТ.НаименованиеПолное);
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
		
	КонецЦикла;

	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);

КонецПроцедуры

Процедура ВыгрузитьВидыКонтактнойИнформации(ДокОбмена)

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.ВидыКонтактнойИнформации");

	ТипыКИ = ТипыКонтактнойИнформации();
	ВидыКИ = ВидыКонтактнойИнформацииВыгрузки();
	//{{dm_180424:dm_180523
	СправочникВидыКИ = ?(гКонфигурация = "Бухгалтерия_KZ", ПолучитьСпрВидыКИ(), Справочники.ВидыКонтактнойИнформации);
	//}}dm_180424
	стррПоля = Новый Структура("GUID,Name,A02,A03");
	
	Для Каждого Элемент Из ВидыКИ Цикл
		стррПоля.GUID 	= Элемент.Ссылка.УникальныйИдентификатор();
		стррПоля.Name 	= Элемент.Наименование;
		//{{dm_180425
		//стррПоля.A02	= ТипыКИ.Получить(Элемент.Тип);
		стррПоля.A02	= ТипыКИ.Получить(Элемент.ТипКИ);
		//}}dm_180425
		//++Дейнеко ВГ 2017-09-19 Бухгалтерия
		Если Элемент.Родитель = СправочникВидыКИ.СправочникКонтрагенты И Не ИспользоватьПунктыРазгрузки Тогда
			стррПоля.A03 = "Контрагенты";
		ИначеЕсли Элемент.Родитель = СправочникВидыКИ.СправочникКонтактныеЛица Тогда
			стррПоля.A03 = "КонтактныеЛица";
		ИначеЕсли Элемент.Родитель = СправочникВидыКИ.СправочникКонтрагенты Тогда 
			стррПоля.A03 =  ?(ИспользоватьПунктыРазгрузки, "Контрагенты", "ТорговыеТочки");
		ИначеЕсли ИспользоватьПунктыРазгрузки И Элемент.Родитель = СправочникВидыКИ.СправочникАлкПунктыРазгрузки Тогда
			стррПоля.A03 = "ТорговыеТочки";
		Иначе
			Продолжить;
		КонецЕсли;
		//Замена
		//Если Элемент.Родитель = СправочникВидыКИ.СправочникПартнеры И Не ИспользоватьПунктыРазгрузки Тогда
		//	стррПоля.A03 = "Контрагенты";
		//ИначеЕсли Элемент.Родитель = СправочникВидыКИ.СправочникКонтактныеЛицаПартнеров Тогда
		//	стррПоля.A03 = "КонтактныеЛица";
		//ИначеЕсли Элемент.Родитель = СправочникВидыКИ.СправочникКонтрагенты Тогда 
		//	стррПоля.A03 =  ?(ИспользоватьПунктыРазгрузки, "Контрагенты", "ТорговыеТочки");
		//ИначеЕсли ИспользоватьПунктыРазгрузки И Элемент.Родитель = СправочникВидыКИ.СправочникАлкПунктыРазгрузки Тогда
		//	стррПоля.A03 = "ТорговыеТочки";
		//Иначе
		//	Продолжить;
		//КонецЕсли;
		//--Дейнеко ВГ 2017-09-19 Бухгалтерия
		
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
	КонецЦикла;

	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);

КонецПроцедуры

Процедура ВыгрузитьВидыЦен(ДокОбмена)

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.ТипыЦен");

	мЭлементы = ВидыЦенВыгрузки();
	стррПоля = Новый Структура("GUID,Name,Code,A02");
	Сч = 0;
	
	Для Каждого Элемент Из мЭлементы Цикл
		стррПоля.GUID = Элемент.Ссылка.УникальныйИдентификатор();
		стррПоля.Name = Элемент.Наименование;
		стррПоля.Code = Сч;
		стррПоля.A02  = Элемент.ЦенаВключаетНДС;
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
		Сч = Сч + 1;
	КонецЦикла;
	
	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);

КонецПроцедуры

Процедура ВыгрузитьСклады(ДокОбмена, МенеджерВТ)

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.Склады");
	
	гСоотвСклады = Новый Соответствие; //dm_180904

	ВыгружаемыеСклады = СкладыВыгрузки(МенеджерВТ);
	Сч = 0;
	Для Каждого ЭлементСписка Из ВыгружаемыеСклады Цикл
		гСоотвСклады.Вставить(ЭлементСписка, Сч); //dm_180904
		СтруктураПолей = ПредопределенныеПоляСправочника(ЭлементСписка);
		СтруктураПолей.Вставить("Code", Сч);
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, СтруктураПолей);
		Сч = Сч + 1;
	КонецЦикла;

	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);

КонецПроцедуры

Процедура ВыгрузитьКатегорииДокументов(ДокОбмена)
	
	Если Не ВременныеТаблицы.Свойство("КатегорииДокументов") Тогда // значит категории документов не задавались
		Возврат;
	КонецЕсли;
	
	Категории = ВременныеТаблицы.КатегорииДокументов;

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.КатегорииДокументов");
	
	СтррПоля = Новый Структура("GUID,Name,A02,A03");

	Для Каждого ЭлементКатегории Из Категории Цикл
		СтррПоля.GUID = ЭлементКатегории.Идентификатор;
		СтррПоля.Name = ЭлементКатегории.Наименование;
		СтррПоля.A02  = ЦветВСтроку(ЭлементКатегории.Цвет);
		СтррПоля.A03  = СтрСоединить_(ЭлементКатегории.СписокДокументов.ВыгрузитьЗначения(), ",");
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, СтррПоля);
	КонецЦикла;

	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);

КонецПроцедуры

Процедура ВыгрузитьСтатусыПартнеров(ДокОбмена)

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.СтатусыКонтрагентов");
	стррПоля = Новый Структура("GUID,Name,A02,A03"); // gi_170902 объявление структуры вынесено за цикл

	ВыгружаемыеСтатусы = СтатусыПартнеровВыгрузки();
	Для Каждого ЭлементСтатуса Из ВыгружаемыеСтатусы Цикл
		стррПоля.GUID = ЭлементСтатуса.Идентификатор;
		стррПоля.Name = ЭлементСтатуса.Наименование;
		стррПоля.A02  = ЭлементСтатуса.Предупреждение;
		стррПоля.A03  = ЦветВСтроку(ЭлементСтатуса.Цвет);
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
	КонецЦикла;

	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);

КонецПроцедуры

Процедура ВыгрузитьЗапросыОбновления(ДокОбмена)

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.Запросы");
	стррПоля = Новый Структура("GUID,Name"); // gi_170902 объявление структуры вынесено за цикл

	ВыгружаемыеЗапросы = ЗапросыОбновления();
	Для Каждого ЭлементЗапроса Из ВыгружаемыеЗапросы Цикл
		стррПоля.GUID = ЭлементЗапроса.Идентификатор;
		стррПоля.Name = ЭлементЗапроса.Наименование;
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
	КонецЦикла;

	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);

КонецПроцедуры

Процедура ВыгрузитьПартнеров(ДокОбмена, МенеджерВТ)

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.Контрагенты"); // в МТ этот справочник называется "Контрагенты"
	
	 РезультатВыборкиПартнеров = ДанныеПоПартнерамДляВыгрузки(МенеджерВТ);
	
	Выборка = РезультатВыборкиПартнеров.Выбрать();
	
	стррПоля = Новый Структура("GUID,Name,GrpId0,A06,A012,A023");
	//{{dm_180515
	Пока Выборка.Следующий() Цикл
		ВыборкаСсылка = Выборка.Ссылка;
		Если НЕ ВыборкаСсылка.ЭтоГруппа Тогда
			ВыборкаРодитель = ВыборкаСсылка.Родитель;
			УИД = ВыборкаРодитель.УникальныйИдентификатор();
			стррПоля.GUID = ВыборкаСсылка.УникальныйИдентификатор();
			стррПоля.Name = ВыборкаСсылка.Наименование;
			стррПоля.A06 = Выборка.Статус;
			стррПоля.A012 = СокрЛП(ВыборкаСсылка.НаименованиеПолное);
			стррПоля.A023 = ВыборкаСсылка.Комментарий;
		    стррПоля.GrpId0 = ?(ЗначениеЗаполнено(ВыборкаРодитель), УИД, "");
			ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
		КонецЕсли;
	КонецЦикла;
	//}}dm_180515
	
	ДокОбмена.ЗаписатьКонецЭлемента(); 
	
	ВыгрузитьГруппировкиПартнеров(ДокОбмена, МенеджерВТ);
	
	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);

КонецПроцедуры

Процедура ВыгрузитьКонтактныхЛицПартнеров(ДокОбмена, МенеджерВТ)

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.КонтактныеЛица");

	РезультатВыборкиКонтактныхЛиц = ДанныеПоКонтактнымЛицамПартнеровВыгрузки(МенеджерВТ);
	ВыгружаемыеКонтактныеЛица = РезультатВыборкиКонтактныхЛиц.Выбрать();
	Пока ВыгружаемыеКонтактныеЛица.Следующий() Цикл
		СтруктураПолей = ПредопределенныеПоляСправочника(ВыгружаемыеКонтактныеЛица.Ссылка);
		СтруктураПолей.Вставить("A03", ВыгружаемыеКонтактныеЛица.Партнер);
		//++Дейнеко ВГ 2017-09-22 Бухгалтерия
		//СтруктураПолей.Вставить("A05", ВыгружаемыеКонтактныеЛица.Описание);
		//Замена
		СтруктураПолей.Вставить("A05", ВыгружаемыеКонтактныеЛица.Комментарий);
		//--Дейнеко ВГ 2017-09-22 Бухгалтерия
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, СтруктураПолей);
	КонецЦикла;

	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);

КонецПроцедуры

Процедура ВыгрузитьКонтактнуюИнформацию_УТ(ДокОбмена, МенеджерВТ)

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.КонтактнаяИнформация");

	ствТипыКИ = ТипыКонтактнойИнформации();
	стррПоля = Новый Структура("GUID,A01,A02,A03,A04,A05,A06");
	
	РезультатЗапроса = ДанныеПоКонтактамПартнеровИКонтактныхЛицВыгрузки(МенеджерВТ);
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стррПоля.GUID = Новый УникальныйИдентификатор();
		стррПоля.A01 = Выборка.Партнер;
		стррПоля.A02 = ?(ИспользоватьКонтрагентов, Выборка.Контрагент, "");
		стррПоля.A03 = Выборка.КонтактноеЛицо;
		стррПоля.A04 = ствТипыКИ[Выборка.Тип];
		стррПоля.A05 = Выборка.Вид;
		стррПоля.A06 = Выборка.Представление;
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
	КонецЦикла;

	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);

КонецПроцедуры

//dm_170925:Внесены изменения
Процедура ВыгрузитьСоглашения(ДокОбмена, МенеджерВТ)

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.Договоры");
	
	стррПоля = Новый Структура("GUID,Name,A02,A03,A04,A05,A06,A07,A010");

	//{{dm_180423:dm_180523
	ОбщийМодуль = ?(гКонфигурация = "Бухгалтерия_KZ", Вычислить("ПроцедурыНалоговогоУчета"), Вычислить("УчетнаяПолитика"));
	//}}dm_180423
	
	РезультатВыборкиСоглашений = ДанныеПоСоглашениямВыгрузки(МенеджерВТ);
	Выборка = РезультатВыборкиСоглашений.Выбрать();
	Пока Выборка.Следующий() Цикл
		стррПоля.GUID 	= Выборка.Ссылка.УникальныйИдентификатор();
		стррПоля.Name 	= Выборка.Наименование;
		стррПоля.A02	= Выборка.Контрагент; //dm_170925:Вместо Выборка.Партнер
		стррПоля.A03	= Выборка.Дата;
		стррПоля.A04	= Выборка.ДатаОкончанияДействия;
		стррПоля.A05	= Выборка.Организация;
		стррПоля.A06	= Выборка.ТипЦен; //dm_170925:Вместо Выборка.ВидЦен
		//dm_170925: Т.к. в Бух30 в Договоре нет реквизита НалогообложениеНДС,
		// то условие ИспользоватьНДС (поле А07) берём из учетной политики Организации,
		// от имени которой заключается договор, то есть Если Организация является ПлательщикНДС Тогда ИспользоватьНДС
		//{{dm_180423
		Если гКонфигурация = "Бухгалтерия_KZ" Тогда 
			стррПоля.A07	= ОбщийМодуль.ПолучитьПризнакПлательщикаНДС(Выборка.Организация, ТекущаяДата());
		Иначе
			стррПоля.A07	= ОбщийМодуль.ПлательщикНДС(Выборка.Организация, ТекущаяДата());
		КонецЕсли;
		//}}dm_180423
		Если ИспользоватьКонтрагентов Тогда
			стррПоля.A010	= Выборка.Контрагент;
		КонецЕсли;
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
	КонецЦикла;

	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);

КонецПроцедуры

//++Дейнеко ВГ 2017-09-21 Бухгалтерия
//Тестовая функция для просмотра временных таблиц
Функция ПроверитьВремТаб(МенеджерВремТаб,ИмяВремтаб ="",Порядок = "") Экспорт

Запрос = Новый Запрос;
Запрос.МенеджерВременныхТаблиц = МенеджерВремТаб;
Запрос.Текст =
"ВЫБРАТЬ
| *
|ИЗ
| ВремТаб КАК ВВремТаб
|
|";

//УПОРЯДОЧИТЬ ПО Порядок

Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВремТаб",ИмяВремтаб);

//Если Порядок = "" тогда 
//    Запрос.Текст = СтрЗаменить(Запрос.Текст,"УПОРЯДОЧИТЬ ПО Порядок","");
//Иначе 
//    Запрос.Текст = СтрЗаменить(Запрос.Текст,"Порядок",Порядок);
//КонецЕсли; 

ТЗ = Запрос.Выполнить().Выгрузить(); 

Возврат ТЗ;

КонецФункции

//--Дейнеко ВГ 2017-09-20 Бухгалтерия

//{{dm_180517 : vd_180326
Функция ПолучитьКоличествоСтрокТЧНоменклатуры(КоличествоЕдиниц, КоличествоАтрибутов)
	
	Если КоличествоЕдиниц <= КоличествоАтрибутов Тогда
		Возврат 0;
	КонецЕсли;
	
	СтрокВТабличнойЧасти = КоличествоЕдиниц/КоличествоАтрибутов;
	
	ЦелаяЧасть 	 = Цел(СтрокВТабличнойЧасти);
	//ДробнаяЧасть = СтрокВТабличнойЧасти - ЦелаяЧасть;
	//
	//Если ДробнаяЧасть = 0 Тогда
	//	Возврат ЦелаяЧасть - 1;
	//Иначе
	//	Возврат ЦелаяЧасть;
	//КонецЕсли;
	
	//dm_180817: Упрощение кода от gi(CodeReview_180810):
	Если КоличествоЕдиниц % КоличествоАтрибутов = 0 Тогда
		Возврат ЦелаяЧасть - 1;
	Иначе
		Возврат ЦелаяЧасть;
	КонецЕсли;
	
КонецФункции
//}}dm_180517

Процедура ВыгрузитьНоменклатуру(ДокОбмена, МенеджерВТ)
	
	//(( sk_190718 Изменена процедура выгрузки в рамках (MOD-236)
	////++Дейнеко ВГ 2017-09-19 Бухгалтерия
	//ВыгружатьХарактеристики					  = Ложь;
	//КонстантаИспользоватьУпаковкиНоменклатуры = Ложь;
	////Дейнеко ВГ 2017-09-19 Бухгалтерия
	//
	//СчЭлементов = 0;
	//ДоступныеВидыЦен = ВидыЦенВыгрузки();
	//ДоступныеСклады  = СкладыВыгрузки(МенеджерВТ);
	//
	//КоличествоРеквизитовЦен = 10;
	//КоличествоРеквизитовОстатков = 5;
	//ВсегоВидовЦен = ДоступныеВидыЦен.Количество();
	//ВсегоСкладов = ДоступныеСклады.Количество();
	//стррОбнуления = Новый Структура("A020, A021, A022, A023, A024, A025, A026, A027, A028, A029, A030, A031, A032, A033, A034"); //dm_180903
	//
	////{{dm_180517
	//СтрокВТабличнойЧасти = ПолучитьКоличествоСтрокТЧНоменклатуры(ВсегоСкладов, КоличествоРеквизитовОстатков); // исправление бага 36047 (vd_180326)
	////}}dm_180517
	//Если СтрокВТабличнойЧасти = 0 Тогда
	//	стррТЧОстатки = Неопределено;
	//Иначе
	//	стррТЧОстатки = Новый Структура("GUID,Comment,КоличествоСтрок,ПолеВыгрузки,КоличествоРеквизитов,ИмяПоля,Номенклатура,ВыборкаЭлементов");
	//	стррТЧОстатки.GUID	   		   	= "af0a6972-4bca-4652-a3cf-8ebc1ed1ee0d";
	//	стррТЧОстатки.Comment	   	   	= "Остатки";	
	//	стррТЧОстатки.КоличествоСтрок  	= СтрокВТабличнойЧасти;
	//	стррТЧОстатки.ПолеВыгрузки 	   	= "A06";
	//	стррТЧОстатки.КоличествоРеквизитов = КоличествоРеквизитовОстатков;
	//	стррТЧОстатки.ИмяПоля 		   	= "Остаток";
	//КонецЕсли;
	//
	////{{dm_180517
	//СтрокВТабличнойЧасти = ПолучитьКоличествоСтрокТЧНоменклатуры(ВсегоВидовЦен, КоличествоРеквизитовЦен); // исправление бага 36047 (vd_180326)
	////}}dm_180517
	//Если СтрокВТабличнойЧасти = 0 Тогда
	//	стррТЧЦены = Неопределено;
	//Иначе
	//	стррТЧЦены = Новый Структура("GUID,Comment,КоличествоСтрок,ПолеВыгрузки,КоличествоРеквизитов,ИмяПоля,Номенклатура,ВыборкаЭлементов");
	//	стррТЧЦены.GUID	   		   	  	= "7f72aed2-94f7-4165-b112-c7a69fea70cc";
	//	стррТЧЦены.Comment	   	   		= "Цены";
	//	стррТЧЦены.КоличествоСтрок 		= СтрокВТабличнойЧасти;
	//	стррТЧЦены.ПолеВыгрузки 	  	= "A011";
	//	стррТЧЦены.КоличествоРеквизитов = КоличествоРеквизитовЦен;
	//	стррТЧЦены.ИмяПоля 		   		= "Цена";
	//КонецЕсли;
	//
	//ВыгружатьТабличныеЧасти = стррТЧОстатки <> Неопределено	Или стррТЧЦены <> Неопределено;
	//
	//стррПоля = Новый Структура("GUID,Name,Code,GrpId0,GrpId1,A02,A03,A04,A05,A06,A08,A011,A013,A014,A015,A035,A037,A041,A042,A043,A044,A045,A046,A048,A050,A053");
	//
	// Запрос = ЗапросПоНоменклатуре(МенеджерВТ, ДоступныеВидыЦен);
	//Результаты = Запрос.ВыполнитьПакет();
	//
	////++Дейнеко ВГ 2017-09-19 Бухгалтерия
	////Добавили один запрос для получения остатков
	//ВерсияБух = Метаданные.Имя; //БухгалтерияПредприятияБазовая
	////ВерсияБух = "БухгалтерияПредприятияБазовая";
	//Если ВерсияБух = "БухгалтерияПредприятияБазовая" Тогда //ИЛИ ВерсияБух = "БухгалтерияПредприятия" Тогда
	//	ВыборкаОстатков = Результаты[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Иначе
	//	ВыборкаОстатков = Результаты[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//КонецЕсли;
	//
	//ВыборкаЦен = Результаты[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	//ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.Номенклатура");
	//
	//
	//Пока ВыборкаОстатков.Следующий() Цикл
	//	ВыборкаЦен.Следующий();
	//	СчЭлементов = СчЭлементов + 1;
	//
	//	ТекНоменклатура = ВыборкаОстатков.Номенклатура;
	//	ЕдиницыИзмерения = ЕдиницыИзмеренияНоменклатуры(ТекНоменклатура, КонстантаИспользоватьУпаковкиНоменклатуры);
	//
	//	Если ВыгружатьХарактеристики Тогда
	//		УчетПоХарактеристикам = ВыборкаОстатков.УчетПоХарактеристикам;
	//	Иначе
	//		УчетПоХарактеристикам = Ложь;
	//	КонецЕсли;
	//	
	//	стррПоля.GUID = ТекНоменклатура.Ссылка.УникальныйИдентификатор();
	//	стррПоля.Name = ТекНоменклатура.Наименование;
	//	стррПоля.Code = ВыборкаОстатков.Код;
	//	
	//	стррПоля.A02 = ВыборкаОстатков.Родитель;
	//	//++Дейнеко ВГ 2017-09-15 Бухгалтерия
	//	//{{dm_171018
	//	СтавкаНДСЧислом = ПолучитьСтавкуНДСЧислом(ВыборкаОстатков.СтавкаНДС);
	//	стррПоля.A04 = ?(СтавкаНДСЧислом = Неопределено, 0, СтавкаНДСЧислом) * 100;
	//	//}}dm_171018
	//	//--Дейнеко ВГ 2017-09-15 Бухгалтерия
	//	стррПоля.A05 = ВыборкаОстатков.ВидНоменклатуры;
	//	// В реквизите A06 передается базовая единица измерения, относительно которой пересчитываются другие единицы
	//	стррПоля.A06 = ЕдиницыИзмерения.БазоваяЕдиница;
	//	стррПоля.A08 = УчетПоХарактеристикам;
	//	стррПоля.A011 = ВыборкаОстатков.Остаток;
	//	// В реквизите A013 указывается единица измерения, в которой отображаются остатки товаров в форме подбора в мобильном устройстве
	//	стррПоля.A013 = ЕдиницыИзмерения.БазоваяЕдиница;
	//	стррПоля.A014 = ВыборкаОстатков.Весовой;
	//	стррПоля.A015 = ВыборкаОстатков.ЭтоУслуга;
	//	стррПоля.A035 = ВыборкаОстатков.НаименованиеПолное;
	//	стррПоля.A037 = ВыборкаОстатков.Остаток > 0;
	//	стррПоля.A041 = ВыборкаОстатков.ОстатокМобСклада;
	//	стррПоля.A042 = СокрЛП(ВыборкаОстатков.Описание);
	//	
	//	//++Дейнеко ВГ 2017-09-20 Бухгалтерия
	//	//Не передаем картинку
	//	//стррПоля.A043 = ТекНоменклатура.ФайлКартинки;
	//	//++Дейнеко ВГ 2017-09-20 Бухгалтерия
	//	стррПоля.A044 = СчЭлементов;
	//	стррПоля.A045 = ""; //алкоголь
	//	стррПоля.A046 = ""; //дата розлива
	//	стррПоля.A048 = ВыборкаОстатков.ЦеноваяГруппа;
	//	// В реквизите A050 передаем единицу цены. В эту единицу пересчитывается цена товара (относительно базовой) в форме подбора в МУ 
	//	// Если ее не выгружать в файл обмена, то цены будут пересчитываться в базовые единицы
	//	стррПоля.A050 = ЕдиницыИзмерения.БазоваяЕдиница; //единица цены
	//	стррПоля.A053 = ЕдиницыИзмерения.НаборУпаковок;
	//
	//	ДетальныеОстатки = ВыборкаОстатков.Выбрать();
	//	ДетальныеЦены = ВыборкаЦен.Выбрать();
	//	ЗаполнитьЗначенияСвойств(стррПоля, стррОбнуления); //dm_180903
	//	ВыгрузитьПоляВЭлемент(стррПоля, ДетальныеЦены, КоличествоРеквизитовЦен, "Цена", "A02");
	//	ВыгрузитьПоляВЭлемент(стррПоля, ДетальныеОстатки, КоличествоРеквизитовОстатков, "Остаток", "A03");
	//
	//	стррПоля.GrpId0 = ?(ЗначениеЗаполнено(ВыборкаОстатков.Родитель), 		ВыборкаОстатков.Родитель, "");
	//	стррПоля.GrpId1 = ?(ЗначениеЗаполнено(ВыборкаОстатков.ВидНоменклатуры), ВыборкаОстатков.ВидНоменклатуры, "");
	//
	//	ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля, Ложь);
	//
	//	Если ВыгружатьТабличныеЧасти Тогда
	//		
	//		ДокОбмена.ЗаписатьНачалоЭлемента("TABLES");
	//		
	//		Если стррТЧОстатки <> Неопределено Тогда
	//			ЗаписатьНачалоТабличнойЧасти(ДокОбмена, стррТЧОстатки);
	//			стррТЧОстатки.Номенклатура = ТекНоменклатура;
	//			стррТЧОстатки.ВыборкаЭлементов = ДетальныеОстатки;
	//			ВыгрузитьПоляТабличнойЧастиНоменклатуры(ДокОбмена, стррТЧОстатки);
	//			ЗаписатьОкончаниеТабличнойЧасти(ДокОбмена);
	//		КонецЕсли;
	//
	//		Если стррТЧЦены <> Неопределено Тогда
	//			ЗаписатьНачалоТабличнойЧасти(ДокОбмена, стррТЧЦены);
	//			стррТЧЦены.Номенклатура = ТекНоменклатура;
	//			стррТЧЦены.ВыборкаЭлементов = ДетальныеЦены;
	//			ВыгрузитьПоляТабличнойЧастиНоменклатуры(ДокОбмена, стррТЧЦены);
	//			ЗаписатьОкончаниеТабличнойЧасти(ДокОбмена);
	//		КонецЕсли;
	//		
	//		ДокОбмена.ЗаписатьКонецЭлемента(); //TABLES
	//		
	//	КонецЕсли;
	//	
	//	ДокОбмена.ЗаписатьКонецЭлемента();
	//	
	//КонецЦикла;
	//
	//ДокОбмена.ЗаписатьКонецЭлемента();
	//ВыгрузитьГруппировкиНоменклатуры(ДокОбмена, МенеджерВТ);
    //
	//ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);
	
	СчЭлементов = 0;
	ДоступныеВидыЦен = ВидыЦенВыгрузки();
	ДоступныеСклады  = СкладыВыгрузки(МенеджерВТ);

	КоличествоРеквизитовЦен = 10;
	КоличествоРеквизитовОстатков = 5;
	ВсегоВидовЦен = ДоступныеВидыЦен.Количество();
	ВсегоСкладов  = ДоступныеСклады.Количество();
	стррОбнуления = Новый Структура("A020, A021, A022, A023, A024, A025, A026, A027, A028, A029, A030, A031, A032, A033, A034");
	
	СтрокВТабличнойЧасти = ПолучитьКоличествоСтрокТЧНоменклатуры(ВсегоСкладов, КоличествоРеквизитовОстатков);

	Если СтрокВТабличнойЧасти = 0 Тогда
		стррТЧОстатки = Неопределено;
	Иначе
		стррТЧОстатки = Новый Структура("GUID,Comment,КоличествоСтрок,ПолеВыгрузки,КоличествоРеквизитов,ИмяПоля,Номенклатура,ВыборкаЭлементов");
		стррТЧОстатки.GUID	   		   	= "af0a6972-4bca-4652-a3cf-8ebc1ed1ee0d";
		стррТЧОстатки.Comment	   	   	= "Остатки";	
		стррТЧОстатки.КоличествоСтрок  	= СтрокВТабличнойЧасти;
		стррТЧОстатки.ПолеВыгрузки 	   	= "A06";
		стррТЧОстатки.КоличествоРеквизитов = КоличествоРеквизитовОстатков;
		стррТЧОстатки.ИмяПоля 		   	= "Остаток";
	КонецЕсли;
	
	СтрокВТабличнойЧасти = ПолучитьКоличествоСтрокТЧНоменклатуры(ВсегоВидовЦен, КоличествоРеквизитовЦен);
	
	Если СтрокВТабличнойЧасти = 0 Тогда
		стррТЧЦены = Неопределено;
	Иначе
		стррТЧЦены = Новый Структура("GUID,Comment,КоличествоСтрок,ПолеВыгрузки,КоличествоРеквизитов,ИмяПоля,Номенклатура,ВыборкаЭлементов");
		стррТЧЦены.GUID	   		   	  	= "7f72aed2-94f7-4165-b112-c7a69fea70cc";
		стррТЧЦены.Comment	   	   		= "Цены";
		стррТЧЦены.КоличествоСтрок 		= СтрокВТабличнойЧасти;
		стррТЧЦены.ПолеВыгрузки 	  	= "A011";
		стррТЧЦены.КоличествоРеквизитов = КоличествоРеквизитовЦен;
		стррТЧЦены.ИмяПоля 		   		= "Цена";
	КонецЕсли;
	
	флВыгружатьТабличныеЧасти = стррТЧОстатки <> Неопределено	Или стррТЧЦены <> Неопределено;
	
	стррПоля = Новый Структура("GUID,Name,Code,GrpId0,GrpId1,A02,A03,A04,A05,A06,A08,A011,A013,A014,A015,A035,A037,A041,A042,A043,A044,A045,A046,A048,A050,A053");
	
	МенеджерВТОстатки(МенеджерВТ);          // Создает ВТ_Остатки
	МенеджерВТНоменклатура(МенеджерВТ); 	// Создает ВТ_Номенклатура
	МенеджерВТЦеныНоменклатуры(МенеджерВТ); // Создает ВТ_Цены
	
	ВыборкаНоменклатура = ДанныеПоНоменклатуре(МенеджерВТ).Выбрать();
	ВыборкаОстатков 	= ДанныеПоОстаткамНоменклатуры(МенеджерВТ).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаЦен 			= ДанныеПоЦенамНоменклатуры(МенеджерВТ).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.Номенклатура");
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		ВыборкаОстатков.Следующий();
		ВыборкаЦен.Следующий();
		
		СчЭлементов = СчЭлементов + 1;
		
		текНоменклатура = ВыборкаНоменклатура.Номенклатура;
		
		текБазоваяЕдиницаИзмерения = ВыборкаНоменклатура.БазоваяЕдиницаИзмерения;
		
		стррПоля.GUID = текНоменклатура.Ссылка.УникальныйИдентификатор();
		стррПоля.Name = ВыборкаНоменклатура.Наименование;
		стррПоля.Code = ВыборкаНоменклатура.Код;
		стррПоля.A02  =  ВыборкаНоменклатура.Родитель;
		
		СтавкаНДСЧислом = ПолучитьСтавкуНДСЧислом(ВыборкаНоменклатура.СтавкаНДС);
		стррПоля.A04  = ?(СтавкаНДСЧислом = Неопределено, 0, СтавкаНДСЧислом) * 100;
		стррПоля.A05  = ВыборкаНоменклатура.ВидНоменклатуры;
		// В реквизите A06 передается базовая единица измерения, относительно которой пересчитываются другие единицы
		стррПоля.A06  = текБазоваяЕдиницаИзмерения;
		стррПоля.A08  = ВыборкаНоменклатура.УчетПоХарактеристикам;
		стррПоля.A011 = ВыборкаОстатков.Остаток;
		// В реквизите A013 указывается единица измерения, в которой отображаются остатки товаров в форме подбора в мобильном устройстве
		стррПоля.A013 = текБазоваяЕдиницаИзмерения;
		стррПоля.A014 = ВыборкаНоменклатура.Весовой;
		стррПоля.A015 = ВыборкаНоменклатура.ЭтоУслуга;
		стррПоля.A035 = ВыборкаНоменклатура.НаименованиеПолное;
		стррПоля.A037 = ВыборкаОстатков.Остаток > 0;
		стррПоля.A041 = ВыборкаОстатков.ОстатокНаБорту;
		стррПоля.A042 = СокрЛП(ВыборкаНоменклатура.Описание);
		стррПоля.A044 = СчЭлементов;	
		стррПоля.A045 = ""; // Алкоголь
		стррПоля.A046 = ""; // Дата розлива
		стррПоля.A048 = ВыборкаНоменклатура.ЦеноваяГруппа;
		// В реквизите A050 передаем единицу цены. В эту единицу пересчитывается цена товара (относительно базовой) в форме подбора в МУ 
		// Если ее не выгружать в файл обмена, то цены будут пересчитываться в базовые единицы
		стррПоля.A050 = текБазоваяЕдиницаИзмерения; // Единица цены
		
		ДетальныеОстатки = ВыборкаОстатков.Выбрать();
		ДетальныеЦены    = ВыборкаЦен.Выбрать();
		
		ЗаполнитьЗначенияСвойств(стррПоля, стррОбнуления);
		
		// Цены
		// A020 - A029
		сч = 0;
		Пока ДетальныеЦены.Следующий() Цикл
			стррПоля.Вставить("A02" + Строка(сч), ДетальныеЦены.Цена);	
			Если сч = 9 Тогда
				Прервать;
			Иначе
				сч = сч + 1;
			КонецЕсли;
		КонецЦикла;
		
		// Остатки
		// A030 - A034
		сч = 0;
		Пока ДетальныеОстатки.Следующий() Цикл
			стррПоля.Вставить("A03" + Строка(сч), ДетальныеОстатки.Остаток);	
			Если сч = 4 Тогда
				Прервать;
			Иначе
				сч = сч + 1;
			КонецЕсли;
		КонецЦикла;
		
		стррПоля.GrpId0 = ?(ЗначениеЗаполнено(ВыборкаНоменклатура.Родитель), 		ВыборкаНоменклатура.Родитель, "");
		стррПоля.GrpId1 = ?(ЗначениеЗаполнено(ВыборкаНоменклатура.ВидНоменклатуры), ВыборкаНоменклатура.ВидНоменклатуры, "");

		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля, Ложь);

		Если флВыгружатьТабличныеЧасти Тогда
			
			ДокОбмена.ЗаписатьНачалоЭлемента("TABLES");
			
			Если стррТЧОстатки <> Неопределено Тогда
				ЗаписатьНачалоТабличнойЧасти(ДокОбмена, стррТЧОстатки);
				стррТЧОстатки.Номенклатура = текНоменклатура;
				стррТЧОстатки.ВыборкаЭлементов = ДетальныеОстатки;
				ВыгрузитьПоляТабличнойЧастиНоменклатуры(ДокОбмена, стррТЧОстатки);
				ЗаписатьОкончаниеТабличнойЧасти(ДокОбмена);
			КонецЕсли;
			
			Если стррТЧЦены <> Неопределено Тогда
				ЗаписатьНачалоТабличнойЧасти(ДокОбмена, стррТЧЦены);
				стррТЧЦены.Номенклатура = текНоменклатура;
				стррТЧЦены.ВыборкаЭлементов = ДетальныеЦены;
				ВыгрузитьПоляТабличнойЧастиНоменклатуры(ДокОбмена, стррТЧЦены);
				ЗаписатьОкончаниеТабличнойЧасти(ДокОбмена);
			КонецЕсли;
			
			ДокОбмена.ЗаписатьКонецЭлемента(); //TABLES
			
		КонецЕсли;
		
		ДокОбмена.ЗаписатьКонецЭлемента();


	КонецЦикла;
	
	ДокОбмена.ЗаписатьКонецЭлемента();
	ВыгрузитьГруппировкиНоменклатуры(ДокОбмена, МенеджерВТ);

	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);
	//)) sk_190718

КонецПроцедуры

Процедура ВыгрузитьГруппировкиПартнеров(ДокОбмена, МенеджерВТ)
	
	ДокОбмена.ЗаписатьНачалоЭлемента("GROUPS");

	// Элементы группировки по иерархии
	ДокОбмена.ЗаписатьНачалоЭлемента("GROUP");
	ДобавитьПоле(ДокОбмена, "GUID", "1e18c8db-08f6-47da-874b-100d6e109ab8");
	ДобавитьПоле(ДокОбмена, "Comment", "Элементы группировки по группе доступа");
	ДокОбмена.ЗаписатьНачалоЭлемента("ELEMENTS");
	
	Запрос = Новый Запрос(ТекстЗапросаВыборкиГруппПартнеров());
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	ВыборкаГрупп = Запрос.Выполнить().Выбрать();
	Пока ВыборкаГрупп.Следующий() Цикл 
		СтруктураПолей = ПредопределенныеПоляСправочника(ВыборкаГрупп);
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, СтруктураПолей);
	КонецЦикла;
	
	ДокОбмена.ЗаписатьКонецЭлемента();
	ДокОбмена.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ВыгрузитьГруппировкиНоменклатуры(ДокОбмена, МенеджерВТ)

	ДокОбмена.ЗаписатьНачалоЭлемента("GROUPS");

	// Элементы группировки по иерархии
	ДокОбмена.ЗаписатьНачалоЭлемента("GROUP");
	ДобавитьПоле(ДокОбмена, "GUID", "8e502a85-8dd4-41cf-a7a4-17ab50872d36");
	ДобавитьПоле(ДокОбмена, "Comment", "Элементы группировки по иерархии");
	ДокОбмена.ЗаписатьНачалоЭлемента("ELEMENTS");
	Запрос = Новый Запрос(ТекстЗапросаВыборкиГруппНоменклатуры());
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	ДеревоГрупп = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	РекурсивноЗаписатьГруппуСправочника(ДокОбмена, ДеревоГрупп.Строки);
	ДокОбмена.ЗаписатьКонецЭлемента();
	ДокОбмена.ЗаписатьКонецЭлемента();

	// Объявление группировки по видам номенклатуры
	ДокОбмена.ЗаписатьНачалоЭлемента("GROUP");
	ДобавитьПоле(ДокОбмена, "GUID", "e42da5b9-e29b-43e1-b7e3-9b500879d6b7");
	ДобавитьПоле(ДокОбмена, "Comment", "Элементы группировки по видам номенклатуры");
	ДокОбмена.ЗаписатьНачалоЭлемента("ELEMENTS");
	Запрос = Новый Запрос(ТекстЗапросаВыборкиВидовНоменклатуры());
	ДеревоГрупп = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	РекурсивноЗаписатьГруппуСправочника(ДокОбмена, ДеревоГрупп.Строки);
	ДокОбмена.ЗаписатьКонецЭлемента();
	ДокОбмена.ЗаписатьКонецЭлемента();

КонецПроцедуры

Процедура РекурсивноЗаписатьГруппуСправочника(ДокОбмена, Строки)

	Для каждого ТекГруппа Из Строки Цикл
		Если ЗначениеЗаполнено(ТекГруппа.Родитель)
			И ТекГруппа.Ссылка = ТекГруппа.Родитель.Ссылка Тогда
			Продолжить;
		КонецЕсли;

		СтруктураПолей = ПредопределенныеПоляСправочника(ТекГруппа);
		Если ЗначениеЗаполнено(ТекГруппа.РодительЭл) Тогда
			СтруктураПолей.Вставить("ParId", ТекГруппа.РодительЭл.УникальныйИдентификатор());
		КонецЕсли; 

		ЗаписатьЭлементВДокументОбмена(ДокОбмена, СтруктураПолей);
		РекурсивноЗаписатьГруппуСправочника(ДокОбмена, ТекГруппа.Строки);
	КонецЦикла;

КонецПроцедуры

Процедура ВыгрузитьЕдиницыИзмерения(ДокОбмена, МенеджерВТ)

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.ЕдиницыИзмерения");

	Результат = ДанныеПоЕдиницамИзмеренияВыгрузки(МенеджерВТ);
	
	стррПоля = Новый Структура("GUID,Name,Code,A02,A03,A04,A05,A06,A07");
	
	Выборка = Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл
		// для номенклатуры без упаковок вместо ссылки единицы измерения подставляем ссылку номенклатуры
		// чтобы GUID'ы единиц измерения не пересекались и была возможность передавать вес в единицу измерения 
		
		//++Дейнеко ВГ 2017-09-21 Бухгалтерия
		//Выше не мой комментарий
		//Не знаю как это работает в УТ, но в БУХ так не работает
		Если ТипЗнч(Выборка.Ссылка) = Тип("Строка") Тогда
			стррПоля.GUID = Новый УникальныйИдентификатор(Выборка.Ссылка);
		Иначе
			стррПоля.GUID = Выборка.Ссылка.УникальныйИдентификатор();
		КонецЕсли;
		//Замена
		//Если Выборка.ЭтоЕдиницаНоменклатуры Тогда
		//	стррПоля.GUID = Выборка.Номенклатура.УникальныйИдентификатор();
		//Иначе
		//	стррПоля.GUID = Выборка.Ссылка.УникальныйИдентификатор();
		//КонецЕсли;
		//++Дейнеко ВГ 2017-09-21 Бухгалтерия
		
		
		стррПоля.Name = Выборка.Наименование;
		стррПоля.Code = Выборка.КодОКЕИ;
		стррПоля.A02 = 	Выборка.Коэффициент;
		стррПоля.A03 = 	Выборка.Номенклатура;
		стррПоля.A04 = 	Выборка.Вес;
		стррПоля.A05 = 	Выборка.ЭтоНаборУпаковок;
		стррПоля.A06 = 	Выборка.ВладелецНаборУпаковок;
		стррПоля.A07 = 	Выборка.Классификатор;
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
	КонецЦикла;

	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);

КонецПроцедуры

//dm_170926 - 170927,dm_180507:dm_180523:Внесены изменения
Процедура ВыгрузитьИсториюПродаж(ДокОбмена, МенеджерВТ)
	
	Если Не ВыгружатьИсториюПродаж Или ГлубинаИсторииПродаж = 0 Или КоличествоИнтерваловИстории = 0 Тогда
		Возврат;
	КонецЕсли; 	
	
	//dm_170926:Замена
	//dm_170926:Новый текст запроса (минимальные необходимые изменения)
	
	//{{dm_180507:dm_180523
	стррЛитералы = Новый Структура("ВыборкаИзРегистра");
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррЛитералы.ВыборкаИзРегистра = "
		|	(ВЫБРАТЬ
	    |		Продажи.Регистратор.Ответственный КАК Менеджер,
	    |		Продажи.Регистратор КАК Регистратор,
		|		Продажи.Регистратор КАК Документ,
	    |		Продажи.СтруктурноеПодразделение КАК Подразделение,
	    |		Продажи.КоличествоОборот КАК Количество,
	    |		Продажи.СуммаОборот КАК Выручка,
	    |		Продажи.ПериодДень КАК День,
	    |		Продажи.ПериодНеделя КАК Неделя,
	    |		Продажи.ПериодДекада КАК Декада,
	    |		Продажи.ПериодМесяц КАК Месяц,
	    |		Продажи.ПериодКвартал КАК Квартал,
	    |		Продажи.ПериодПолугодие КАК Полугодие,
	    |		Продажи.ПериодГод КАК Год,
	    |		Продажи.Номенклатура КАК АналитикаУчетаНоменклатуры,
	    |		Продажи.ДоговорКонтрагента.Владелец КАК АналитикаУчетаПоПартнерамПартнер
	    |	ИЗ
	    |		РегистрНакопления.РеализацияТМЗ.Обороты(
	    |				&НачПериода,
	    |				&КонПериода,
	    |				Авто,
	    |				СчетУчета В (&СчетУчета)) КАК Продажи
		|  ГДЕ
		|		(Продажи.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|			ИЛИ Продажи.Регистратор ССЫЛКА Документ.АктОбОказанииПроизводственныхУслуг
		|			ИЛИ Продажи.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя)
	    |	)"
	Иначе
		стррЛитералы.ВыборкаИзРегистра = "
		|	(ВЫБРАТЬ
	    |		Продажи.Субконто3.Ответственный КАК Менеджер,
	    |		Продажи.Регистратор КАК Регистратор,
		|		ВЫБОР
		|			КОГДА Продажи.Регистратор.СчетНаОплатуПокупателю ССЫЛКА Документ.СчетНаОплатуПокупателю
		|				ТОГДА Продажи.Регистратор.СчетНаОплатуПокупателю
		|			ИНАЧЕ ВЫБОР
		|					КОГДА Продажи.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
		|						ТОГДА Продажи.Регистратор
		|					ИНАЧЕ НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|		КОНЕЦ КАК Документ,
	    |		Продажи.Подразделение КАК Подразделение,
	    |		Продажи.КоличествоКорОборот КАК Количество,
	    |		Продажи.СуммаОборот КАК Выручка,
	    |		Продажи.ПериодДень КАК День,
	    |		Продажи.ПериодНеделя КАК Неделя,
	    |		Продажи.ПериодДекада КАК Декада,
	    |		Продажи.ПериодМесяц КАК Месяц,
	    |		Продажи.ПериодКвартал КАК Квартал,
	    |		Продажи.ПериодПолугодие КАК Полугодие,
	    |		Продажи.ПериодГод КАК Год,
	    |		Продажи.КорСубконто3 КАК АналитикаУчетаНоменклатуры,
	    |		Продажи.Субконто1 КАК АналитикаУчетаПоПартнерамПартнер
	    |	ИЗ
	    |		РегистрБухгалтерии.Хозрасчетный.Обороты(
	    |				&НачПериода,
	    |				&КонПериода,
	    |				Авто,
	    |				Счет = &ВыбСчет,
		|				,
		|				,
		|				КорСчет = &ВыбКорСчет, 
	    |		) КАК Продажи
	    |	)"
	КонецЕсли;
	//}}dm_180507
	
	Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Интервалы.НачалоИнтервала,
	    |	Интервалы.КонецИнтервала,
	    |	Интервалы.НомерИнтервала
	    |ПОМЕСТИТЬ Интервалы
	    |ИЗ
	    |	&Интервалы КАК Интервалы
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ВЫБОР
	    |		КОГДА Таблица.День >= Интервалы.НачалоИнтервала
	    |				И Таблица.День <= Интервалы.КонецИнтервала
	    |			ТОГДА Интервалы.НомерИнтервала
	    |		ИНАЧЕ 0
	    |	КОНЕЦ КАК НомерИнтервала,
	    |	Таблица.АналитикаУчетаПоПартнерамПартнер КАК Партнер,
	    |	Таблица.АналитикаУчетаНоменклатуры КАК Номенклатура,
		|	СУММА(Таблица.Количество) КАК Количество,
		|	СУММА(Таблица.Выручка) КАК Выручка
	    |ИЗ
	    |	[ВыборкаИзРегистра] КАК Таблица,
	    |	Интервалы КАК Интервалы
	    |ГДЕ
	    |	ВЫБОР
	    |			КОГДА Таблица.День >= Интервалы.НачалоИнтервала
	    |					И Таблица.День <= Интервалы.КонецИнтервала
	    |				ТОГДА Интервалы.НомерИнтервала
	    |			ИНАЧЕ 0
	    |		КОНЕЦ > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.АналитикаУчетаНоменклатуры,
		|	Таблица.АналитикаУчетаПоПартнерамПартнер,
		|	ВЫБОР
		|		КОГДА Таблица.День >= Интервалы.НачалоИнтервала
		|				И Таблица.День <= Интервалы.КонецИнтервала
		|			ТОГДА Интервалы.НомерИнтервала
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИТОГИ ПО
		|	Партнер,
		|	Номенклатура";
	
	
	ЗаменитьЛитералы(Текст, стррЛитералы);
	
	КонПериода = ТекущаяДата();
	НачПериода = НачалоДня(КонПериода - ГлубинаИсторииПродаж * 86400);
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		НачПериода = НачалоДня(Дата(2011,01,01));
	КонецЕсли;
		
	тзИнтервалы = Новый ТаблицаЗначений;	
	тзИнтервалы.Колонки.Добавить("НачалоИнтервала", Новый ОписаниеТипов("Дата"));			
	тзИнтервалы.Колонки.Добавить("КонецИнтервала",  Новый ОписаниеТипов("Дата"));		
	тзИнтервалы.Колонки.Добавить("НомерИнтервала",  Новый ОписаниеТипов("Число"));
	
	РазмерИнтервала = Окр((КонПериода - НачПериода) / КоличествоИнтерваловИстории, 0, РежимОкругления.Окр15как20);
	
	НачалоИнтервала = НачПериода;
	Для Индекс = 1 По КоличествоИнтерваловИстории Цикл		
		КонецИнтервала = ?(Индекс < КоличествоИнтерваловИстории, НачалоИнтервала + РазмерИнтервала, КонПериода);
		СтрокаТ = тзИнтервалы.Добавить();
		СтрокаТ.НачалоИнтервала = НачалоИнтервала;
		СтрокаТ.КонецИнтервала  = КонецИнтервала;
		СтрокаТ.НомерИнтервала  = Индекс;
		НачалоИнтервала = КонецИнтервала;
	КонецЦикла;
	
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("НачПериода",	НачПериода);
	Запрос.УстановитьПараметр("КонПериода",	КонПериода);
	Запрос.УстановитьПараметр("Интервалы",	тзИнтервалы);
	//{{dm_180507:dm_180523
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		Запрос.УстановитьПараметр("СчетУчета", ПланыСчетовЗапасы());
	Иначе
		//{{dm_170926:Добавлены параметры запроса для получения данных в разрезе выбранных счетов
		Запрос.УстановитьПараметр("ВыбСчет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.01"));
		Запрос.УстановитьПараметр("ВыбКорСчет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("90.01.1"));
		//}}dm_170926
	КонецЕсли;
	//}}dm_180507
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.ИсторияПродаж", Истина);
	
		стррПоля = Новый Структура("GUID,A02,A04,A07,A08");
		стррПоля.A08 = 0;
		
		стррПоиск = Новый Структура("НомерИнтервала");
		
		ВыборкаПартнер = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПартнер.Следующий() Цикл
			
			ВыборкаНоменклатура = ВыборкаПартнер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);				
			Пока ВыборкаНоменклатура.Следующий() Цикл
				 						
				ВыборкаДетали = ВыборкаНоменклатура.Выбрать();
				
				стрИстория = "";
				
				Для Индекс = 1 По КоличествоИнтерваловИстории Цикл
					стррПоиск.НомерИнтервала = Индекс;
					ВыборкаДетали.Сбросить();
					Если ВыборкаДетали.НайтиСледующий(стррПоиск) Тогда
						стрИстория = СтрИстория + Формат(ВыборкаДетали.Количество, "ЧГ=0") + " ";		
					Иначе
						стрИстория = СтрИстория + "0" + " ";		
					КонецЕсли;				
				КонецЦикла;
				
				стррПоля.GUID = Новый УникальныйИдентификатор();
				стррПоля.A02 = ВыборкаНоменклатура.Партнер;
				стррПоля.A04 = ВыборкаНоменклатура.Номенклатура;
				стррПоля.A07 = СокрЛП(стрИстория);
				
				ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);				
			КонецЦикла; //Пока ВыборкаНоменклатура.Следующий() Цикл  
					
		КонецЦикла; //Пока ВыборкаПартнер.Следующий() Цикл
			
	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);
	
КонецПроцедуры //Процедура ВыгрузитьИсториюПродаж()

Функция ВыгрузитьСправочникИзображений(ДокОбмена, МенеджерВТ)
	
	Если Не ВыгружатьИзображенияТоваров И Не ВыгружатьИзображенияПартнеров Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	тзКартинки = Новый ТаблицаЗначений;
	тзКартинки.Колонки.Добавить("Ссылка");
	тзКартинки.Колонки.Добавить("Описание");
	тзКартинки.Колонки.Добавить("ИмяФайла");
	
	Текст = ТекстЗапросаПолученияИзображений();	
	Запрос = Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		
	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.ФотоСправочников");
	
	стрРасширения = "bmp;gif;png;jpeg;dib;rle;tif;jpg;ico;wmf;emf";
	стррПоля = Новый Структура("GUID,Name,A01,A02,A03");
	
	ТипХранилищеЗначения	  = Тип("ХранилищеЗначения");
	ТипСправочникНоменклатура = Тип("СправочникСсылка.Номенклатура");
	//{{dm_180518
	ТипСправочникПартнеры 	  = Тип("СправочникСсылка.Контрагенты");
	//}}180518
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 				
		
		Если ТипЗнч(Выборка.ХранимыйФайл) = ТипХранилищеЗначения Тогда
			Картинка = Выборка.ХранимыйФайл.Получить();
		Иначе
			Картинка = Неопределено;
		КонецЕсли;
		
		ВыборкаСсылка = Выборка.Ссылка;
		
		Если Найти(стрРасширения, Выборка.Расширение) = 0 Или (Картинка = Неопределено И ВыборкаСсылка.Том.Пустая()) Тогда
			Продолжить;
		КонецЕсли;	
		
		ВладелецФайла = Выборка.ВладелецФайла;
		
		Если ТипЗнч(ВладелецФайла) = ТипСправочникНоменклатура Тогда
			стррПоля.A02 = ВладелецФайла;
			стррПоля.A03 = Неопределено;
		ИначеЕсли ТипЗнч(ВладелецФайла) = ТипСправочникПартнеры Тогда
			стррПоля.A02 = Неопределено;
			стррПоля.A03 = ВладелецФайла;
		Иначе
			Продолжить;
		КонецЕсли;
		
		стррПоля.GUID = ВыборкаСсылка.УникальныйИдентификатор();
		стррПоля.Name = ВыборкаСсылка.Наименование;		
		стррПоля.A01  = ВыборкаСсылка;
		
		СтрокаТ = тзКартинки.Добавить();
		СтрокаТ.Ссылка 	 = ВыборкаСсылка;
		СтрокаТ.Описание = Выборка.Описание;
		СтрокаТ.ИмяФайла = ВРег(стррПоля.GUID) + "." + Выборка.Расширение;
		
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);	
		
	КонецЦикла;

	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);
	
	Возврат тзКартинки;

КонецФункции //Функция ВыгрузитьСправочникИзображений()

Процедура ВыгрузитьПечатныеФормы(ДокОбмена)
	
	// sd_10082017 Чтобы не хранить в базе ТЗ, генерируем ее на лету, т.к. если потребуется добавить новые ПФ, то так проще их будет добавить.
	// Также, нужно продумать как оптимизировать хранение и использование временных таблиц для служебных справочников, т.к. чем больше будем добавлять
	// таких справочников, тем хуже будет сказываться на производительности.
	тзПФД = Новый ТаблицаЗначений;
	тзПФД.Колонки.Добавить("Идентификатор");
	тзПФД.Колонки.Добавить("Наименование");
	тзПФД.Колонки.Добавить("Код");
	тзПФД.Колонки.Добавить("ВидДокумента");
	тзПФД.Колонки.Добавить("ЧислоКопий");
	тзПФД.Колонки.Добавить("Ориентация");
	
	СтрокаТ = тзПФД.Добавить();
	СтрокаТ.Идентификатор 	= Новый УникальныйИдентификатор(); // случайный идентификатор
	СтрокаТ.Наименование	= "Счет"; // Наименование справочника
	СтрокаТ.Код				= "СчетНаОплату"; // Код справочника
	СтрокаТ.ВидДокумента 	= "e070d148-8c9c-4e5f-afda-2838d5be6618"; // Вид документа "Заказ" в МТ
	СтрокаТ.ЧислоКопий 		= "1"; // Число копий
	СтрокаТ.Ориентация 		= "0"; // Ориентация страницы 0 - портрет, 1 - ландшафт
	
	стррПоля = Новый Структура("GUID,Name,Code,A01,A02,A03");
	
	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.ПечатныеФормыДокументов", Истина);
	
	Для Каждого СтрокаТ Из тзПФД Цикл 
		стррПоля.GUID	= СтрокаТ.Идентификатор;
		стррПоля.Name	= СтрокаТ.Наименование;
		стррПоля.Code	= СтрокаТ.Код;
		стррПоля.A01 	= СтрокаТ.ВидДокумента;
		стррПоля.A02 	= СтрокаТ.ЧислоКопий;
		стррПоля.A03 	= СтрокаТ.Ориентация;
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
	КонецЦикла;
	
	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);
	
	стррПоля = Новый Структура("GUID,A01,A02");
	
	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.ПечатныеФормыОрганизаций", Истина);
	
	тзОрганизации = ТЗОрганизацииВыгрузки();

	Для Каждого ТекОрганизация Из тзОрганизации Цикл
		
		Для Каждого СтрокаТ Из тзПФД Цикл 
			стррПоля.GUID	= Новый УникальныйИдентификатор();
			стррПоля.A01 	= ТекОрганизация.Ссылка;
			стррПоля.A02 	= СтрокаТ.Идентификатор;
			ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
		КонецЦикла;
		
	КонецЦикла;
	
	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);
	тзПФД.Очистить();
	
КонецПроцедуры

// Процедура выгружает ветку картинок ("PICTURES") в файл выгрузки.
// Параметры:
//		ДокОбмена  - ЗаписьXML - XML-документ выгрузки.
//		тзКартинки - Неопределено, ТаблицаЗначений - таблица свойств картинок с колонками:
//			* Ссылка - СправочникСсылка.НоменклатураПрисоединенныеФайлы или СправочникСсылка.ПартнерыПрисоединенныеФайлы
// 			* Описание - Строка - описание картинки
//  		* ИмяФайла - Строка - имя файла для записи в zip-архив
Процедура ВыгрузитьИзображения(ДокОбмена, тзКартинки)
	
	Если тзКартинки = Неопределено Или тзКартинки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	стррПоля = Новый Структура("GUID,FileName,Description");
	
	ДокОбмена.ЗаписатьНачалоЭлемента("PICTURES");
	ДобавитьПоле(ДокОбмена, "Comment", "Картинки");	
	
	ДокОбмена.ЗаписатьНачалоЭлемента("ELEMENTS");
	
	Для каждого СтрокаТ Из тзКартинки Цикл
		стррПоля.GUID		 = ВРег(СтрокаТ.Ссылка.УникальныйИдентификатор());
		стррПоля.FileName	 = СтрокаТ.ИмяФайла;
		стррПоля.Description = СтрокаТ.Описание;
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
	КонецЦикла; 	
	
	ДокОбмена.ЗаписатьКонецЭлемента(); //ELEMENTS
	ДокОбмена.ЗаписатьКонецЭлемента(); // PICTURES
	
КонецПроцедуры

// ВыгрузкаСправочников
#КонецОбласти

#Область ВыгрузкаДокументов

Процедура ВыгрузитьДокументы(ДокОбмена, МенеджерВТ)

	ДокОбмена.ЗаписатьНачалоЭлемента("DOCUMENTS");
	ДобавитьПоле(ДокОбмена, "Comment", "Документы");

	//++Дейнеко ВГ 2017-09-21 Бухгалтерия
	
	ВыгрузитьДокументыЗаказ(ДокОбмена); 
	//
	ВыгрузитьДокументыПродажи(ДокОбмена); 
	//
	ВыгрузитьДокументыДолг(ДокОбмена, МенеджерВТ);
	//
	ВыгрузитьДокументыПеремещения(ДокОбмена); // sd_22082017
	//
	ВыгрузитьМаршруты(ДокОбмена);

	//--Дейнеко ВГ 2017-09-21 Бухгалтерия
	
	Если ОчищатьДокументыПередЗагрузкой Тогда 
		// нужно выгрузить пустые тэги с атрибутом KillAll для невыгруженных видов документов, указанных в списке СписокОчищаемыхДокументов
		ИсключитьВидыДокументов = "Заказ,Долг,Реализация,Перемещение"; // // sd_22082017 добавил перемещение.
		ВыгрузитьТэгиУдаленияДокументов(ДокОбмена, СтрРазделить_(ИсключитьВидыДокументов));
	КонецЕсли;

	ДокОбмена.ЗаписатьКонецЭлемента(); //DOCUMENTS

КонецПроцедуры

Процедура ВыгрузитьТэгиУдаленияДокументов(ДокОбмена, мИсключитьВидыДокументов)
	
	Если ОчищатьДокументыПередЗагрузкой Тогда
		Для Каждого Элемент Из СписокОчищаемыхДокументов Цикл
			Если Неопределено = мИсключитьВидыДокументов.Найти(Элемент.Значение) Тогда
				ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Документ." + Элемент.Значение, 1); // с признаком удаления всех документов данного вида
				ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//++Дейнеко ВГ 2017-10-02 Весь изменен
Процедура ВыгрузитьДокументыЗаказ(ДокОбмена)
	Результат = ДанныеПоДокументамЗаказПокупателя();
	ВыборкаДок = Результат.Выбрать();
	
	СтррПоля		= Новый Структура("GUID,dt,IsPost,A02,A03,A04,A05,A06,A07,A08,A09,A010,A011,A016,A019"); // шапка документа
	стррПараметрыТЧ = Новый Структура("GUID,Comment", "0738E61B-F06F-464A-8483-4249E0254819", "Табличная часть 'Товары'");	
	стррПоляТЧ 		= Новый Структура("GUID,DocId,A01,A02,A03,A04,A05,A06,A09,A07,A08,A010,A011,A012,A015"); // ТЧ документа
	СписокЗаказов	= Новый Массив;

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Документ.Заказ");
	
	Пока ВыборкаДок.Следующий() Цикл
		
		СуммаДокумента = СуммаВВалютеУчетаАгента(ВыборкаДок.СуммаДокумента, ВыборкаДок.ВалютаДокумента, ВыборкаДок.Дата);
		//{{dm_180511
		мПодчиненныеДокументы = ПодчиненныеРеализацииДляЗаказа(ВыборкаДок.Ссылка);
		//}}dm_180511
		
		Если мПодчиненныеДокументы.Количество() > 0 Тогда 
			СписокЗаказов.Добавить(ВыборкаДок.Ссылка);
		КонецЕсли;
	
		СтррПоля.GUID	= ВыборкаДок.Ссылка.УникальныйИдентификатор();
		СтррПоля.dt		= ВыборкаДок.Дата;
		СтррПоля.IsPost = ВыборкаДок.Проведен;
		СтррПоля.A02 	= ВыборкаДок.Организация;
		СтррПоля.A03 	= ВыборкаДок.Контрагент;
		СтррПоля.A04 	= ?(ИспользоватьКонтрагентов Или ИспользоватьПунктыРазгрузки, ВыборкаДок.Контрагент, "");
		СтррПоля.A05 	= ВыборкаДок.ДоговорКонтрагента;
		СтррПоля.A06 	= ВыборкаДок.СуммаСкидки;
		СтррПоля.A07 	= ВыборкаДок.ТипЦен;
		СтррПоля.A08 	= СуммаДокумента;
		СтррПоля.A09 	= "";
		СтррПоля.A010 	= "";
		СтррПоля.A011 	= ВыборкаДок.Комментарий;
		СтррПоля.A016 	= мПодчиненныеДокументы.Количество() > 0;
		СтррПоля.A019 	= "";
		//СтррПоля.A019	= ПолучитьИдентификаторПеречисленияПоЗначению("ФормыОплаты", Перечисления.ФормыОплаты.Наличная); //Можно сделать поумолчанию чтобы была наличная
		
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, СтррПоля, Ложь);
		
		//Выборка.Сбросить();
		
		ДокОбмена.ЗаписатьНачалоЭлемента("TABLES");
		ЗаписатьНачалоТабличнойЧасти(ДокОбмена, стррПараметрыТЧ);
		
		//Тест1 = ВыборкаДок.Товары.Выбрать().Следующий();
		//Тест2 = ВыборкаДок.Ссылка.Товары;

		Для Каждого Стр Из ВыборкаДок.Ссылка.Товары Цикл
			
			//СтавкаНДС = ОбменСКонтрагентамиПереопределяемый.ПолучитьСтавкуНДСЧислом(Стр.СтавкаНДС);
			СтавкаНДС = ПолучитьСтавкуНДСЧислом(Стр.СтавкаНДС);
			Если СтавкаНДС <> Неопределено Тогда
				СтавкаНДС = СтавкаНДС * 100;
			Иначе
				СтавкаНДС = "";
			КонецЕсли;
			
			стррПоляТЧ.GUID = Новый УникальныйИдентификатор();
			стррПоляТЧ.DocId = ВыборкаДок.Ссылка;
			стррПоляТЧ.A01 = Стр.Номенклатура;
			стррПоляТЧ.A02 = "";
			стррПоляТЧ.A03 = "";
			стррПоляТЧ.A04 = Стр.Количество;
			
			стррПоляТЧ.A05 = СуммаВВалютеУчетаАгента(Стр.Цена, ВыборкаДок.ВалютаДокумента, ВыборкаДок.Дата);
			стррПоляТЧ.A06 = СуммаВВалютеУчетаАгента(Стр.Сумма, ВыборкаДок.ВалютаДокумента, ВыборкаДок.Дата);
			стррПоляТЧ.A07 = СуммаВВалютеУчетаАгента(Стр.СуммаНДС, ВыборкаДок.ВалютаДокумента, ВыборкаДок.Дата);
			
			стррПоляТЧ.A08 = "";
			//{{dm_180524
			стррПоляТЧ.A09 = ?(гКонфигурация = "Бухгалтерия_KZ", "", Стр.ПроцентСкидки);
			//}}dm_180524
			//++Дейнеко ВГ 2017-10-02 Бухгалтерия
			стррПоляТЧ.A010 = СтавкаНДС;
			стррПоляТЧ.A011 = ВыборкаДок.Склад;
			стррПоляТЧ.A012 = СуммаВВалютеУчетаАгента(Стр.Количество * Стр.Цена - Стр.Сумма, ВыборкаДок.ВалютаДокумента, ВыборкаДок.Дата); //Сумма скидки
			стррПоляТЧ.A015 = ВыборкаДок.ТипЦен;
			//--Дейнеко ВГ 2017-10-02 Бухгалтерия
			
			ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоляТЧ);
		
		КонецЦикла;
		
		ЗаписатьОкончаниеТабличнойЧасти(ДокОбмена);
		ДокОбмена.ЗаписатьКонецЭлемента(); //TABLES
		ДокОбмена.ЗаписатьКонецЭлемента(); //ITEMS
	КонецЦикла;
	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);
	
	Если СписокЗаказов.Количество() > 0 Тогда 
		гКэшСпискиОбъектов.Вставить("СписокЗаказов", СписокЗаказов);
	КонецЕсли;

КонецПроцедуры

//dm_171009:Внесены изменения
Процедура ВыгрузитьДокументыПродажи(ДокОбмена)

	Результат = ДанныеПоДокументамПродажи();
	ВыборкаДок = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтррПоля = Новый Структура("GUID,dt,IsPost,A01,A02,A03,A04,A05,A06,A07,A08,A09,A011,A018"); // шапка документа
	стррПараметрыТЧ = Новый Структура("GUID,Comment", "E4D61E0A-1D62-48D7-B70C-BCBA935D377A", "Табличная часть 'Товары'");	
	стррПоляТЧ = Новый Структура("GUID,DocId,A01,A02,A03,A04,A05,A06,A09,A07,A08,A010,A011,A012,A015"); // ТЧ документа

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Документ.Реализация");
	Пока ВыборкаДок.Следующий() Цикл
		//dm_171009: убрал отсюда ВыборкаТабличнойЧасти = ВыборкаДок.Выбрать(); ВыборкаТабличнойЧасти.Следующий();

		//dm_171009
		СуммаДокумента = СуммаВВалютеУчетаАгента(ВыборкаДок.СуммаДокумента, ВыборкаДок.Валюта, ВыборкаДок.Дата);
		
		СтррПоля.GUID = ВыборкаДок.Ссылка.УникальныйИдентификатор();
		СтррПоля.dt = ВыборкаДок.Ссылка.Дата;
		СтррПоля.IsPost = ВыборкаДок.Ссылка.Проведен;
		//dm_171009:Замена
		СтррПоля.A01 = ВыборкаДок.Организация;
		СтррПоля.A02 = ВыборкаДок.Клиент;
		//dm_171009:Замена
		СтррПоля.A04 = ВыборкаДок.Соглашение;
		СтррПоля.A05 = "";
		//dm_171009:Замена
		СтррПоля.A06 = ВыборкаДок.ТипЦен;
		СтррПоля.A07 = СуммаДокумента;
		//dm_171009:Замена
		СтррПоля.A09 = ВыборкаДок.Комментарий;
		СтррПоля.A011 = ВыборкаДок.ДокументЗаказ;
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, СтррПоля, Ложь);
		
		//dm_171009:Перенес сюда ВыборкаТабличнойЧасти =
		ВыборкаТабличнойЧасти = ВыборкаДок.Выбрать();
		ДокОбмена.ЗаписатьНачалоЭлемента("TABLES");
		ЗаписатьНачалоТабличнойЧасти(ДокОбмена, стррПараметрыТЧ);
		Пока ВыборкаТабличнойЧасти.Следующий() Цикл
			Количество = ВыборкаТабличнойЧасти.Количество;
			СуммаСтрокиТЧ = ВыборкаТабличнойЧасти.Сумма;
			Цена = ВыборкаТабличнойЧасти.Цена;
			стррПоляТЧ.GUID = Новый УникальныйИдентификатор();
			стррПоляТЧ.DocId = ВыборкаДок.Ссылка;
			стррПоляТЧ.A01 = ВыборкаТабличнойЧасти.Номенклатура;
			стррПоляТЧ.A03 = ВыборкаТабличнойЧасти.Упаковка;
			стррПоляТЧ.A04 = Количество;
			стррПоляТЧ.A05 = СуммаВВалютеУчетаАгента(Цена, ВыборкаДок.Валюта, ВыборкаДок.Дата);
			стррПоляТЧ.A06 = СуммаВВалютеУчетаАгента(СуммаСтрокиТЧ, ВыборкаДок.Валюта, ВыборкаДок.Дата);
			стррПоляТЧ.A07 = СуммаВВалютеУчетаАгента(ВыборкаТабличнойЧасти.СуммаНДС, ВыборкаДок.Валюта, ВыборкаДок.Дата);
			//{{dm_180529
			СтавкаНДСЧислом = ПолучитьСтавкуНДСЧислом(ВыборкаТабличнойЧасти.СтавкаНДС);
			стррПоляТЧ.A010 = ?(СтавкаНДСЧислом = Неопределено, 0, СтавкаНДСЧислом) * 100; //ПолучитьСтавкуНДСЧислом(ВыборкаТабличнойЧасти.СтавкаНДС)*100;
			//}}dm_180529
			//dm_171009:Замена
			стррПоляТЧ.A011 = ВыборкаДок.Склад;
			стррПоляТЧ.A012 = СуммаВВалютеУчетаАгента(Количество*Цена - СуммаСтрокиТЧ, ВыборкаДок.Валюта, ВыборкаДок.Дата); //Сумма скидки
			//dm_171009:Замена
			стррПоляТЧ.A015 = ВыборкаДок.ТипЦен;
			ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоляТЧ);
		КонецЦикла;
		ЗаписатьОкончаниеТабличнойЧасти(ДокОбмена);
		ДокОбмена.ЗаписатьКонецЭлемента(); //TABLES
		ДокОбмена.ЗаписатьКонецЭлемента(); //ITEMS
	КонецЦикла;
	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);

КонецПроцедуры

Процедура ВыгрузитьМаршруты(ДокОбмена)
	
	Если Не ВыгружатьМаршруты Тогда
		Возврат;
	КонецЕсли; 
	
	стррОбъект = ПолучитьОбъектИзХранилища("СпрСТТ", ВыбНастройкиАгента.СсылкаСписокТТ); // получили список торговых точек
	Если стррОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СмещениеОтНачалаПлана = ДеньНедели(ТекущаяДата()) - 1;
	ПериодПлана = стррОбъект.ПериодГрафикаПлана;
	Если ПериодПлана > 7 И стррОбъект.ДатаНачала <> '00010101' Тогда
		Дней = (НачалоДня(ТекущаяДата()) - стррОбъект.ДатаНачала) / 86400;
		СмещениеОтНачалаПлана = Дней % стррОбъект.ПериодГрафикаПлана;
	КонецЕсли; 
	
	ИспользуетсяГрафик = Неопределено;
	ИспользуетсяПП 	   = Неопределено;
	Если Не СписокТорговыхТочекИспользуетсяДляПланированияПосещений(стррОбъект, ИспользуетсяГрафик, ИспользуетсяПП) Тогда
	    Возврат;
	КонецЕсли; 
	
	ИспользуетсяКонтрагент 	= стррОбъект.Детализация.НайтиПоЗначению("Контрагент") <> Неопределено;
	
	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Документ.Маршрут", 1);  // с признаком удаления всех документов Маршрут
		
	СтррПоля = Новый Структура("GUID,dt,IsPost");
	СтррПоля.IsPost = Истина; // признак, что документ проведен
	СтррПункт = Новый Структура("GUID,DocId,A01,A02,A03,A04");	
	
	ДатаНачалаВыгрузки = НачалоДня(ТекущаяДата());
	
	Если ИспользуетсяПП Тогда // если детализация по плану посещения - то выгружаем данные из плана посещения
		
		// Если включена детализация до контрагента, то нужно подготовить соответствие: Партнер -> Состав.Строка (соответствие партнеру строке из ТЗ Состав)
		// Это соответствие используется для выгрузки дополнительно контрагента для каждого пункта маршрута.
		Если ИспользуетсяКонтрагент Тогда 
			ствПартнеры = Новый Соответствие;
			тзСостав = СтррОбъект.Состав;
			Для каждого СтрокаТ Из тзСостав Цикл
				ТорговаяТочка = ?(ИспользоватьПунктыРазгрузки, СтрокаТ.ПунктРазгрузки, СтрокаТ.Партнер);
				Если ЗначениеЗаполнено(ТорговаяТочка) Тогда
					ствПартнеры.Вставить(ТорговаяТочка, СтрокаТ);
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
		
		тзПланПосещений = СтррОбъект.ПланПосещений;
		тзПланПосещений.Сортировать("День,Порядок,Партнер");

		мДниПлана = Новый Массив(ПериодПлана);
		ТекДень   = Неопределено;
		Для каждого СтрокаТ Из тзПланПосещений Цикл
			Если СтрокаТ.День <> ТекДень Тогда
				Если СтрокаТ.День > ПериодПлана Тогда // Такое возможно, если в списке ранее был создан план с бОльшим периодом, а потом был период изменен 
					Прервать; 						  // на меньший - пункты от бОльшего периода в списке на всякий случай сохраняются.
				КонецЕсли; 
				ТекДень = СтрокаТ.День;
				мДниПлана[ТекДень-1] = тзПланПосещений.Индекс(СтрокаТ);
			КонецЕсли; 
		КонецЦикла;
		
		ИспользоватьПорядок = СтррОбъект.ИспользоватьПорядок;
		
		КоличествоСтрокПлана = тзПланПосещений.Количество();
		
		Для ДеньПериода = 0 По ИнтервалВыгрузкиМаршрутов Цикл
			
			ИндексСтроки = мДниПлана[(ДеньПериода + СмещениеОтНачалаПлана) % ПериодПлана];
			Если ИндексСтроки = Неопределено Тогда // на этот день не запланировано посещений
				Продолжить;
			КонецЕсли; 
			
			// Открываем тэги нового дня (нового документа МТ "Маршрут")
			стррПоля.GUID = Новый УникальныйИдентификатор();
			стррПоля.dt   = ДатаНачалаВыгрузки + ДеньПериода * 86400;
			ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля, Ложь); //ITEM
			// Заполняем табличные части документа
			ДокОбмена.ЗаписатьНачалоЭлемента("TABLES");
			// Заполняем табличную часть контрагентов маршрута		
			ДокОбмена.ЗаписатьНачалоЭлемента("TABLE");
			ДобавитьПоле(ДокОбмена, "GUID", "ED832712-A167-4B9E-87F1-5127E6F70814");
			ДобавитьПоле(ДокОбмена, "Comment", "Табличная часть 'Точки маршрута'");
			
			Порядок = 0;
			
			ТекДень = тзПланПосещений[ИндексСтроки].День;
			
			Пока ИндексСтроки < КоличествоСтрокПлана Цикл
				
				СтрокаТ = тзПланПосещений[ИндексСтроки];
				Если СтрокаТ.День <> ТекДень Тогда
					Прервать;
				КонецЕсли; 
				
				СтррПункт.GUID  = Новый УникальныйИдентификатор();
				СтррПункт.DocId = стррПоля.GUID;
				Если ИспользоватьПунктыРазгрузки Тогда
					стзСостав = ствПартнеры[СтрокаТ.Партнер];
					СтррПункт.A01 = ?(стзСостав = Неопределено, Неопределено, стзСостав.Контрагент);
					СтррПункт.A02 = СтрокаТ.Партнер;
				Иначе 
					СтррПункт.A01 = СтрокаТ.Партнер;	 // в МТ - это поле "Контрагент"
					Если ИспользуетсяКонтрагент Тогда 
						стзСостав = ствПартнеры[СтрокаТ.Партнер];
						СтррПункт.A02 = ?(стзСостав = Неопределено, Неопределено, стзСостав.Контрагент);
					КонецЕсли;
				КонецЕсли;
				СтррПункт.A03 = СтрокаТ.Время;
				СтррПункт.A04 = СтрокаТ.Комментарий;
				//Если ИспользоватьПорядок Тогда
				//	СтррПункт.A05 = СтрокаТ.Порядок;
				//Иначе
				//	Порядок = Порядок + 1;					
				//	СтррПункт.A05 = Порядок;
				//КонецЕсли;
				ЗаписатьЭлементВДокументОбмена(ДокОбмена, СтррПункт);	
				ИндексСтроки = ИндексСтроки + 1;
				
			КонецЦикла; 
			
			// закрываем тэги текущего документа Маршрут
			ДокОбмена.ЗаписатьКонецЭлемента(); //TABLE 
			ДокОбмена.ЗаписатьКонецЭлемента(); //TABLES
			ДокОбмена.ЗаписатьКонецЭлемента(); //ITEM
			
		КонецЦикла; 
		
	Иначе // Детализация только по графику посещения, выгружаем данные из желательного графика посещений.
		
		тзСостав = стррОбъект.Состав;
		Пункт = Неопределено;
		
		Для ДеньПериода = 0 По ИнтервалВыгрузкиМаршрутов Цикл
			
			ОткрытТэгМаршрута = Ложь;
			
			Для каждого СтрокаТ Из тзСостав Цикл
				
				стррГрафик = СтрокаТ.График;
				Если стррГрафик = Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				стррПункты = стррГрафик.Пункты;
				Если стррПункты = Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				ПериодГрафика = стррГрафик.ПериодГрафика;
				ДеньГрафика = (ДеньПериода + СмещениеОтНачалаПлана) % ПериодГрафика;
				УчитыватьВремяПосещения = стррГрафик.УчитыватьВремяПосещения;
				
				Если стррПункты.Свойство("П"+Строка(ДеньГрафика), Пункт) И Пункт.Выбран Тогда
					
					Если Не ОткрытТэгМаршрута Тогда
						ОткрытТэгМаршрута = Истина;
						Порядок = 0;
						// Открываем тэги нового дня (нового документа МТ "Маршрут")
						стррПоля.GUID = Новый УникальныйИдентификатор();
						стррПоля.dt   = ДатаНачалаВыгрузки + ДеньПериода * 86400;
						ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля, Ложь); //ITEM
						// Заполняем табличные части документа
						ДокОбмена.ЗаписатьНачалоЭлемента("TABLES");
						// Заполняем табличную часть контрагентов маршрута		
						ДокОбмена.ЗаписатьНачалоЭлемента("TABLE");
						ДобавитьПоле(ДокОбмена, "GUID", "ED832712-A167-4B9E-87F1-5127E6F70814");
						ДобавитьПоле(ДокОбмена, "Comment", "Табличная часть 'Точки маршрута'");
					КонецЕсли; 
					
					СтррПункт.GUID  = Новый УникальныйИдентификатор();
					СтррПункт.DocId = стррПоля.GUID;
					Если ИспользоватьПунктыРазгрузки Тогда
						стзСостав = ствПартнеры[СтрокаТ.Партнер];
						СтррПункт.A01 = ?(стзСостав = Неопределено, Неопределено, стзСостав.Контрагент);
						СтррПункт.A02 = СтрокаТ.Партнер;
					Иначе
						СтррПункт.A01 = СтрокаТ.Партнер;	 // в МТ - это поле "Контрагент"
						Если ИспользуетсяКонтрагент Тогда 
							СтррПункт.A02 = СтрокаТ.Контрагент;
						КонецЕсли;
					КонецЕсли;
					СтррПункт.A03 = ?(УчитыватьВремяПосещения, Лев(Пункт.Время, 5), "");
					СтррПункт.A04 = ""; // Комментарий
					//СтррПункт.A05 = Порядок;
					//Порядок = Порядок + 1;					
					ЗаписатьЭлементВДокументОбмена(ДокОбмена, СтррПункт);	
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			Если ОткрытТэгМаршрута Тогда
				// закрываем тэги текущего документа Маршрут
				ДокОбмена.ЗаписатьКонецЭлемента(); //TABLE 
				ДокОбмена.ЗаписатьКонецЭлемента(); //TABLES
				ДокОбмена.ЗаписатьКонецЭлемента(); //ITEM
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; // Если ИспользуетсяПП Тогда
	
	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);
	
КонецПроцедуры

//dm_170928:Внесены изменения
Процедура ВыгрузитьДокументыДолг(ДокОбмена, МенеджерВТ)

	ТекущаяДата = ТекущаяДатаСеанса();
	
	//dm_170928:В Бух30 нет справочника ГрафикиОплаты
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ГрафикиОплатыЭтапы.Сдвиг КАК Сдвиг,
	//               |	ГрафикиОплатыЭтапы.Ссылка КАК СсылкаГОЭ
	//               |ИЗ
	//               |	Справочник.ГрафикиОплаты.Этапы КАК ГрафикиОплатыЭтапы";
	//РезультатГрафикОплат = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоВзаиморасчетам(СпособРасчетаПросроченныхДолгов); 
	Запрос.УстановитьПараметр("ДатаРасчета", ТекущаяДата);
	Запрос.УстановитьПараметр("КолПросроченныхДней", ИнтервалПросроченныхДолгов);
	Запрос.УстановитьПараметр("ТолькоПросроченные", ВыгружатьТолькоПросроченныеДолги);
	Запрос.УстановитьПараметр("СписокОрганизаций", ОрганизацииВыгрузки());
	//{{dm_170929
	Запрос.УстановитьПараметр("СпособРасчета", ?(ЗначениеЗаполнено(СпособРасчетаПросроченныхДолгов), СпособРасчетаПросроченныхДолгов, "Неопределено"));
	Запрос.УстановитьПараметр("СрокОплатыПокупателей", Константы.СрокОплатыПокупателей.Получить());
	//{{dm_180426:dm_180523
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		Запрос.УстановитьПараметр("СчетаКДЗ", ПланыСчетов.Типовой.КраткосрочнаяДебиторскаяЗадолженностьПокупателейИЗаказчиков.Ссылка);
	Иначе
		Запрос.УстановитьПараметр("СрокОплатыСчетовПокупателю", Константы.СрокОплатыСчетовПокупателю.Получить());
		Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымМПЗ.Ссылка);
	КонецЕсли;
	//}}dm_180426
	//}}dm_170929
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Результат = Запрос.Выполнить();
	
	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Документ.Долг", 1);  // с признаком удаления всех документов Долг
	
	НеУчитыватьПросрочку = Не ЗначениеЗаполнено(СпособРасчетаПросроченныхДолгов) Или СпособРасчетаПросроченныхДолгов = "НеУчитывать";
	
	стррПоля = Новый Структура("GUID,dt,IsPost,DocNumber,A02,A03,A05,A06,A07,A08,A011,A014,A015");
	
	Выборка = Результат.Выбрать();
	
	//dm_170928:Замена
	ТипДокументЗаказ 		= Тип("ДокументСсылка.СчетНаОплатуПокупателю"); 
	ТипДокументРеализация 	= Тип("ДокументСсылка.РеализацияТоваровУслуг");
	
	стррДокумент = Новый Структура("Дата, Проведен, Номер, Ссылка");
	
	Если НеУчитыватьПросрочку Тогда
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.НашДолг > 0 Или Выборка.ДолгКлиентаБезУчетаПросрочки = 0 Тогда //dm_29.09.17:Замена Выборка.ДолгКлиента
				Продолжить;
			КонецЕсли;
			
			
			//dm_170929:Замена
			СуммаДолга = Выборка.ДолгКлиентаБезУчетаПросрочки;			
			Комментарий = "";
			НомерДок = "";

			//dm_170928:Замена
			ОбъектРасчетов = Выборка.ОбъектРасчетов;
			Если ЗначениеЗаполнено(ОбъектРасчетов) Тогда
				
				//dm_170929:Замена
				ДатаПлатежа = Выборка.ДатаПлатежа;
				
				Если ТипЗнч(ОбъектРасчетов) = ТипДокументЗаказ Или ТипЗнч(ОбъектРасчетов) = ТипДокументРеализация Тогда
					Комментарий = ОбъектРасчетов.Комментарий;
					НомерДок = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ОбъектРасчетов.Номер);
					стррДокумент.Дата 		= ОбъектРасчетов.Дата;
					стррДокумент.Проведен	= Истина; 
					стррДокумент.Номер 		= ОбъектРасчетов.Номер; 
					стррДокумент.Ссылка 	= ОбъектРасчетов;
					СуммаДокументаПересчитанная = СуммаВВалютеУчетаАгента(ОбъектРасчетов.СуммаДокумента, ОбъектРасчетов.ВалютаДокумента, ОбъектРасчетов.Дата); //dm_170929:Замена ОбъектРасчетов.Валюта
					ПредставлениеДок = ОбъектРасчетов.Метаданные().Синоним + " №" + НомерДок + " от " + Формат(ОбъектРасчетов.Дата, "ДФ=dd.MM.yy") + " ∑: " + Строка(СуммаДокументаПересчитанная);
					ЗаполнитьОсновныеПоляДокумента(стррПоля, стррДокумент, Ложь, Истина);
				Иначе
					СуммаДокументаПересчитанная = СуммаВВалютеУчетаАгента(СуммаДолга, Выборка.ВалютаДокумента, ДатаПлатежа); //dm_170929:Замена Выборка.Валюта
					//{{dm_180426:dm_180523
					ПредставлениеДок = ?(гКонфигурация = "Бухгалтерия_KZ", 
											ОбъектРасчетов.Метаданные().Синоним + " №" + НомерДок + " от " + Формат(ОбъектРасчетов.Дата, "ДФ=dd.MM.yy") + " ∑: " + Строка(СуммаДокументаПересчитанная), 
											"Договор с контрагентом" + " №" + СокрЛП(ОбъектРасчетов.Номер) + " от " + Формат(ОбъектРасчетов.Дата, "ДФ=dd.MM.yy") + " ∑: " + Строка(СуммаДокументаПересчитанная));
					//}}dm_180426
					стррПоля.GUID 		= Новый УникальныйИдентификатор();
					стррПоля.dt 		= ДатаПлатежа;
					стррПоля.IsPost 	= Истина;
					стррПоля.DocNumber = "";
				КонецЕсли;
				
				
			//dm_170928:Без документа расчета с контрагентом долг не образуется
			Иначе //ЗначениеЗаполнено(ОбъектРасчетов) Тогда
				Продолжить; //dm_180817
			КонецЕсли;

			стррПоля.A02 = Выборка.Организация;
			стррПоля.A03 = Выборка.Контрагент; //dm_170928:Замена  Выборка.Партнер
			стррПоля.A05 = Выборка.Договор; //dm_170928:Замена  Выборка.Соглашение
			стррПоля.A06 = ДатаПлатежа;
			стррПоля.A08 = Комментарий;
			Если ТипЗнч(ОбъектРасчетов) = ТипДокументЗаказ Или ТипЗнч(ОбъектРасчетов) = ТипДокументРеализация Тогда
				стррПоля.A07  = СуммаВВалютеУчетаАгента(СуммаДолга, Выборка.ВалютаДокумента, ОбъектРасчетов.Дата); //dm_170929:Замена Выборка.Валюта
				стррПоля.A011 = ОбъектРасчетов.Ссылка.УникальныйИдентификатор(); 
			Иначе
				стррПоля.A07  = СуммаВВалютеУчетаАгента(СуммаДолга, Выборка.ВалютаДокумента, ДатаПлатежа); //dm_170929:Замена Выборка.Валюта
				стррПоля.A011 = Неопределено;
			КонецЕсли;
			стррПоля.A014 = Ложь;
			стррПоля.A015 = ПредставлениеДок;
			ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
			
		КонецЦикла;
	
	Иначе // выгрузка долгов с учетом просрочки (НеУчитыватьПросрочку = Ложь)
		
		//{{dm_171002:Если мы учитываем просрочку, то однозначно:
		//ВыгружатьТолькоПросроченныеДолги = Истина; //dm_180817 можно не использовать "ВыгружатьТолькоПросроченныеДолги" (CodeReview_180810)
		//}}dm_171002
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.НашДолг > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			//dm_170929: Используем два допущения:
			//dm_170929: 1. Без документа расчета с контрагентом долг не образуется
			//dm_170929: 2. В документе расчета с контрагентом реквизит Дата обязателен к заполнению
			
			//{{dm_170929
			ДатаПлатежа = Выборка.ДатаПлатежа;
			Если СпособРасчетаПросроченныхДолгов = "ПоДоговору" Тогда
				СуммаДолга = Выборка.ДолгКлиентаПросроченПоДате;
			Иначе
				СуммаДолга = Выборка.ДолгКлиентаПросроченПоДням;
			КонецЕсли;
			//}}dm_170929
			
			//dm_170929:Замена
			//Если ВыгружатьТолькоПросроченныеДолги И НЕ ЗначениеЗаполнено(СуммаДолга) Тогда
			Если НЕ ЗначениеЗаполнено(СуммаДолга) Тогда //dm_180817 можно не использовать "ВыгружатьТолькоПросроченныеДолги" (CodeReview_180810)
				Продолжить;
			КонецЕсли;

			ВыделитьЦветом = Ложь;
			Комментарий = "";
			НомерДок = "";
			
			//dm_170929:Замена
			Если ЗначениеЗаполнено(СуммаДолга) И ВыделятьЦветомПросроченныеДолги Тогда
				ВыделитьЦветом = Истина;
			КонецЕсли;

			//dm_170929:Замена
			ОбъектРасчетов = Выборка.ОбъектРасчетов;
			Если ЗначениеЗаполнено(ОбъектРасчетов) Тогда
				
				Если ЕстьРеквизитОбъекта("ДоговорКонтрагента", ОбъектРасчетов) Тогда //dm_170929:Замена ЕстьРеквизитОбъекта("Соглашение", ОбъектРасчетов) 
					//dm_170929:Замена
					ДокСоглашение = Выборка.Договор;
				КонецЕсли;
				
				Если ТипЗнч(ОбъектРасчетов) = ТипДокументЗаказ Или ТипЗнч(ОбъектРасчетов) = ТипДокументРеализация Тогда
					Комментарий = ОбъектРасчетов.Комментарий;
					НомерДок = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ОбъектРасчетов.Номер);
					стррДокумент.Дата 		= ОбъектРасчетов.Дата;
					стррДокумент.Проведен	= Истина; 
					стррДокумент.Номер 		= ОбъектРасчетов.Номер; 
					стррДокумент.Ссылка 	= ОбъектРасчетов;
					СуммаДокументаПересчитанная = СуммаВВалютеУчетаАгента(ОбъектРасчетов.СуммаДокумента, ОбъектРасчетов.ВалютаДокумента, ОбъектРасчетов.Дата); //dm_170929:Замена ОбъектРасчетов.Валюта
					ПредставлениеДок = ОбъектРасчетов.Метаданные().Синоним + " №" + НомерДок + " от " + Формат(ОбъектРасчетов.Дата, "ДФ=dd.MM.yy") + " ∑: " + Строка(СуммаДокументаПересчитанная);
					ЗаполнитьОсновныеПоляДокумента(стррПоля, стррДокумент, Ложь, Истина);
				Иначе
					СуммаДокументаПересчитанная = СуммаВВалютеУчетаАгента(СуммаДолга, Выборка.ВалютаДокумента, ДатаПлатежа); //dm_170929:Замена Выборка.Валюта 
					ПредставлениеДок = "Договор с контрагентом" + " №" + СокрЛП(ОбъектРасчетов.Номер) + " от " + Формат(ОбъектРасчетов.Дата, "ДФ=dd.MM.yy") + " ∑: " + Строка(СуммаДокументаПересчитанная);
					стррПоля.GUID 		= Новый УникальныйИдентификатор();
					стррПоля.dt 		= ДатаПлатежа;
					стррПоля.IsPost 	= Истина;
					стррПоля.DocNumber = "";
				КонецЕсли;
				
			Иначе
				
				СуммаДокументаПересчитанная = СуммаВВалютеУчетаАгента(СуммаДолга, Выборка.ВалютаДокумента, ДатаПлатежа); //dm_170929:Замена Выборка.Валюта
				ПредставлениеДок = "Ввод начальных остатков ";
				стррПоля.GUID 		= Новый УникальныйИдентификатор();
				стррПоля.dt 		= ДатаПлатежа;
				стррПоля.IsPost 	= Истина;
				стррПоля.DocNumber  = "";
				
			КонецЕсли;

			стррПоля.A02 = Выборка.Организация;
			стррПоля.A03 = Выборка.Контрагент; //dm_171002:Замена  Выборка.Партнер
			стррПоля.A05 = Выборка.Договор; //dm_171002:Замена  Выборка.ЗаказКлиентаСоглашение
			стррПоля.A06 = ДатаПлатежа;
			стррПоля.A08 = Комментарий;
			Если ТипЗнч(ОбъектРасчетов) = ТипДокументЗаказ Или ТипЗнч(ОбъектРасчетов) = ТипДокументРеализация Тогда
				стррПоля.A07  = СуммаВВалютеУчетаАгента(СуммаДолга, Выборка.ВалютаДокумента, ОбъектРасчетов.Дата); //dm_171002:Замена Выборка.Валюта
				стррПоля.A011 = ОбъектРасчетов.Ссылка.УникальныйИдентификатор(); 
			Иначе
				стррПоля.A07  = СуммаВВалютеУчетаАгента(СуммаДолга, Выборка.ВалютаДокумента, ДатаПлатежа); //dm_171002:Замена Выборка.Валюта
				стррПоля.A011 = Неопределено;
			КонецЕсли;
			стррПоля.A014 = ВыделитьЦветом;
			стррПоля.A015 = ПредставлениеДок;
			ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
			
		КонецЦикла;
	
	КонецЕсли; // Если НеУчитыватьПросрочку Тогда
	
	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);

КонецПроцедуры

//dm_16.10.17:Внесены изменения
Процедура ВыгрузитьДокументыПеремещения(ДокОбмена) // sd_22082017
	
	Результат = ДанныеПоДокументамПеремещения();
	ВыборкаДок = Результат.Выбрать();
	
	СтррПоля = Новый Структура("GUID,dt,IsPost,A01,A03,A04,A05,A06,A07,A08,A09"); // шапка документа
	стррПараметрыТЧ = Новый Структура("GUID,Comment", "3097F10A-BEE6-4A76-AD7A-D4663C9B73EC", "Табличная часть 'Товары'");	
	стррПоляТЧ = Новый Структура("GUID,DocId,A01,A02,A03,A04,A05,A06"); // ТЧ документа

	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Документ.Перемещение");
	
	Пока ВыборкаДок.Следующий() Цикл 
		Док = ВыборкаДок.Ссылка;
		СтррПоля.GUID = Док.УникальныйИдентификатор();
		СтррПоля.dt = Док.Дата;
		СтррПоля.IsPost = Док.Проведен;
		СтррПоля.A01 = Док.Организация;
		СтррПоля.A03 = Док.СкладОтправитель;
		СтррПоля.A04 = Док.СкладПолучатель;
		СтррПоля.A05 = 0; // СуммаДокумента
		СтррПоля.A06 = Док.Комментарий;
		СтррПоля.A07 = "";
		СтррПоля.A08 = "";
		//dm_16.10.17:Замена
		СтррПоля.A09 = Док.СкладОтправитель.ТипЦенРозничнойТорговли;
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, СтррПоля, Ложь);
		Если Док.Товары.Количество() > 0 Тогда 
			ДокОбмена.ЗаписатьНачалоЭлемента("TABLES");
			ЗаписатьНачалоТабличнойЧасти(ДокОбмена, стррПараметрыТЧ);
			Для Каждого СтрокаТ Из Док.Товары Цикл 
				Номенклатура 		= СтрокаТ.Номенклатура;
				//dm_16.10.17:Замена
				КоличествоУпаковок 	= СтрокаТ.Количество;
				//dm_16.10.17:Замена
				ЦенаНоменклатуры	= ПолучитьЦенуНоменклатуры(Номенклатура, Док.СкладОтправитель.ТипЦенРозничнойТорговли);
				стррПоляТЧ.GUID = Новый УникальныйИдентификатор();
				стррПоляТЧ.DocId = ВыборкаДок.Ссылка;
				стррПоляТЧ.A01 = Номенклатура;
				//dm_16.10.17:Замена
				стррПоляТЧ.A03 = СтрокаТ.ЕдиницаИзмерения;
				стррПоляТЧ.A04 = КоличествоУпаковок;
				стррПоляТЧ.A05 = ЦенаНоменклатуры;
				стррПоляТЧ.A06 = ЦенаНоменклатуры * КоличествоУпаковок;
				ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоляТЧ);
			КонецЦикла;
			ЗаписатьОкончаниеТабличнойЧасти(ДокОбмена);
			ДокОбмена.ЗаписатьКонецЭлемента(); //TABLES
			ДокОбмена.ЗаписатьКонецЭлемента(); //ITEMS
		КонецЕсли;
	КонецЦикла;
	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);
	
КонецПроцедуры

// ВыгрузкаДокументов
#КонецОбласти

#Область ОтборыВыгрузки

Функция ОрганизацииВыгрузки()

	Значение = гКэшСпискиОбъектов.Получить("ОрганизацииВыгрузки");
	Если Значение = Неопределено Тогда
		ТЗ = ТЗОрганизацииВыгрузки();
		Значение = ТЗ.ВыгрузитьКолонку("Ссылка");
		гКэшСпискиОбъектов.Вставить("ОрганизацииВыгрузки", Значение);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ТЗОрганизацииВыгрузки()
	
	Отборы = ЭлементОтбораПоЛевомуЗначению("Организации");
	ТЗ = РезультатЗапросаВВидеТЗ(ТекстЗапросаВыборкиОрганизаций(), Отборы);
	
	// помещаем массив организаций в кэш, если его там еще нет - для будущих отборов по списку организаций
	Если Неопределено = гКэшСпискиОбъектов.Получить("ОрганизацииВыгрузки") Тогда
		гКэшСпискиОбъектов.Вставить("ОрганизацииВыгрузки", ТЗ.ВыгрузитьКолонку("Ссылка"));
	КонецЕсли;
	
	Возврат ТЗ;
	
КонецФункции

Функция ВидыКонтактнойИнформацииВыгрузки()

	//{{dm_180425
	Возврат ВыборкаВидовКИ(ТекстЗапросаВыборкиВидовКонтактнойИнформации());
	//}}dm_180425
	
КонецФункции

Функция ВидыЦенВыгрузки()
	
	//++Дейнеко ВГ 2017-09-19 Бухгалтерия
	//Не знаю что за отбор,укажу ТипыЦенНоменклатуры вместо ВидыЦен
	ЭлементОтбора = ЭлементОтбораПоЛевомуЗначению("ВидыЦен");	
	//Замена
	//ЭлементОтбора = ЭлементОтбораПоЛевомуЗначению("ВидыЦен");
	//++Дейнеко ВГ 2017-09-19 Бухгалтерия
	
	Возврат ВыборкаИзСправочника(ТекстЗапросаВыборкиВидовЦен(), ЭлементОтбора);
	
КонецФункции

Функция СкладыВыгрузки(МенеджерВТ)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВТ_Склады.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	ВТ_Склады КАК ВТ_Склады
						  //(( sk_190718
						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
						  |		ПО ВТ_Склады.Ссылка = СпрСклады.Ссылка 
						  //)) sk_190718
	                      |УПОРЯДОЧИТЬ ПО
						  //(( sk_190718
						  //|	Ссылка
						  //|АВТОУПОРЯДОЧИВАНИЕ");
						  |	СпрСклады.Наименование");
						  //)) sk_190718

	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция СтатусыПартнеровВыгрузки()

	Если Не ВременныеТаблицы.Свойство("СтатусыПартнеров") Тогда // значит статусы партнеров не задавались
		Возврат Новый ТаблицаЗначений;
	Иначе
		Возврат ВременныеТаблицы.СтатусыПартнеров;
	КонецЕсли;
	
КонецФункции

// ОтборыВыгрузки
#КонецОбласти 

#Область ГенерацияXMLФайлаВыгрузки

Процедура ВыгрузитьПоляВЭлемент(ПоляЭлемента, ВыборкаЭлементов, КоличествоРеквизитов, ИмяПоля, ПолеВыгрузки)

	Счетчик = -1;
	Пока ВыборкаЭлементов.Следующий() Цикл
		//{{dm_180904
		Если ИмяПоля = "Остаток" Тогда
			ПоляЭлемента.Вставить(ПолеВыгрузки + Строка(гСоотвСклады.Получить(ВыборкаЭлементов.Склад)), ВыборкаЭлементов[ИмяПоля]);
		Иначе
		//}}dm_180904
			Счетчик = Счетчик + 1;
			ПоляЭлемента.Вставить(ПолеВыгрузки + Строка(Счетчик), ВыборкаЭлементов[ИмяПоля]);

			Если Счетчик = КоличествоРеквизитов-1 Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли; //dm_180904
	КонецЦикла;

КонецПроцедуры

Процедура ВыгрузитьПоляТабличнойЧастиНоменклатуры(ДокОбмена, стррПараметры)

	ВыборкаЭлементов = стррПараметры.ВыборкаЭлементов;
	//{{dm_180516
	МаксЗначениеСчетчика = стррПараметры.КоличествоРеквизитов;
	//}}dm_180516
	ИмяПоля = стррПараметры.ИмяПоля;	
	ПолеВыгрузки = стррПараметры.ПолеВыгрузки;
	
	стррПоля = Новый Структура("GUID,CtlgId," + ПолеВыгрузки);
	
	Для СчСтрок = 1 По стррПараметры.КоличествоСтрок Цикл
		
		стррПоля.GUID = Новый УникальныйИдентификатор();
		стррПоля.CtlgId = стррПараметры.Номенклатура;
		стррПоля[ПолеВыгрузки] = СчСтрок;
		Сч = 0;
		Пока ВыборкаЭлементов.Следующий() Цикл
			Сч = Сч + 1;
			стррПоля.Вставить("A0" + Строка(Сч), ВыборкаЭлементов[ИмяПоля]);
			Если Сч = МаксЗначениеСчетчика Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена)

	ДокОбмена.ЗаписатьКонецЭлемента(); //ELEMENTS
	ДокОбмена.ЗаписатьКонецЭлемента(); //CATALOG или DOCUMENT

КонецПроцедуры

Процедура ЗаписатьНачалоВеткиОбъекта(ДокОбмена, ВидОбъектаДляМТ, УдалитьВсе = Неопределено)

	КорневойВид = Неопределено;
	СвойстваВида = СвойстваВидаОбъекта(ВидОбъектаДляМТ, "ВидДляМТ", КорневойВид);
	
	ДокОбмена.ЗаписатьНачалоЭлемента(?(КорневойВид = "Документ", "DOCUMENT", "CATALOG"));
	ДобавитьПоле(ДокОбмена, "GUID", ВРег(СвойстваВида.ИдентификаторВида)); // gi_170902
	УстановитьПризнакОчисткиОбъекта(ДокОбмена, СвойстваВида.ВидДляМТ, КорневойВид, УдалитьВсе);
	ДобавитьПоле(ДокОбмена, "Comment", ПредставлениеВида(КорневойВид, СвойстваВида));
	ДокОбмена.ЗаписатьНачалоЭлемента("ELEMENTS");

КонецПроцедуры

Процедура УстановитьПризнакОчисткиОбъекта(ДокОбмена, ВидДляМТ, КорневойВид, Принудительно)

	Если Принудительно = Истина Тогда // параметр Принудительно может быть со значением Неопределено
		ДобавитьПоле(ДокОбмена, "KILLALL", "1");
	ИначеЕсли Принудительно = Ложь Тогда 	
		Возврат;
	Иначе
		
		Если КорневойВид = "Документ" И ОчищатьДокументыПередЗагрузкой Тогда
			Список = СписокОчищаемыхДокументов;
		ИначеЕсли КорневойВид = "Справочник" И ОчищатьСправочникиПередЗагрузкой Тогда
			Список = СписокОчищаемыхСправочников;
		Иначе
			Возврат;
		КонецЕсли;
			
		ИскатьЗначение = ВРег(ВидДляМТ);
		Для Каждого Элемент Из Список Цикл
			Если ВРег(Элемент.Значение) = ИскатьЗначение Тогда // пометку элемента не проверяем, т.к. в списке у нас только очищаемые справочники
				ДобавитьПоле(ДокОбмена, "KILLALL", "1");
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьНачалоТабличнойЧасти(ДокОбмена, СтррПараметры)

	ДокОбмена.ЗаписатьНачалоЭлемента("TABLE");
	ДобавитьПоле(ДокОбмена, "GUID", СтррПараметры.GUID);
	ДобавитьПоле(ДокОбмена, "Comment", СтррПараметры.Comment);

КонецПроцедуры

Процедура ЗаписатьОкончаниеТабличнойЧасти(ДокОбмена)

	ДокОбмена.ЗаписатьКонецЭлемента(); //TABLE

КонецПроцедуры

Процедура ДобавитьКонстанту(ДокОбмена, Идентификатор, Значение)

	ДокОбмена.ЗаписатьНачалоЭлемента("ITEM");
	ДобавитьПоле(ДокОбмена, "GUID", Идентификатор);
	ДобавитьПоле(ДокОбмена, "VALUE", Значение);
	ДокОбмена.ЗаписатьКонецЭлемента();

КонецПроцедуры

Процедура ДобавитьПоле(ДокОбмена, Имя, Значение)

	ЗначXML = ЗначениеВСтрокуДляXML(Значение);
	Если Имя = "GUID" Тогда
		ЗначXML = ВРег(ЗначXML);
	КонецЕсли;
	ДокОбмена.ЗаписатьАтрибут(Имя, ЗначXML);

КонецПроцедуры

Процедура ЗаписатьЭлементВДокументОбмена(ДокОбмена, СтруктураПолей, ЗакрытьЭлемент = Истина)

	Если СтруктураПолей.Свойство("GUID") И Не ЗначениеЗаполнено(СтруктураПолей.GUID) Тогда
		Возврат;
	КонецЕсли;

	ДокОбмена.ЗаписатьНачалоЭлемента("ITEM");
	Для Каждого ТекЭлемент Из СтруктураПолей Цикл
		ДобавитьПоле(ДокОбмена, ТекЭлемент.Ключ, ТекЭлемент.Значение);
	КонецЦикла;
	
	Если ЗакрытьЭлемент Тогда
		ДокОбмена.ЗаписатьКонецЭлемента();
	КонецЕсли;

КонецПроцедуры

// ГенерацияXMLФайлаВыгрузки
#КонецОбласти 

Процедура ВставитьНомерДокументаВСтруктуру(стррПоля, Док)

	НомерДляXML = СокрП(Док.Номер);

	// Проверка последнего элемента номера
	Код = КодСимвола(Прав(НомерДляXML, 1));
	Если Код < 48 Или Код > 57 Тогда
		ОповеститьОСобытии("В номере документа '" + Строка(Док) + "' последний символ не цифра.", "ОшибкаПрочее", Док, "ТекущийАгент");
	КонецЕсли;

	стррПоля.Вставить("DocNumber", НомерДляXML);
	
КонецПроцедуры

Функция НачалоВыгрузкиДокументов(ИнтервалВыгрузки)

	Возврат НачалоДня(ТекущаяДата()) - ?(ИнтервалВыгрузки <> Неопределено, 86400 * ИнтервалВыгрузки, 0);
	
КонецФункции

Функция ЕдиницыИзмеренияНоменклатуры(ЭлементНоменклатуры, КонстантаИспользоватьУпаковкиНоменклатуры)

	Если КонстантаИспользоватьУпаковкиНоменклатуры Тогда
		Если ЭлементНоменклатуры.ИспользоватьУпаковки Тогда
			Если ЭлементНоменклатуры.НаборУпаковок = Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры Тогда
				БазоваяЕдиница = ЭлементНоменклатуры;
				НаборУпаковок = "";
			Иначе
				НаборУпаковок = ЭлементНоменклатуры.НаборУпаковок;
				БазоваяЕдиница = ЭлементНоменклатуры.НаборУпаковок.ЕдиницаИзмерения;
			КонецЕсли;
		Иначе
			БазоваяЕдиница = ЭлементНоменклатуры;	//GUID базовой единицы измерения выгружается равным GUID номенклатуры, когда не используются упаковки номенклатуры (см. выгрузку ссылок для единиц измерения)
			НаборУпаковок = "";
		КонецЕсли; //Если ТекНоменклатура.ИспользоватьУпаковки Тогда
	Иначе
		//{{dm_180425:dm_180523
		БазоваяЕдиница = ?(гКонфигурация = "Бухгалтерия_KZ", ЭлементНоменклатуры.БазоваяЕдиницаИзмерения, ЭлементНоменклатуры.ЕдиницаИзмерения);
		//}}dm_180425
		НаборУпаковок = "";
	КонецЕсли;

	Возврат Новый Структура("БазоваяЕдиница,НаборУпаковок", БазоваяЕдиница, НаборУпаковок);
КонецФункции // ЕдиницыИзмеренияНОменклатуры()

Функция ПредопределенныеПоляСправочника(ТекЭлемент, СоздаватьИдентификатор = Ложь)

	СтруктураПолей = Новый Структура;
	Если СоздаватьИдентификатор Тогда
		СтруктураПолей.Вставить("GUID", Новый УникальныйИдентификатор());
	ИначеЕсли ЗначениеЗаполнено(ТекЭлемент) Тогда
		//++Дейнеко ВГ 2017-09-19 Бухгалтерия
		//Я не знаю как это работает
		//СтруктураПолей.Вставить("GUID", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
		//Замена
		СтруктураПолей.Вставить("GUID", ТекЭлемент.Ссылка.УникальныйИдентификатор());
		//--Дейнеко ВГ 2017-09-19 Бухгалтерия
	Иначе
		СтруктураПолей.Вставить("GUID", "");
	КонецЕсли;
	СтруктураПолей.Вставить("Name", ТекЭлемент.Наименование);

	Возврат СтруктураПолей;
	
КонецФункции

Функция ПодчиненныеРеализацииДляЗаказа(ЗаказСсылка)
	//++Дейнеко ВГ 2017-10-02 Бухгалтерия
	
	//{{dm_180524
	стррЛитералы = Новый Структура("Основание");		
	
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррЛитералы.Основание = "ДокументОснование";
	Иначе
		стррЛитералы.Основание = "СчетНаОплатуПокупателю";
	КонецЕсли;
	//}}dm_180524
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.[Основание] КАК СчетНаОплатуПокупателю
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|	И РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.[Основание] = &ЗаказСсылка";

	//{{dm_180524
	ЗаменитьЛитералы(ТекстЗапроса, стррЛитералы);
	//}}dm_180524
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ЗаказСсылка", ЗаказСсылка);
	Результат = Запрос.Выполнить();

	мРеализации = Результат.Выгрузить().ВыгрузитьКолонку("СчетНаОплатуПокупателю");
	
	//--Дейнеко ВГ 2017-10-02 Бухгалтерия
	
	Возврат мРеализации;
КонецФункции

Функция ПредопределенныеПоляДокумента(ТекДокумент, СоздаватьИдентификатор = Ложь, ВыгружатьНомер = Истина)

	СтруктураПолей = Новый Структура;

	Если СоздаватьИдентификатор Тогда
		СтруктураПолей.Вставить("GUID", Новый УникальныйИдентификатор());
	Иначе
		СтруктураПолей.Вставить("GUID", ТекДокумент.Ссылка.УникальныйИдентификатор());
	КонецЕсли;

	СтруктураПолей.Вставить("dt", ТекДокумент.Дата);
	СтруктураПолей.Вставить("IsPost", ТекДокумент.Проведен);
	Если ВыгружатьНомер Тогда
		ВставитьНомерДокументаВСтруктуру(СтруктураПолей, ТекДокумент.Ссылка);
	КонецЕсли;

	Возврат СтруктураПолей;
КонецФункции

Процедура ЗаполнитьОсновныеПоляДокумента(стррПоля, ТекДокумент, СоздаватьИдентификатор = Ложь, ВыгружатьНомер = Истина)

	Если СоздаватьИдентификатор Тогда
		стррПоля.GUID = Новый УникальныйИдентификатор();
	Иначе
		стррПоля.GUID = ТекДокумент.Ссылка.УникальныйИдентификатор();
	КонецЕсли;

	стррПоля.dt 	= ТекДокумент.Дата;
	стррПоля.IsPost = ТекДокумент.Проведен;
	Если ВыгружатьНомер Тогда
		ВставитьНомерДокументаВСтруктуру(стррПоля, ТекДокумент.Ссылка);
	КонецЕсли;

КонецПроцедуры

Функция СуммаВВалютеУчетаАгента(Сумма, ВалютаДокумента, НаДату)

	СуммаПересчитанная = Сумма;
	ВалютаУчетаАгента = КонстантыПолучитьЗначение("ВалютаРегламентированногоУчета");
	
	//{{dm_180426
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		ОбщийМодуль = Вычислить("ОбщегоНазначенияБККлиентСервер");
	Иначе
		ОбщийМодуль = Вычислить("РаботаСКурсамиВалют");
	КонецЕсли;	
	//}}dm_180426
	Если Не ВалютаДокумента = ВалютаУчетаАгента Тогда
			
		//++Дейнеко ВГ 2017-09-15 Бухгалтерия
		//{{dm_180426
		Если гКонфигурация = "Бухгалтерия_KZ" Тогда
			СуммаПересчитанная = ОбщийМодуль.ПересчитатьПоКурсу(Сумма, 
				ПолучитьКурсВалюты(ВалютаДокумента, НаДату), 
				ПолучитьКурсВалюты(ВалютаУчетаАгента, НаДату));
		Иначе
			СуммаПересчитанная = ОбщийМодуль.ПересчитатьВВалюту(Сумма, ВалютаДокумента, ВалютаУчетаАгента, НаДату);
		КонецЕсли;
		//}}dm_180426
		//СуммаПересчитанная = РаботаСКурсамиВалютУТ.ПересчитатьСуммуДокументаВВалюту(Сумма, ВалютаДокумента, ВалютаУчетаАгента, НаДату);
		//--Дейнеко ВГ 2017-09-15 Бухгалтерия
	КонецЕсли;

	Возврат СуммаПересчитанная;
	
КонецФункции

//dm_16.10.17,dm_180423:Внесены изменения для Бух30
Функция ПолучитьЦенуНоменклатуры(Номенклатура, ВидЦены, Характеристика = Неопределено) // sd_22082017
	
	//{{dm_180423
	ОбщийМодуль = ?(гКонфигурация = "Бухгалтерия_KZ", Вычислить("УправлениеЦенообразованием"), Вычислить("Ценообразование"));
	//}}dm_180423
	ЦенаНоменклатуры = ОбщийМодуль.ПолучитьЦенуНоменклатуры(Номенклатура, ВидЦены, ТекущаяДата(), КонстантыПолучитьЗначение("ВалютаРегламентированногоУчета"), , );
	//}}dm_180423
	Возврат ЦенаНоменклатуры;
	
КонецФункции

Функция ПрефиксОрганизацииИБ(Префикс)

	Префикс   = Прав("00" + СокрЛП(Префикс), 2);
	ПрефиксИБ = Прав("00" + СокрЛП(КонстантыПолучитьЗначение("ПрефиксУзлаРаспределеннойИнформационнойБазы")), 2);
	
	Возврат Префикс + ПрефиксИБ + "-";

КонецФункции // ПрефиксОрганизации()

Функция КонтактнаяИнформацияОрганизации(Организация)

	//{{dm_180424
	ТЗ_ОрганизацияКонтактнаяИнформация =
		?(гКонфигурация = "Бухгалтерия_KZ", ПолучитьКИОрганизации(Организация), Организация.КонтактнаяИнформация.Выгрузить());
	//}}dm_180424
	
	стррРезультат = Новый Структура("Телефон,ФактАдрес,ЮрАдрес");
	//{{dm_180424
	Для Каждого СтрокаКИ Из ТЗ_ОрганизацияКонтактнаяИнформация Цикл
	//}}dm_180424
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон
			И СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации Тогда
			стррРезультат.Телефон = СокрЛП(СтрокаКИ.Представление);
		ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес
			И СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации Тогда
			стррРезультат.ФактАдрес = СокрЛП(СтрокаКИ.Представление);
		ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес
			И СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации Тогда
			стррРезультат.ЮрАдрес = СокрЛП(СтрокаКИ.Представление);
		КонецЕсли;
	КонецЦикла;

	Возврат стррРезультат;
	
КонецФункции // КонтактнаяИнформацияОрганизации()

Функция ТипыКонтактнойИнформации()

	ствРезультат = Новый Соответствие;
	ствРезультат.Вставить(Перечисления.ТипыКонтактнойИнформации.Адрес, ВРег("a4d0f540-64ed-4f3e-b2bb-818da38f5ab2"));
	ствРезультат.Вставить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, ВРег("52477200-af54-405b-9888-14b8bded0e19"));
	ствРезультат.Вставить(Перечисления.ТипыКонтактнойИнформации.ВебСтраница, ВРег("2c2cfc86-e2a0-414d-a116-5acadac53437"));
	ствРезультат.Вставить(Перечисления.ТипыКонтактнойИнформации.Другое, ВРег("e45419b3-0cfd-47ce-8b24-7037a1e86aed"));
	ствРезультат.Вставить(Перечисления.ТипыКонтактнойИнформации.Телефон, ВРег("8fc8f351-14f0-48eb-952a-38bb313b28d5"));

	Возврат ствРезультат;
	
КонецФункции

Функция ФорматироватьЧисло(ТекЗнач) Экспорт

	Если ТекЗнач = 0 Тогда
		Возврат "0";
	Иначе
		Возврат Строка(Формат(ТекЗнач, "ЧГ=0; ЧРД='.'"));
	КонецЕсли;

КонецФункции

Функция ДатаВремяВФорматXMLИз1СМТ(лДатаВремя = Неопределено, Тип = "ДатаВремя") Экспорт

	ДатаВремя = ?(лДатаВремя = Неопределено, ТекущаяДата(), лДатаВремя);
	НужнаяДата = Формат(ДатаВремя, "ДФ=""гггг-ММ-дд""");
	НужноеВремя = Формат(ДатаВремя, "ДФ=""ЧЧ:мм:сс""");

	Если Тип = "Дата" Тогда
		НужноеЗначение = НужнаяДата;
	ИначеЕсли Тип = "Время" Тогда
		НужноеЗначение = НужноеВремя;
	Иначе
		Если ПустаяСтрока(НужнаяДата) или  ПустаяСтрока(НужноеВремя) Тогда
			Возврат "";
		КонецЕсли;
		НужноеЗначение = НужнаяДата + "T" + НужноеВремя;
	КонецЕсли;
	
	Возврат НужноеЗначение;
КонецФункции //ДатаВремяВФорматXMLИз1СМТ()

Функция СписокЗначенийВСтрокуМТ20(Список)
	
	Стр = Строка(Список);
	Возврат СтрЗаменить(Стр, "; ", ",");
	
КонецФункции

Функция ЗначениеВСтрокуДляXML(Значение)

	Тип = ТипЗнч(Значение);
	
	Если Тип = Тип("Строка") Тогда
		
		Возврат XMLСтрока(Значение);
		
	ИначеЕсли Тип = Тип("Число") Тогда
		
		Возврат XMLСтрока(ФорматироватьЧисло(Значение));
		
	ИначеЕсли Тип = Тип("Булево") Тогда
		
		Возврат XMLСтрока(Число(Значение));
		
	ИначеЕсли Тип = Тип("Дата") Тогда
		
		Возврат XMLСтрока(ДатаВремяВФорматXMLИз1СМТ(Значение));
		
	ИначеЕсли Тип = Тип("УникальныйИдентификатор") Тогда
		
		Возврат ВРег(XMLСтрока(Значение));
		
	ИначеЕсли Тип = Тип("СписокЗначений") Тогда
		
		Возврат XMLСтрока(СписокЗначенийВСтрокуМТ20(Значение));
		
	ИначеЕсли Тип = Тип("Цвет") Тогда
		
		Возврат ЦветВСтроку(Значение);
		
	ИначеЕсли Не ЗначениеЗаполнено(Значение) Тогда
		
		Возврат "";
		
	Иначе // тип Справочник или Документ
		
		Возврат ВРег(XMLСтрока(Значение.Ссылка.УникальныйИдентификатор()));
		
	КонецЕсли;
	
КонецФункции

Функция ЗначениеИзСтрокиXML(Значение, Тип)

	Если Тип = Тип("Строка") Тогда
		
		Возврат Значение;
		
	ИначеЕсли Тип = Тип("Число") Тогда
		
		Возврат ?(ЗначениеЗаполнено(Значение), Число(Значение), 0);
		
	ИначеЕсли Тип = Тип("Дата") Тогда
		
		Возврат ДатаВремяXMLВФормат1С(Значение);
		
	ИначеЕсли Тип = Тип("Булево") Тогда
		
		Возврат ?(ЗначениеЗаполнено(Значение), Булево(Число(Значение)), Ложь);
		
	ИначеЕсли Тип = Тип("Цвет") Тогда
		
		Возврат ЦветИзСтроки(Значение);
		
	ИначеЕсли Тип = Тип("УникальныйИдентификатор") Тогда
		
		Возврат Новый УникальныйИдентификатор(Значение);
		
	Иначе 
		
		Возврат Значение;
		
	КонецЕсли;
	
КонецФункции

//Дейнеко ВГ 2017-09-15|dm_02.10.17:Внесены изменения
Функция СформированныйМакетКомпоновкиДанных(Отбор, ТекстЗапроса)

	СхемаКомпоновки = СхемаКомпоновкиДанныхДляОбъекта(ТекстЗапроса);
	НастройкиКомпоновки = КомпоновщикНастроекАгента(СхемаКомпоновки);
	//Замена
	Если ТипЗнч(Отбор) <> Тип("Массив")  Тогда
		ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(ЭлементОтбора, Отбор);
	Иначе	
		 Для каждого Элемент Из Отбор Цикл
			ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ЭлементОтбора, Элемент);
		 КонецЦикла; 
	КонецЕсли; 
	
	//МакетКомпоновки = КомпоновкаДанныхСервер.ПолучитьМакетКомпоновки(СхемаКомпоновки, НастройкиКомпоновки);
	//dm_02.10.17:Перенес формирование МакетаКомпоновки после условия отбора; Убрал закомментированность условия отбора
	//++Дейнеко ВГ 2017-09-15 Бухгалтерия
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки =  КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));	
	//--Дейнеко ВГ 2017-09-15 Бухгалтерия
	
	Возврат МакетКомпоновки;

КонецФункции 

#Область ВыборкиДанныхПоСправочникам

Функция ДанныеПоПартнерамДляВыгрузки(МенеджерВТ)

	СтатусыПартнеров = СтатусыПартнеровИзНастроек();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыПартнеров.Партнер,
	|	СтатусыПартнеров.Статус
	|ПОМЕСТИТЬ СтатусыПартнеров
	|ИЗ
	|	&СтатусыПартнеров КАК СтатусыПартнеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Партнеры.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ЕСТЬNULL(СтатусыПартнеров.Статус, """")) КАК Статус
	|ИЗ
	|	ВТ_Партнеры КАК ВТ_Партнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыПартнеров КАК СтатусыПартнеров
	|		ПО ВТ_Партнеры.Ссылка = СтатусыПартнеров.Партнер
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Партнеры.Ссылка");
	Запрос.УстановитьПараметр("СтатусыПартнеров", СтатусыПартнеров);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	Возврат Запрос.Выполнить();
	
КонецФункции 

//dm: Не используется, т.к. не выгружаем торговые точки 
Функция ДанныеПоКонтрагентамДляВыгрузки(МенеджерВТ)
	

//++Дейнеко ВГ 2017-09-29 Бухгалтерия
	
	//ТекстЗапроса = 
	//	"ВЫБРАТЬ
	//	|	Контрагенты.Ссылка,
	//	|	Контрагенты.Наименование,
	//	|	Контрагенты.ДополнительнаяИнформация,
	//	|	Контрагенты.Родитель,
	//	|	Контрагенты.ЭтоГруппа
	//	|ИЗ
	//	|	Справочник.Контрагенты КАК Контрагенты
	//	|ГДЕ
	//	|	НЕ Контрагенты.ПометкаУдаления";
	
	//{{dm_180425
	стррЛитералы = Новый Структура("ПолеДополнительнаяИнформация");
	стррЛитералы.ПолеДополнительнаяИнформация = ?(гКонфигурация = "Бухгалтерия_KZ", "Контрагенты.Комментарий", "Контрагенты.ДополнительнаяИнформация");
	//}}dm_180425
		
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Наименование КАК Наименование,
		//|	Контрагенты.ДополнительнаяИнформация КАК ДополнительнаяИнформация, //{{dm_180425
		|	[ПолеДополнительнаяИнформация] КАК ДополнительнаяИнформация,
		|	Контрагенты.Родитель КАК Родитель,
		|	Контрагенты.ЭтоГруппа
		|ИЗ
		|	ВТ_Партнеры КАК ВТ_Партнеры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО ВТ_Партнеры.Ссылка = Контрагенты.Ссылка
		|ГДЕ
		|	Не Контрагенты.ПометкаУдаления";
	
	//Замена - не уверен что исходная
		//ТекстЗапроса = 
	//	"ВЫБРАТЬ
	//	|	Контрагенты.Ссылка КАК Ссылка,
	//	|	Контрагенты.Наименование КАК Наименование,
	//	|	Контрагенты.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	//	|	Контрагенты.Партнер КАК Партнер
	//	|ИЗ
	//	|	ВТ_Партнеры КАК ВТ_Партнеры
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	//	|		ПО ВТ_Партнеры.Ссылка = Контрагенты.Партнер
	//	|ГДЕ
	//	|	Не Контрагенты.ПометкаУдаления";
	
		//++Дейнеко ВГ 2017-09-29 Бухгалтерия
		
	//{{dm_180425	
	ЗаменитьЛитералы(ТекстЗапроса, стррЛитералы); //dm_180425 : Подставляем поле в соответствии с конфигурацией
	//}}dm_180425
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	Возврат Запрос.Выполнить();
	
КонецФункции 

Функция ДанныеПоКонтактнымЛицамПартнеровВыгрузки(МенеджерВТ)
	
	//++Дейнеко ВГ 2017-09-19 Бухгалтерия
	//Нет вбух30 КотактныхЛицпартнеров, но зато есть КонтактныеЛица
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка,
	|	КонтактныеЛицаПартнеров.ОбъектВладелец КАК Партнер,
	|	КонтактныеЛицаПартнеров.Наименование,
	|	КонтактныеЛицаПартнеров.Описание КАК Комментарий
	|ИЗ
	|	ВТ_Партнеры КАК ВТ_Партнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица КАК КонтактныеЛицаПартнеров
	|		ПО ВТ_Партнеры.Ссылка = КонтактныеЛицаПартнеров.ОбъектВладелец
	|";
	
	//--Дейнеко ВГ 2017-09-19 Бухгалтерия
	
	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	Возврат Запрос.Выполнить();
	
КонецФункции 

Функция ДанныеПоКонтактамПартнеровИКонтактныхЛицВыгрузки(МенеджерВТ)
	
	//{{dm_180425
	стррЛитералы = Новый Структура("Ссылка,Соединение1,Соединение2,Соединение3");
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррЛитералы.Ссылка = "Объект";
		
		стррЛитералы.Соединение1 = "		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
								    |		ПО ВТ_Партнеры.Ссылка = ПартнерыКонтактнаяИнформация.Объект";
		
		стррЛитералы.Соединение2 = "		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
								    |		ПО ВТ_Партнеры.Ссылка = КонтактныеЛицаПартнеровКонтактнаяИнформация.Объект.ОбъектВладелец";
		
		стррЛитералы.Соединение3 = "	РегистрСведений.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
									|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Партнеры КАК ВТ_Партнеры
									|		ПО КонтрагентыКонтактнаяИнформация.Объект = ВТ_Партнеры.Ссылка";
	Иначе
		стррЛитералы.Ссылка = "Ссылка";
		
		стррЛитералы.Соединение1 = "		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
								    |		ПО ВТ_Партнеры.Ссылка = ПартнерыКонтактнаяИнформация.Ссылка";
		
		стррЛитералы.Соединение2 = "		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
								    |		ПО ВТ_Партнеры.Ссылка = КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.ОбъектВладелец";
		
		стррЛитералы.Соединение3 = "	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
									|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Партнеры КАК ВТ_Партнеры
									|		ПО КонтрагентыКонтактнаяИнформация.Ссылка = ВТ_Партнеры.Ссылка";
	КонецЕсли;
	
	//}}dm_180425
	
	
	//++Дейнеко ВГ 2017-09-19 Бухгалтерия
	Текстзапроса =
	"ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.[Ссылка] КАК Партнер,
	|	NULL КАК КонтактноеЛицо,
	|	NULL КАК Контрагент,
	|	ПартнерыКонтактнаяИнформация.Тип,
	|	ПартнерыКонтактнаяИнформация.Вид,
	|	ПартнерыКонтактнаяИнформация.Представление
	|ПОМЕСТИТЬ КИПартнеров
	|ИЗ
	|	ВТ_Партнеры КАК ВТ_Партнеры
	|[Соединение1]
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.[Ссылка],
	|	NULL,
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип,
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Вид,
	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление
	|ИЗ
	|	ВТ_Партнеры КАК ВТ_Партнеры
	|[Соединение2]
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	КонтрагентыКонтактнаяИнформация.[Ссылка],
	|	КонтрагентыКонтактнаяИнформация.Тип,
	|	КонтрагентыКонтактнаяИнформация.Вид,
	|	КонтрагентыКонтактнаяИнформация.Представление
	|ИЗ
	|[Соединение3]
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КИПартнеров.Партнер, """") КАК Партнер,
	|	ЕСТЬNULL(КИПартнеров.КонтактноеЛицо, """") КАК КонтактноеЛицо,
	|	ЕСТЬNULL(КИПартнеров.Контрагент, """") КАК Контрагент,
	|	КИПартнеров.Тип,
	|	КИПартнеров.Вид,
	|	КИПартнеров.Представление
	|ИЗ
	|	КИПартнеров КАК КИПартнеров";
	
	//{{dm_180425	
	ЗаменитьЛитералы(ТекстЗапроса, стррЛитералы); //dm_180425 : Подставляем поле в соответствии с конфигурацией
	//}}dm_180425
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	Возврат Запрос.Выполнить();
	
КонецФункции

//dm_25.09.17:Внесены изменения
Функция ДанныеПоСоглашениямВыгрузки(МенеджерВТ)

	Запрос = Новый Запрос(ТекстЗапросаВыборкиСоглашений());
	Запрос.УстановитьПараметр("Организации", ОрганизацииВыгрузки());
	//dm_25.09.17:В бух30 у Договора нет статуса. Вместо этого использую срок действия 
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	Возврат Запрос.Выполнить();
	
КонецФункции

// sk_190718 Процедура исключена в рамках (MOD-236)
// ЗапросПоНоменклатуре()
Функция ЗапросПоНоменклатуре_OLD(МенеджерВТ, ДоступныеВидыЦен)

	ВалютаУчета 	= КонстантыПолучитьЗначение("ВалютаРегламентированногоУчета");
	КурсВалюты 		= 1;
	КратностьВалюты = 1;

	Запрос = Новый Запрос(ТекстЗапросаПолученияНоменклатуры_OLD());
	
	//++Дейнеко ВГ 2017-09-20 Бухгалтерия
	//{{dm_180425
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		СчетаУчетаСкладИНоменклатура = ПланыСчетовЗапасы();
	Иначе
		СчетаУчетаСкладИНоменклатура = ПланыСчетов["Хозрасчетный"].ТоварыНаСкладах.Ссылка;
	КонецЕсли;
	Запрос.УстановитьПараметр("СчетаУчетаСкладИНоменклатура", СчетаУчетаСкладИНоменклатура);
	//}}dm_180425
	Запрос.УстановитьПараметр("ЕдинственныйСклад", "ЕдинственныйСклад");
	Запрос.УстановитьПараметр("Валюта", ВалютаУчета);
	Запрос.УстановитьПараметр("КратностьВалюты", КратностьВалюты);
	Запрос.УстановитьПараметр("КурсВалюты", КурсВалюты);
	Запрос.УстановитьПараметр("ВидыЦен", ДоступныеВидыЦен);
	Запрос.УстановитьПараметр("ВыгружатьТоварыСНулевымОстатком", ВыгружатьТоварыСНулевымОстатком);
	Запрос.УстановитьПараметр("РежимВыгрузкиКодов", РежимВыгрузкиКодовНоменклатуры);
	Запрос.УстановитьПараметр("МобильныйСклад", ВыбНастройкиАгента.МобильныйСклад);
	Запрос.УстановитьПараметр("Код", "КОД");
	Запрос.УстановитьПараметр("Артикул", "АРТИКУЛ");

	//--Дейнеко ВГ 2017-09-20 Бухгалтерия
	
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	Возврат Запрос;
	
КонецФункции 
 
Функция ДанныеПоЕдиницамИзмеренияВыгрузки(МенеджерВТ)

	Запрос = Новый Запрос(ТекстЗапросаВыборкиЕдиницИзмерения());
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	//{{dm_180313
	Упаковки = ПрочитатьЗначениеНастройки("УпаковкиНоменклатуры");
	Если Упаковки = Неопределено Тогда
		//КвалификаторыСтроки = Новый КвалификаторыСтроки(40);
		//КвалификаторыЧислаПУ = Новый КвалификаторыЧисла(1,0,ДопустимыйЗнак.Неотрицательный);
		//КвалификаторыЧислаК = Новый КвалификаторыЧисла(3,3,ДопустимыйЗнак.Неотрицательный);
		//тУпаковки = Новый ТаблицаЗначений;
		//тУпаковки.Колонки.Добавить("Код");
		//тУпаковки.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , , ,КвалификаторыСтроки));
		//тУпаковки.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", , , КвалификаторыЧислаК));
		//тУпаковки.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		//тУпаковки.Колонки.Добавить("ЕдиницаИзмеренияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
		//тУпаковки.Колонки.Добавить("УникальныйИдентификатор", Новый ОписаниеТипов("Строка", , , ,КвалификаторыСтроки));
		//тУпаковки.Колонки.Добавить("ПометкаУдаления", Новый ОписаниеТипов("Число", , , КвалификаторыЧислаПУ));
		тзУпаковки = СоздатьТаблицуУпаковок(); //dm_180817
	Иначе
		тзУпаковки = Упаковки.Скопировать();	
		тзУпаковки.Колонки.Удалить("УникальныйИдентификатор");
		КвалификаторыСтроки = Новый КвалификаторыСтроки(40);
		тзУпаковки.Колонки.Добавить("УникальныйИдентификатор",Новый ОписаниеТипов("Строка", , , ,КвалификаторыСтроки));
		Индекс = 0;
		Для Каждого СтрокаТ Из Упаковки Цикл
			тзУпаковки[Индекс].УникальныйИдентификатор = Строка(СтрокаТ.УникальныйИдентификатор);
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЕсли;
	//}}dm_180313
	
	Запрос.УстановитьПараметр("ПустаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
	Запрос.УстановитьПараметр("Упаковки", тзУпаковки);
	
	Возврат Запрос.Выполнить();
	
КонецФункции // ДанныеПоЕдиницамИзмеренияВыгрузки()

// sk_190718 Процедура добавлена в рамках (MOD-236) 
// Выполняет заполнение временной таблицы ВТ_Остатки
//
// Параметры:
//  МенеджерВТ - МенеджерВременнытТаблиц - менеджер ВТ
//
Процедура МенеджерВТОстатки(МенеджерВТ)

	стррЛитералы = Новый Структура("Регистр, Подразделение, Субконто");
	
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррЛитералы.Регистр 	   = "Типовой";
		стррЛитералы.Подразделение = "СтруктурноеПодразделение";
	Иначе
		стррЛитералы.Регистр 	   = "Хозрасчетный";		
		стррЛитералы.Подразделение = "Подразделение";
	КонецЕсли;
	 
	стррЛитералы.Субконто = ПолучитьСубконтоПоСкладам();
	
	Если Не ЗначениеЗаполнено(стррЛитералы.Субконто) Тогда
		стррЛитералы.Субконто = "Субконто3";
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки_КонОст.Субконто1 КАК Номенклатура,
	|	ХозрасчетныйОстатки_КонОст.[Субконто] КАК Склад,
	|	ХозрасчетныйОстатки_КонОст.КоличествоОстаток КАК Остаток
	|ПОМЕСТИТЬ ВТ_ОстаткиБезГруппировки
	|ИЗ
	|	ВТ_Ассортимент КАК ВТ_Ассортимент
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.[Регистр].Остатки(, Счет В (&СчетаУчетаСкладИНоменклатура), , ) КАК ХозрасчетныйОстатки_КонОст
	|	ПО ВТ_Ассортимент.Ссылка = ХозрасчетныйОстатки_КонОст.Субконто1
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК ВТ_Склады
	|	ПО	ХозрасчетныйОстатки_КонОст.[Субконто] = ВТ_Склады.Ссылка  
	|ГДЕ
	|	ВЫБОР
	|		КОГДА &ВыгружатьТоварыСНулевымОстатком
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ 
	|			ЕСТЬNULL(ХозрасчетныйОстатки_КонОст.КоличествоОстаток, 0) > 0
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиБезГруппировки.Номенклатура КАК Номенклатура,
	|	ВТ_ОстаткиБезГруппировки.Склад КАК Склад,
	|	СУММА(ВТ_ОстаткиБезГруппировки.Остаток) КАК Остаток
	|	ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	ВТ_ОстаткиБезГруппировки КАК ВТ_ОстаткиБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиБезГруппировки.Номенклатура,
	|	ВТ_ОстаткиБезГруппировки.Склад
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ОстаткиБезГруппировки 
	|";
	
	ЗаменитьЛитералы(Запрос.Текст, стррЛитералы);

	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		СчетаУчетаСкладИНоменклатура = ПланыСчетовЗапасы();
	Иначе
		СчетаУчетаСкладИНоменклатура = ПланыСчетов["Хозрасчетный"].ТоварыНаСкладах.Ссылка;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СчетаУчетаСкладИНоменклатура", 	 СчетаУчетаСкладИНоменклатура);
	Запрос.УстановитьПараметр("ВыгружатьТоварыСНулевымОстатком", ВыгружатьТоварыСНулевымОстатком);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();	

КонецПроцедуры

// sk_190718 Процедура добавлена в рамках (MOD-236)
// Выполняет заполнение временной таблицы ВТ_Номенклатура
//
// Параметры:
//  МенеджерВТ - МенеджерВременнытТаблиц - менеджер ВТ
//
Процедура МенеджерВТНоменклатура(МенеджерВТ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВТ_Остатки.Номенклатура КАК Номенклатура
				   |ПОМЕСТИТЬ ВТ_Номенклатура
				   |ИЗ
				   |	ВТ_Остатки КАК ВТ_Остатки
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ВТ_Остатки.Номенклатура
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Номенклатура
				   |";
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

// sk_190718 Процедура добавлена в рамках (MOD-236)
// Выполняет заполнение временной таблицы ВТ_Цены
//
// Параметры:
//  МенеджерВТ - МенеджерВременнытТаблиц - менеджер ВТ
//
Процедура МенеджерВТЦеныНоменклатуры(МенеджерВТ)

	ВалютаУчета      = КонстантыПолучитьЗначение("ВалютаРегламентированногоУчета");
	ДоступныеВидыЦен = ВидыЦенВыгрузки();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СпрТипыЦенНоменклатуры.Ссылка КАК ТипЦен
	               |ПОМЕСТИТЬ ВТ_ТипыЦен
	               |ИЗ
	               |	Справочник.ТипыЦенНоменклатуры КАК СпрТипыЦенНоменклатуры
	               |ГДЕ
	               |	СпрТипыЦенНоменклатуры.Ссылка В(&ТипыЦен)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ТипЦен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	               |	ВТ_ТипыЦен.ТипЦен КАК ТипЦен
	               |ПОМЕСТИТЬ ВТ_НоменклатураИТипыЦен
	               |ИЗ
	               |	ВТ_Номенклатура КАК ВТ_Номенклатура,
	               |	ВТ_ТипыЦен КАК ВТ_ТипыЦен
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	ТипЦен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КурсыВалют.Валюта КАК Валюта,
	               |	ВЫБОР
	               |		КОГДА КурсыВалют.Курс ЕСТЬ NULL
	               |			ТОГДА 1
	               |		КОГДА КурсыВалют.Курс = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ КурсыВалют.Курс
	               |	КОНЕЦ / ВЫБОР
	               |		КОГДА КурсыВалют.Кратность ЕСТЬ NULL
	               |			ТОГДА 1
	               |		КОГДА КурсыВалют.Кратность = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ КурсыВалют.Кратность
	               |	КОНЕЦ КАК КурсКратный
	               |ПОМЕСТИТЬ ВТ_КурсыВалют
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалют
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Валюта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_НоменклатураИТипыЦен.Номенклатура КАК Номенклатура,
	               |	ВТ_НоменклатураИТипыЦен.ТипЦен КАК ТипЦен,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА &ВалютаУчета <> ЦеныНоменклатуры.Валюта
	               |				ТОГДА ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) * ВТ_КурсыВалют.КурсКратный
	               |			ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
	               |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена
	               |ПОМЕСТИТЬ ВТ_Цены
	               |ИЗ
	               |	ВТ_НоменклатураИТипыЦен КАК ВТ_НоменклатураИТипыЦен
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ) КАК ЦеныНоменклатуры
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыВалют КАК ВТ_КурсыВалют
	               |			ПО ЦеныНоменклатуры.Валюта = ВТ_КурсыВалют.Валюта
	               |		ПО ВТ_НоменклатураИТипыЦен.Номенклатура = ЦеныНоменклатуры.Номенклатура
	               |			И ВТ_НоменклатураИТипыЦен.ТипЦен = ЦеныНоменклатуры.ТипЦен
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	ТипЦен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_ТипыЦен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_КурсыВалют";

	
	Запрос.УстановитьПараметр("ВалютаУчета", ВалютаУчета);
	Запрос.УстановитьПараметр("Дата", 	 	 ТекущаяДата());
	Запрос.УстановитьПараметр("ТипыЦен", 	 ДоступныеВидыЦен);

	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

// sk_190718 Функция добавлена в рамках (MOD-236)
// Возвращает запрос по Номенклатуре
//
// Параметры:
//  МенеджерВТ - МенеджерВременнытТаблиц - менеджер ВТ
//
// Возвращаемое значение: 
//  ВыборкаИзРезультатаЗапроса  
//
Функция ДанныеПоНоменклатуре(МенеджерВТ)

	ВыгружатьХарактеристики = Ложь;
	
	стррЛитералы = Новый Структура("СтавкаНДС, БазоваяЕдиницаИзмерения");
	
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррЛитералы.СтавкаНДС 	    		 = "СтавкаНДС";
		стррЛитералы.БазоваяЕдиницаИзмерения = "БазоваяЕдиницаИзмерения";
		
	Иначе		
		стррЛитералы.БазоваяЕдиницаИзмерения = "ЕдиницаИзмерения";
		
		Если ПоколениеКонфигурации(">=Бухгалтерия_3.0.67.38") Тогда
			стррЛитералы.СтавкаНДС = "ВидСтавкиНДС";
		Иначе
			стррЛитералы.СтавкаНДС = "СтавкаНДС";
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
				   |	ВЫБОР
				   |		КОГДА &РежимВыгрузкиКодов = ""КОД""
				   |			ТОГДА СпрНоменклатура.Код
				   |		КОГДА &РежимВыгрузкиКодов = ""АРТИКУЛ""
				   |			ТОГДА СпрНоменклатура.Артикул
				   |		ИНАЧЕ """"
				   |	КОНЕЦ КАК Код,
				   |	СпрНоменклатура.Наименование КАК Наименование,
				   |	СпрНоменклатура.[СтавкаНДС] КАК СтавкаНДС,
				   |	СпрНоменклатура.[БазоваяЕдиницаИзмерения] КАК БазоваяЕдиницаИзмерения,
				   |	&УчетПоХарактеристикам КАК УчетПоХарактеристикам,
				   |	Ложь Как Весовой,
				   |	СпрНоменклатура.Услуга КАК ЭтоУслуга,
				   |	СпрНоменклатура.НаименованиеПолное КАК НаименованиеПолное,
				   |	СпрНоменклатура.Комментарий КАК Описание,
			       |	Ложь КАК ЦеноваяГруппа,
				   |	СпрНоменклатура.Родитель КАК Родитель,
				   |	СпрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры
				   |ИЗ
				   |	ВТ_Номенклатура КАК ВТ_Номенклатура
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
				   |		ПО ВТ_Номенклатура.Номенклатура = СпрНоменклатура.Ссылка
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	СпрНоменклатура.Наименование,
				   |	СпрНоменклатура.Код,
				   |	СпрНоменклатура.Артикул
				   |";
	
	ЗаменитьЛитералы(Запрос.Текст, стррЛитералы);

	Запрос.УстановитьПараметр("РежимВыгрузкиКодов",    РежимВыгрузкиКодовНоменклатуры);
	Запрос.УстановитьПараметр("УчетПоХарактеристикам", ВыгружатьХарактеристики);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		
	Возврат Запрос.Выполнить();;

КонецФункции // ДанныеПоНоменклатуре()

// sk_190718 Функция добавлена в рамках (MOD-236)
// Возвращает запрос по остаткам Номенклатуры
//
// Параметры:
//  МенеджерВТ - МенеджерВременнытТаблиц - менеджер ВТ
//
// Возвращаемое значение: 
//  ВыборкаИзРезультатаЗапроса  
//
Функция ДанныеПоОстаткамНоменклатуры(МенеджерВТ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
				   |	ВТ_Склады.Ссылка КАК Склад
				   |ПОМЕСТИТЬ ВТ_НоменклатураИСклады 
				   |
				   |ИЗ
				   |	ВТ_Номенклатура КАК ВТ_Номенклатура,
				   |	ВТ_Склады КАК ВТ_Склады
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	ВТ_Номенклатура.Номенклатура,
				   |	ВТ_Склады.Ссылка
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
	               |	ВТ_НоменклатураИСклады.Номенклатура КАК Номенклатура,
	               |	ВТ_НоменклатураИСклады.Склад КАК Склад,
				   |	СУММА(ЕСТЬNULL(ВТ_Остатки.Остаток, 0)) КАК Остаток,
				   |	СУММА(ВЫБОР
				   |		КОГДА ВТ_НоменклатураИСклады.Склад = &МобильныйСклад
				   |			ТОГДА ЕСТЬNULL(ВТ_Остатки.Остаток, 0)
				   |		ИНАЧЕ 0
				   |	КОНЕЦ) КАК ОстатокНаБорту
				   |ПОМЕСТИТЬ ВТ_НоменклатураОстатокГР
				   |
				   |ИЗ
				   |	ВТ_НоменклатураИСклады КАК ВТ_НоменклатураИСклады
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
				   |		ПО ВТ_НоменклатураИСклады.Номенклатура = ВТ_Остатки.Номенклатура
				   |			И ВТ_НоменклатураИСклады.Склад = ВТ_Остатки.Склад 
				   |СГРУППИРОВАТЬ ПО
				   |	ВТ_НоменклатураИСклады.Номенклатура,
				   |	ВТ_НоменклатураИСклады.Склад
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Номенклатура,
				   |	Склад
				   |;
				   |
				   |
	               |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТ_НоменклатураОстатокГР.Номенклатура КАК Номенклатура,
				   |	ВТ_НоменклатураОстатокГР.Склад КАК Склад,
				   |	ВТ_НоменклатураОстатокГР.Остаток КАК Остаток,
				   |	ВТ_НоменклатураОстатокГР.ОстатокНаБорту КАК ОстатокНаБорту
				   |
				   |ИЗ
				   |	ВТ_НоменклатураОстатокГР КАК ВТ_НоменклатураОстатокГР
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
				   |		ПО ВТ_НоменклатураОстатокГР.Номенклатура = СпрНоменклатура.Ссылка
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
				   |		ПО ВТ_НоменклатураОстатокГР.Склад = СпрСклады.Ссылка
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	СпрНоменклатура.Наименование,
				   |	СпрНоменклатура.Код,
				   |	СпрСклады.Наименование
				   |
				   |ИТОГИ
				   |	СУММА(Остаток),
				   |	СУММА(ОстатокНаБорту)
				   |ПО
				   |	Номенклатура
				   |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_НоменклатураИСклады
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_НоменклатураОстатокГР
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_Остатки";

	Запрос.УстановитьПараметр("МобильныйСклад", ВыбНастройкиАгента.МобильныйСклад);

	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Возврат Запрос.Выполнить();

КонецФункции // ДанныеПоОстаткамНоменклатуры()

// sk_190718 Функция добавлена в рамках (MOD-236)
// Возвращает запрос по ценам Номенклатуре
//
// Параметры:
//  МенеджерВТ - МенеджерВременнытТаблиц - менеджер ВТ
//
// Возвращаемое значение: 
//  ВыборкаИзРезультатаЗапроса  
//
Функция ДанныеПоЦенамНоменклатуры(МенеджерВТ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВТ_Цены.Номенклатура КАК Номенклатура,
				   |	ВТ_Цены.ТипЦен КАК ТипЦен,
	               |	МАКСИМУМ(ВТ_Цены.Цена) КАК Цена
				   |ПОМЕСТИТЬ ВТ_НоменклатураЦеныГР
				   |
				   |ИЗ
				   |	ВТ_Цены КАК ВТ_Цены
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ВТ_Цены.Номенклатура,
				   |	ВТ_Цены.ТипЦен
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Номенклатура,
				   |	ТипЦен
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТ_НоменклатураЦеныГР.Номенклатура КАК Номенклатура,
				   |	ВТ_НоменклатураЦеныГР.ТипЦен КАК ТипЦен,
				   | 	ВТ_НоменклатураЦеныГР.Цена КАК Цена
				   |ИЗ
				   |	ВТ_НоменклатураЦеныГР КАК ВТ_НоменклатураЦеныГР
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
				   |		ПО ВТ_НоменклатураЦеныГР.Номенклатура = СпрНоменклатура.Ссылка
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыЦенНоменклатуры КАК СпрТипыЦен
				   |		ПО ВТ_НоменклатураЦеныГР.ТипЦен = СпрТипыЦен.Ссылка
				   |
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	СпрНоменклатура.Наименование,
				   |	СпрНоменклатура.Код,
				   |	СпрТипыЦен.Наименование
				   |ИТОГИ
				   |	СУММА(Цена)
				   |ПО
				   |	Номенклатура
				   |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_НоменклатураИТипыЦен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_НоменклатураЦеныГР
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_Цены
				   |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_Номенклатура";

	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Возврат Запрос.Выполнить();


КонецФункции // ДанныеПоЦенамНоменклатуры()

#КонецОбласти

#Область ВыборкиДанныхПоДокументам

Функция ДанныеПоДокументамЗаказПокупателя()
	
	//++Дейнеко ВГ 2017-09-29 Бухгалтерия
	Запрос = Новый Запрос(ТекстЗапросаВыборкиДокументовЗаказПокупателя());
	Запрос.УстановитьПараметр("ДатаНачала", НачалоВыгрузкиДокументов(ИнтервалВыгрузкиЗаказов));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Агент", ВыбАгент);
	//--Дейнеко ВГ 2017-09-29 Бухгалтерия
	
	Возврат Запрос.Выполнить();
	
КонецФункции // ДанныеПоДокументамЗаказПокупателя()

//dm_091017:Внесены изменения
Функция ДанныеПоДокументамПродажи()

	Если гКэшСпискиОбъектов.Получить("СписокЗаказов") = Неопределено Тогда 
		СписокЗаказов = "";
	Иначе 
		СписокЗаказов = гКэшСпискиОбъектов.Получить("СписокЗаказов");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапросаВыборкиДокументовРеализация());
	Запрос.УстановитьПараметр("ДатаНачала", НачалоВыгрузкиДокументов(ИнтервалВыгрузкиЗаказов));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
	//{{dm_091017
	Запрос.УстановитьПараметр("Склад", ВыбНастройкиАгента.Мобильныйсклад);
	Запрос.УстановитьПараметр("Агент", ВыбАгент);
	//}}dm_091017
	Возврат Запрос.Выполнить();
	
КонецФункции

//dm_161017:Внесены изменения
Функция ДанныеПоДокументамПеремещения() // sd_22082017
	
	//ИнтервалВыгрузкиПеремещений = 7; // sd_22082017 вывести в настройки
	
	Запрос = Новый Запрос(ТекстЗапросаВыборкиДокументовПеремещение());
	Запрос.УстановитьПараметр("ДатаНачала", НачалоВыгрузкиДокументов(ИнтервалВыгрузкиПеремещений));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Склад", ВыбНастройкиАгента.МобильныйСклад);
	//dm_161017:Убрал Статус
	Запрос.УстановитьПараметр("Агент", ВыбАгент);

	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

Функция СтатусыПартнеровИзНастроек()

	ПартнерыИСтатусы = Новый ТаблицаЗначений;
	
	//++Дейнеко ВГ 2017-09-19 Бухгалтерия
	ПартнерыИСтатусы.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	//--Дейнеко ВГ 2017-09-19 Бухгалтерия
	
	ПартнерыИСтатусы.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	Статусы = СтатусыПартнеровВыгрузки();
	Для Каждого ЭлементСтатуса Из Статусы Цикл
		ПартнерыСтауса = ЭлементСтатуса.Партнеры;
		Если ПартнерыСтауса <> Неопределено Тогда
			Для Каждого ЭлементСписка Из ПартнерыСтауса Цикл
				СтрокаПартеровСтатуса = ПартнерыИСтатусы.Добавить();
				СтрокаПартеровСтатуса.Партнер = ЭлементСписка.Значение;
				СтрокаПартеровСтатуса.Статус = ЭлементСтатуса.Идентификатор;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Возврат ПартнерыИСтатусы;
	
КонецФункции // СтатусыПартнеровИзНастроек()

Функция СтавкаНДСЧислом(Знач СтавкаНДС, НДСпоСтавкам4и2 = Ложь) Экспорт
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС10
		ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		
		Возврат ?(НДСпоСтавкам4и2, 0.02, 0.1);
		
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18
		ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		
		Возврат ?(НДСпоСтавкам4и2, 0.04, 0.18);
	//(( sk_190115
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20
		Или СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		
		Возврат ?(НДСпоСтавкам4и2, 0.04, 0.20);
	//)) sk_190115
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаВыборкиОрганизаций()

	стррЛитералы = Новый Структура("ИНН_ИПрочее,Соединение");
	//{{dm_180424
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррЛитералы.ИНН_ИПрочее = "
			|	Организации.ИдентификационныйНомер КАК ИНН,
			|	"""" КАК КПП,
			|	"""" КАК ОГРН";
		стррЛитералы.Соединение = "";
	Иначе
		стррЛитералы.ИНН_ИПрочее = "
			|	Организации.ИНН КАК ИНН,
			|	Организации.КПП КАК КПП,
			|	Организации.ОГРН КАК ОГРН";
		стррЛитералы.Соединение = "";
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Организации.Ссылка КАК Ссылка,
		|	Организации.Префикс КАК Префикс,
		//|	Организации.НаименованиеПолное КАК НаименованиеПолное, //dm_180424 НаименованиеПолное имеет неограниченную длину
		|	ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(250)) КАК НаименованиеПолное,
		|	[ИНН_ИПрочее]
		|{ВЫБРАТЬ
		|	Ссылка.*}
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		[Соединение]
		|{ГДЕ
		|	Организации.Ссылка.* КАК Организации}
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организации.Наименование";
		
	ЗаменитьЛитералы(ТекстЗапроса, стррЛитералы);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВыборкиВидовКонтактнойИнформации()
	
	//{{dm_180424
	стррЛитералы = Новый Структура("УсловиеГруппа, ПолеРодитель");
	стррЛитералы.УсловиеГруппа = ?(гКонфигурация = "Бухгалтерия_KZ", "", "И НЕ ВидыКонтактнойИнформации.ЭтоГруппа");
	стррЛитералы.ПолеРодитель = ?(гКонфигурация = "Бухгалтерия_KZ", "ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации", "ВидыКонтактнойИнформации.Родитель");
	//}}dm_180424

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыКонтактнойИнформации.Ссылка,
	|	ВидыКонтактнойИнформации.Наименование,
	|	ВидыКонтактнойИнформации.Тип.Ссылка КАК ТипКИ,
	|	[ПолеРодитель] КАК Родитель
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	НЕ ВидыКонтактнойИнформации.ПометкаУдаления
	|	[УсловиеГруппа]
	|
	|УПОРЯДОЧИТЬ ПО
	|	Родитель";

	ЗаменитьЛитералы(ТекстЗапроса, стррЛитералы); //dm_180424 : Подставляем поле в соответствии с конфигурацией
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаВыборкиВидовЦен()
	
	//++Дейнеко ВГ 2017-09-19 Бухгалтерия
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыЦен.Ссылка КАК Ссылка
	|{ВЫБРАТЬ
	|	Ссылка.*}
	|ИЗ
	|	Справочник.ТипыЦенНоменклатуры КАК ВидыЦен
	|{ГДЕ
	|	ВидыЦен.Ссылка.* КАК ВидыЦен}
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыЦен.Наименование";
	//--Дейнеко ВГ 2017-09-19 Бухгалтерия

	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаВыборкиСклады()

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склады.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Склады
	|{ВЫБРАТЬ
	|	Ссылка.*}
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	НЕ Склады.ЭтоГруппа
	|{ГДЕ
	|	Склады.Ссылка.* КАК Склады}";

	Возврат ТекстЗапроса;
КонецФункции

//{{dm_180831: Добавил функцию, используется в: Процедура МенеджерВТСклады(МенеджерВТ)
функция ДополнительныйТекстЗапросаВыборкиСкладов()
	
	ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ
		|		
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ 
		|	Не Склады.ПометкаУдаления
		|	И Склады.Ссылка = &МобильныйСклад";
	
	Возврат ТекстЗапроса;
	
КонецФункции
//}}dm_180831	
	
	
Функция ТекстЗапросаВыборкиПартнеров()
	
	//++Дейнеко ВГ 2017-09-18 Бухгалтерия
	//КА это юр информация
	//Партнер это фактическая инормация
	//Тоесть у КА может быть несколько партнеров с разной юр. информацией
	
		ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Партнеры
	|{ВЫБРАТЬ
	|	Ссылка.*}
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ПометкаУдаления
	|	И НЕ Контрагенты.ЭтоГруппа
	|{ГДЕ
	|	Контрагенты.Ссылка.* КАК Контрагенты}";
	
	//--Дейнеко ВГ 2017-09-18 Бухгалтерия
	Возврат ТекстЗапроса;
КонецФункции

//dm_180521: Добавил функцию, используется в: Процедура МенеджерВТПартнеров(МенеджерВТ)
функция ДополнительныйТекстЗапросаВыборкиПартнеров(Объединить = Истина) //dm_180817 Изменил название (CodeReview_180810)
	
	ТекстОбъединение = ?(Объединить, "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|", "");
	ТекстПоместить = ?(Объединить, "", "
		|ПОМЕСТИТЬ ВТ_Партнеры");
	
	ТекстЗапроса = ТекстОбъединение + "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Партнеры.Ссылка КАК Ссылка" + ТекстПоместить + "
		|ИЗ
		|	Справочник.Контрагенты КАК Партнеры
		|ГДЕ 
		|	Не Партнеры.ПометкаУдаления
		|	И Партнеры.Ссылка В(&Маршруты)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВыборкиКонтрагентов()
	//++Дейнеко ВГ 2017-09-18 Бухгалтерия
	// тк партнеров в бух 30 нет поэтому 
	//парнеры это КА с пустым ГоловнойКонтрагент
	//а контрагенты это КА который не явдяется реквизитом ГоловнойКонтрагент в спр КА
	
	//КА это юр информация
	//Партнер это фактическая инормация
	//Тоесть у КА может быть несколько партнеров с разной юр. информацией
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Контрагенты
	|{ВЫБРАТЬ
	|	Ссылка.*}
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ПометкаУдаления
	|	И НЕ Контрагенты.ЭтоГруппа
	|{ГДЕ
	|	Контрагенты.Ссылка.* КАК Контрагенты}";

	//--Дейнеко ВГ 2017-09-18 Бухгалтерия
	
	Возврат ТекстЗапроса;
КонецФункции 

//dm_170922,dm_180425:Внесены изменения
Функция ТекстЗапросаВыборкиСоглашений()

	//++dm_22.09.17
	Если ИспользоватьПунктыРазгрузки Тогда 
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка,
		|	ДоговорыКонтрагентов.Наименование,
		|	ДоговорыКонтрагентов.Контрагент КАК Партнер,
		|	ДоговорыКонтрагентов.Дата,
		|	ДоговорыКонтрагентов.ДатаОкончанияДействия,
		|	ДоговорыКонтрагентов.Организация,
		|	"""" КАК НалогообложениеНДС,
		|	"""" КАК ВидЦен,
		|	"""" КАК Контрагент
		|ИЗ
		|	ВТ_Контрагенты КАК ВТ_Контрагенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ВТ_Контрагенты.Ссылка = ДоговорыКонтрагентов.Контрагент
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.Организация В(&Организации)";
		
		Возврат ТекстЗапроса;
	КонецЕсли;
	
	//--dm_22.09.17
	
	//{{dm_180425
	стррЛитералы = Новый Структура("Номер,Дата,ДатаНачалаДействия,ДатаОкончанияДействия");
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррЛитералы.Номер = "НомерДоговора КАК Номер";
		стррЛитералы.Дата = "ДатаДоговора КАК Дата";
		стррЛитералы.ДатаНачалаДействия = "ДатаНачалаДействияДоговора";
		стррЛитералы.ДатаОкончанияДействия = "ДатаОкончанияДействияДоговора";
	Иначе
		стррЛитералы.Номер = "Номер";
		стррЛитералы.Дата = "Дата";
		стррЛитералы.ДатаНачалаДействия = "Дата";
		стррЛитералы.ДатаОкончанияДействия = "СрокДействия";
	КонецЕсли;		
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.[Номер],
	|	ДоговорыКонтрагентов.[Дата],
	|	ДоговорыКонтрагентов.ТипЦен,
	|	ДоговорыКонтрагентов.[ДатаНачалаДействия] КАК ДатаНачалаДействия,
	|	ДоговорыКонтрагентов.[ДатаОкончанияДействия] КАК ДатаОкончанияДействия,
	|	ДоговорыКонтрагентов.Наименование,
	|	ДоговорыКонтрагентов.Организация,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.[ДатаОкончанияДействия] = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ""Без Срока""
	|		КОГДА ДоговорыКонтрагентов.[ДатаОкончанияДействия] > &ТекДата
	|			ТОГДА ""Действует""
	|		ИНАЧЕ ""Закрыт""
	|	КОНЕЦ КАК Статус
	|ПОМЕСТИТЬ СоглашенияПартнеров
	|ИЗ
	|	ВТ_Партнеры КАК ВТ_Партнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВТ_Партнеры.Ссылка = ДоговорыКонтрагентов.Владелец
	|ГДЕ
	|	ДоговорыКонтрагентов.Организация В(&Организации)
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоглашенияПартнеров.Номер,
	|	СоглашенияПартнеров.Дата,
	|	СоглашенияПартнеров.ТипЦен,
	|	СоглашенияПартнеров.ДатаНачалаДействия,
	|	СоглашенияПартнеров.ДатаОкончанияДействия,
	|	СоглашенияПартнеров.Наименование,
	|	СоглашенияПартнеров.Организация,
	|	СоглашенияПартнеров.Контрагент,
	|	СоглашенияПартнеров.Ссылка
	|ИЗ
	|	СоглашенияПартнеров КАК СоглашенияПартнеров
	|ГДЕ
	|	НЕ СоглашенияПартнеров.Статус = ""Закрыт""
	|";
	//}}dm_180425
	
	//{{dm_180425	
	ЗаменитьЛитералы(ТекстЗапроса, стррЛитералы); //dm_180425 : Подставляем поле в соответствии с конфигурацией
	//}}dm_180425
	
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапросаВыборкиСоглашений()

Функция ТекстЗапросаВыборкиНоменклатуры()

	//{{dm_180424
	стррЛитералы = Новый Структура("ЕдиницаИзмерения");
	стррЛитералы.ЕдиницаИзмерения = ?(гКонфигурация = "Бухгалтерия_KZ", "БазоваяЕдиницаИзмерения", "ЕдиницаИзмерения");
	//}}dm_180424
	
	//dm_180424 : Изменил ЕдиницаИзмерения на [ЕдиницаИзмерения]
	//++Дейнеко ВГ 2017-09-18 Бухгалтерия
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	0 КАК Вес,
		|	Номенклатура.[ЕдиницаИзмерения] КАК ЕдиницаИзмерения,
		|	Номенклатура.[ЕдиницаИзмерения].Наименование КАК ЕдиницаИзмеренияНаименование,
		|	Номенклатура.[ЕдиницаИзмерения].Код КАК ЕдиницаИзмеренияКодОКЕИ,
		|	Номенклатура.Услуга КАК ТипНоменклатуры,
		|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Номенклатура.ПометкаУдаления КАК ПометкаУдаления
		|ПОМЕСТИТЬ ВТ_Ассортимент
		|{ВЫБРАТЬ
		|	Ссылка.*,
		|	Вес,
		|	ЕдиницаИзмерения.*,
		|	ЕдиницаИзмеренияНаименование,
		|	ЕдиницаИзмеренияКодОКЕИ,
		|	ТипНоменклатуры.*,
		|	ВидНоменклатуры.*,
		|	ПометкаУдаления}
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|{ГДЕ
		|	Номенклатура.Ссылка.* КАК Номенклатура,
		|	(0) КАК Вес,
		|	Номенклатура.[ЕдиницаИзмерения].*,
		|	Номенклатура.[ЕдиницаИзмерения].Наименование,
		|	Номенклатура.[ЕдиницаИзмерения].Код,
		|	Номенклатура.ВидНоменклатуры.*,	
		|	Номенклатура.ПометкаУдаления}";	

	ЗаменитьЛитералы(ТекстЗапроса, стррЛитералы); //dm_180424 : Подставляем поле в соответствии с конфигурацией
	//--Дейнеко ВГ 2017-09-18 Бухгалтерия
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаВыборкиНоменклатуры()

Процедура ЗаменитьЛитералы(Шаблон, стррЛитералы) Экспорт //dm_180508 : добавил Экспорт
	
	Для Каждого Литерал Из стррЛитералы Цикл
		Шаблон = СтрЗаменить(Шаблон, "[" + Литерал.Ключ + "]", 
			?(Литерал.Значение <> Неопределено, Литерал.Значение, Литерал.Ключ)); // если значение литерала не указано, заменяем его на наименование литерала
	КонецЦикла
	
КонецПроцедуры

// sk_190718 Процедура исключена в рамках (MOD-236)
// ТекстЗапросаПолученияНоменклатуры()
//
Функция ТекстЗапросаПолученияНоменклатуры_OLD()

	//{{dm_180425
	
	//(( sk_190115 В структуру стррЛитералы добавлено новое поле (СтавкаНДС) (MOD-228)
	// В Бухгалтерия_RU 3.0.66.60 в справочнике Номенклатура есть реквизит СтавкаНДС
	// В Бухгалтерия_RU 3.0.66.70 в справочнике Номенклатура есть реквизит СтавкаНДС и ВидСтавкиНДС
	// В Бухгалтерия_RU 3.0.67.38 в справочнике Номенклатура есть реквизит ВидСтавкиНДС, реквизита СтавкаНДС нет (помечен на удаление) 
	// В Бухгалтерия_KZ 3.0.24.2 в справочнике Номенклатура есть реквизит СтавкаНДС 
	
	// стррЛитералы = Новый Структура("Регистр,Субконто,Тип1,Тип2,Подразделение");
	стррЛитералы = Новый Структура("Регистр, Субконто, Тип1, Тип2, Подразделение, СтавкаНДС");
	//)) sk_190115	
	
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррЛитералы.Регистр 	   = "Типовой";
		стррЛитералы.Субконто 	   = "Субконто2";
		стррЛитералы.Тип1 		   = "ВТ_НоменклатураСУчетомОстатка.Номенклатура.ВидНоменклатуры.ГруппаТМЗ";
		стррЛитералы.Тип2          = "ВТ_НоменклатураСклады.Номенклатура.ВидНоменклатуры.ГруппаТМЗ";
		стррЛитералы.Подразделение = "СтруктурноеПодразделение";
		стррЛитералы.СтавкаНДС 	   = "СтавкаНДС"; // sk_190115 (MOD-228)   
		
	Иначе
		стррЛитералы.Регистр 	   = "Хозрасчетный";
		
		//(( sk_190219 Формируем наименование Субконто в зависимости от порядка ВидСубконто "Склады" в Плане счетов бухгалтерского учета ТоварыНаСкладах (41.01) (MOD-282)
		// стррЛитералы.Субконто 	   = "Субконто3";
		СчТоварыНаСкладах = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
		ВидСубконтоСклады = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады;
		ВидСубконтоСкладыВСчТоварыНаСкладах  = СчТоварыНаСкладах.ВидыСубконто.Найти(ВидСубконтоСклады, "ВидСубконто"); 		
		
		Если Не ВидСубконтоСкладыВСчТоварыНаСкладах = Неопределено Тогда 
			стррЛитералы.Субконто = "Субконто" + Строка(ВидСубконтоСкладыВСчТоварыНаСкладах.НомерСтроки);
		Иначе
			Текст = НСтр("ru = 'В настройке ""Учет запасов"" не предусмотрен учет по складам (местам хранения).'");
			ВызватьИсключение(Текст);
		КонецЕсли;
		//)) sk_190219
		
		стррЛитералы.Тип1 		   = """""";
		стррЛитералы.Тип2 		   = """""";
		стррЛитералы.Подразделение = "Подразделение";
		//((sk_190115 (MOD-228) 
		Если ПоколениеКонфигурации(">=Бухгалтерия_3.0.67.38") Тогда
			 стррЛитералы.СтавкаНДС = "ВидСтавкиНДС";
		Иначе
			 стррЛитералы.СтавкаНДС = "СтавкаНДС";
		КонецЕсли;
		//))sk_190115
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
        |	ХозрасчетныйОстатки_КонОст.Счет КАК Счет,
        |	ХозрасчетныйОстатки_КонОст.Субконто1 КАК Номенклатура,
        |	ХозрасчетныйОстатки_КонОст.СуммаОстаток КАК Сумма,
        |	ХозрасчетныйОстатки_КонОст.КоличествоОстаток КАК Количество,
        |	ХозрасчетныйОстатки_КонОст.Организация КАК Организация,
        |	ХозрасчетныйОстатки_КонОст.[Подразделение] КАК Подразделение,
        |	ХозрасчетныйОстатки_КонОст.[Субконто] КАК Склад,
        |	ХозрасчетныйОстатки_КонОст.КоличествоОстаток КАК КоличествоОстаток
        |ПОМЕСТИТЬ ВТ_РегБухгалтерииХозрасчетный
        |ИЗ
        |	РегистрБухгалтерии.[Регистр].Остатки(, Счет В (&СчетаУчетаСкладИНоменклатура), , ) КАК ХозрасчетныйОстатки_КонОст
		|;
 		|////////////////////////////////////////////////////////////////////////////////	
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Номенклатура.Ссылка КАК Номенклатура,
		//{{dm_180831
		|	СвободныеОстаткиТоваров.Склад КАК Склад
		//}}dm_180831
		|ПОМЕСТИТЬ ВТ_НоменклатураСУчетомОстатка
		|ИЗ
		|	ВТ_Ассортимент КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегБухгалтерииХозрасчетный КАК СвободныеОстаткиТоваров
		|		ПО ВТ_Номенклатура.Ссылка = СвободныеОстаткиТоваров.Номенклатура
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ВыгружатьТоварыСНулевымОстатком
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЕСТЬNULL(СвободныеОстаткиТоваров.КоличествоОстаток, 0) > 0
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатураСУчетомОстатка.Номенклатура КАК Номенклатура,
		|	ВТ_Склады.Ссылка КАК Склад
		|ПОМЕСТИТЬ ВТ_НоменклатураСклады
		|ИЗ
		|	ВТ_НоменклатураСУчетомОстатка КАК ВТ_НоменклатураСУчетомОстатка
		//{{dm_180831
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК ВТ_Склады
		|    ПО ВТ_НоменклатураСУчетомОстатка.Склад = ВТ_Склады.Ссылка
		//}}dm_180831
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатураСУчетомОстатка.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(СвободныеОстаткиТоваров.Склад, &ЕдинственныйСклад) КАК Склад,
		|	ЕСТЬNULL(СвободныеОстаткиТоваров.КоличествоОстаток, 0) КАК Остаток,
		|	ЕСТЬNULL(СвободныеОстаткиТоваров.Склад.Наименование, &ЕдинственныйСклад) КАК НаименованиеСклада,
		|	ВЫБОР
		|		КОГДА &РежимВыгрузкиКодов = ""КОД""
		|			ТОГДА ВТ_НоменклатураСУчетомОстатка.Номенклатура.Код
		|		КОГДА &РежимВыгрузкиКодов = ""АРТИКУЛ""
		|			ТОГДА ВТ_НоменклатураСУчетомОстатка.Номенклатура.Артикул
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Код,
		|	ВТ_НоменклатураСУчетомОстатка.Номенклатура.Наименование КАК Наименование,
		|	ВТ_НоменклатураСУчетомОстатка.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
		|	Ложь Как Весовой,
		|	ВТ_НоменклатураСУчетомОстатка.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		//(( sk_190115 (MOD-228) 
		// |	ВТ_НоменклатураСУчетомОстатка.Номенклатура.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_НоменклатураСУчетомОстатка.Номенклатура.[СтавкаНДС] КАК СтавкаНДС,
		//)) sk_190115
		|	ВТ_НоменклатураСУчетомОстатка.Номенклатура.Комментарий КАК Описание,
		|	[Тип1] КАК ТипНоменклатуры,
		|	Ложь КАК ЦеноваяГруппа,
		|	ВТ_НоменклатураСУчетомОстатка.Номенклатура.Услуга КАК ЭтоУслуга,
		|	ВТ_НоменклатураСУчетомОстатка.Номенклатура.Родитель КАК Родитель,
		|	Ложь КАК УчетПоХарактеристикам,
		|	ВЫБОР
		|		КОГДА СвободныеОстаткиТоваров.Склад = &МобильныйСклад
		|			ТОГДА ЕСТЬNULL(СвободныеОстаткиТоваров.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОстатокМобСклада
		|ИЗ
		|	ВТ_НоменклатураСУчетомОстатка КАК ВТ_НоменклатураСУчетомОстатка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегБухгалтерииХозрасчетный КАК СвободныеОстаткиТоваров
		|		ПО (СвободныеОстаткиТоваров.Номенклатура = ВТ_НоменклатураСУчетомОстатка.Номенклатура)
		|			
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	НаименованиеСклада
		|ИТОГИ
		|	СУММА(Остаток),
		|	СУММА(ОстатокМобСклада)
		|ПО
		|	Номенклатура
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатураСклады.Номенклатура КАК Номенклатура,
		|	ВТ_НоменклатураСклады.Склад КАК Склад,
		//{{dm_180831
		//|	ВЫБОР
		//|		КОГДА НЕ ВТ_НоменклатураСклады.Склад = &МобильныйСклад
		//|			ТОГДА ЕСТЬNULL(СвободныеОстаткиТоваров.КоличествоОстаток, 0)
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК Остаток,
		|	ЕСТЬNULL(СвободныеОстаткиТоваров.КоличествоОстаток, 0) КАК Остаток,
		//}}dm_180831
		|	ВТ_НоменклатураСклады.Склад.Наименование КАК НаименованиеСклада,
		|	ВЫБОР
		|		КОГДА &РежимВыгрузкиКодов = &Код
		|			ТОГДА ВТ_НоменклатураСклады.Номенклатура.Код
		|		КОГДА &РежимВыгрузкиКодов = &Артикул
		|			ТОГДА ВТ_НоменклатураСклады.Номенклатура.Артикул
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Код,
		|	ВТ_НоменклатураСклады.Номенклатура.Наименование КАК Наименование,
		|	ВТ_НоменклатураСклады.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
		|	Ложь Как Весовой,
		|	ВТ_НоменклатураСклады.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		//(( sk_190115 (MOD-228) 
		// |	ВТ_НоменклатураСклады.Номенклатура.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_НоменклатураСклады.Номенклатура.[СтавкаНДС] КАК СтавкаНДС,
		//)) sk_190115
		|	ВТ_НоменклатураСклады.Номенклатура.Комментарий КАК Описание,
		|	[Тип2] КАК ТипНоменклатуры,
		|	Ложь КАК ЦеноваяГруппа,
		|	ВТ_НоменклатураСклады.Номенклатура.Услуга КАК ЭтоУслуга,
		|	ВТ_НоменклатураСклады.Номенклатура.Родитель КАК Родитель,
		|	Ложь КАК УчетПоХарактеристикам,
		|	ВЫБОР
		|		КОГДА ВТ_НоменклатураСклады.Склад = &МобильныйСклад
		|			ТОГДА ЕСТЬNULL(СвободныеОстаткиТоваров.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОстатокМобСклада
		|ИЗ
		|	ВТ_НоменклатураСклады КАК ВТ_НоменклатураСклады
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегБухгалтерииХозрасчетный КАК СвободныеОстаткиТоваров
		|		ПО (СвободныеОстаткиТоваров.Номенклатура = ВТ_НоменклатураСклады.Номенклатура)
		|			И (СвободныеОстаткиТоваров.Склад = ВТ_НоменклатураСклады.Склад)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	НаименованиеСклада
		|ИТОГИ
		|	СУММА(Остаток),
		|	СУММА(ОстатокМобСклада)
		|ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыЦен.Ссылка КАК ВидЦены,
		|	ВидыЦен.ВалютаЦены,
		|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) КАК Курс,
		|	ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК Кратность
		|ПОМЕСТИТЬ ВТ_ВидыЦен
		|ИЗ
		|	Справочник.ТипыЦенНоменклатуры КАК ВидыЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Валюта) КАК КурсыВалютСрезПоследних
		|		ПО ВидыЦен.ВалютаЦены = КурсыВалютСрезПоследних.Валюта
		|ГДЕ
		|	ВидыЦен.Ссылка В(&ВидыЦен)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидЦены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатураСУчетомОстатка.Номенклатура КАК Номенклатура,
		|	ВТ_ВидыЦен.ВидЦены КАК ВидЦены,
		|	ВТ_ВидыЦен.ВалютаЦены,
		|	ВТ_ВидыЦен.Курс КАК Курс,
		|	ВТ_ВидыЦен.Кратность КАК Кратность
		|ПОМЕСТИТЬ ВТ_НоменклатураВидыЦен
		|ИЗ
		|	ВТ_НоменклатураСУчетомОстатка КАК ВТ_НоменклатураСУчетомОстатка,
		|	ВТ_ВидыЦен КАК ВТ_ВидыЦен
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	ВидЦены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатураВидыЦен.Номенклатура КАК Номенклатура,
		|	ВТ_НоменклатураВидыЦен.ВидЦены КАК ВидЦены,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / 1 * ВЫБОР
		|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ВТ_НоменклатураВидыЦен.Кратность, 0) > 0
		|							И ЕСТЬNULL(ВТ_НоменклатураВидыЦен.Курс, 0) > 0
		|						ТОГДА ВТ_НоменклатураВидыЦен.Курс * &КратностьВалюты / (&КурсВалюты * ВТ_НоменклатураВидыЦен.Кратность)
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Цена,
		|	ВТ_НоменклатураВидыЦен.ВидЦены.Наименование КАК НаименованиеВидаЦены
		|ИЗ
		|	ВТ_НоменклатураВидыЦен КАК ВТ_НоменклатураВидыЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО (ЦеныНоменклатурыСрезПоследних.Номенклатура = ВТ_НоменклатураВидыЦен.Номенклатура)
		|			И (ЦеныНоменклатурыСрезПоследних.ТипЦен = ВТ_НоменклатураВидыЦен.ВидЦены)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	НаименованиеВидаЦены
		|ИТОГИ ПО
		|	Номенклатура";	
	 //}}dm_180425
	//--Дейнеко ВГ 2017-09-19 Бухгалтерия
	
	
	ЗаменитьЛитералы(ТекстЗапроса, стррЛитералы);
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция ТекстЗапросаВыборкиЕдиницИзмерения()

	стррЛитералы = Новый Структура("НоменклатураВес,УпаковкиЕдиницыИзмерения,УпаковкиКоэффициент,Упаковки");	
	стррЛитералы.УпаковкиКоэффициент		= "Упаковки.Коэффициент";
	стррЛитералы.Упаковки					= "УпаковкиНоменклатуры";
	стррЛитералы.НоменклатураВес 			= "Номенклатура.Вес";
	стррЛитералы.УпаковкиЕдиницыИзмерения   = "КлассификаторЕдиницИзмерения";
		
	
	//++Дейнеко ВГ 2017-09-21 Бухгалтерия
	//Заменил Функцию на константу
	
	КонстантаИспользоватьУпаковкиНоменклатуры = Истина; //dm: Продумать опцию в настройках
	
	//--Дейнеко ВГ 2017-09-21 Бухгалтерия

	//{{dm_180313
	Если КонстантаИспользоватьУпаковкиНоменклатуры Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	УпаковкиТаб.УникальныйИдентификатор,
			|	УпаковкиТаб.Наименование,
			|	УпаковкиТаб.Коэффициент,
			|	УпаковкиТаб.Номенклатура,
			|	УпаковкиТаб.ЕдиницаИзмеренияНоменклатуры
			|ПОМЕСТИТЬ Упаковки
			|ИЗ
			|	&Упаковки КАК УпаковкиТаб
			|ГДЕ
			|	НЕ УпаковкиТаб.ПометкаУдаления = 1
			|;
			|
			|////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Ассортимент.ЕдиницаИзмерения КАК Ссылка,
			|	"""" КАК КодОКЕИ,
			|	Ассортимент.ЕдиницаИзмеренияНаименование КАК Наименование,
			|	1 КАК Коэффициент,
			|	Ассортимент.Ссылка КАК Номенклатура,
			|	NULL Как Вес,
			|	ЛОЖЬ КАК ЭтоНаборУпаковок,
			|	NULL КАК ВладелецНаборУпаковок,
			|	Ассортимент.ЕдиницаИзмерения КАК Классификатор,
			|	ИСТИНА КАК ЭтоЕдиницаНоменклатуры
			|ПОМЕСТИТЬ ЕдиницыБезКлассификаторов
			|ИЗ
			|	ВТ_Ассортимент КАК Ассортимент
			|ГДЕ
			|	Ассортимент.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.[УпаковкиЕдиницыИзмерения].ПустаяСсылка)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	Упаковки.УникальныйИдентификатор,
			|	"""",
			|	Упаковки.Наименование,
			|	Упаковки.Коэффициент,
			|	Упаковки.Номенклатура,
			|	NULL,
			|	ЛОЖЬ,
			|	NULL,
			|	Упаковки.ЕдиницаИзмеренияНоменклатуры,
			|	ЛОЖЬ
			|ИЗ
			|	Упаковки КАК Упаковки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ассортимент КАК Ассортимент
			|		ПО Упаковки.Номенклатура = Ассортимент.Ссылка
		    |";
	//}}dm_180313	
		
	Иначе // не используются упаковки номенклатуры
		
		//++Дейнеко ВГ 2017-09-21 Бухгалтерия
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Номенклатура.ЕдиницаИзмерения КАК Ссылка,
			|	"""" КАК КодОКЕИ,
			|	Номенклатура.ЕдиницаИзмеренияНаименование КАК Наименование,
			|	1 КАК Коэффициент,
			|	Номенклатура.Ссылка КАК Номенклатура,
			|	NULL КАК Вес,
			|	ЛОЖЬ КАК ЭтоНаборУпаковок,
			|	NULL КАК ВладелецНаборУпаковок,
			|	Номенклатура.ЕдиницаИзмерения КАК Классификатор,
			|	ИСТИНА КАК ЭтоЕдиницаНоменклатуры
			|ПОМЕСТИТЬ ЕдиницыБезКлассификаторов
			|ИЗ
			|	ВТ_Ассортимент КАК Номенклатура
			|";
		
	КонецЕсли; // ПолучитьЗначениеКонстанты("ИспользоватьУпаковкиНоменклатуры")
	
	//++Дейнеко ВГ 2017-09-21 Бухгалтерия
	ТекстЗапроса = ТекстЗапроса + ";
		|
		|////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕдиницыБезКлассификаторов.Ссылка КАК Ссылка,
		|	ЕдиницыБезКлассификаторов.КодОКЕИ КАК КодОКЕИ,
		|	ЕдиницыБезКлассификаторов.Наименование КАК Наименование,
		|	ЕдиницыБезКлассификаторов.Коэффициент КАК Коэффициент,
		|	ЕдиницыБезКлассификаторов.Номенклатура КАК Номенклатура,
		|	ЕдиницыБезКлассификаторов.Вес КАК Вес,
		|	ЕдиницыБезКлассификаторов.ЭтоНаборУпаковок КАК ЭтоНаборУпаковок,
		|	ЕдиницыБезКлассификаторов.ВладелецНаборУпаковок КАК ВладелецНаборУпаковок,
		|	ЕдиницыБезКлассификаторов.Классификатор КАК Классификатор,
		|	ЕдиницыБезКлассификаторов.ЭтоЕдиницаНоменклатуры КАК ЭтоЕдиницаНоменклатуры
		|ИЗ
		|	ЕдиницыБезКлассификаторов КАК ЕдиницыБезКлассификаторов ";
	
	//--Дейнеко ВГ 2017-09-21 Бухгалтерия
	ЗаменитьЛитералы(ТекстЗапроса, стррЛитералы);
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаВsборкиЕдиницИзмерения()

Функция ТекстЗапросаВыборкиГруппПартнеров()
	
	//++Дейнеко ВГ 2017-09-19 Бухгалтерия
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	Контрагенты.Наименование
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЭтоГруппа";
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаВыборкиГруппНоменклатуры()

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Родитель
	|ПОМЕСТИТЬ РодителиТоваров
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ассортимент КАК ВТ_Ассортимент
	|		ПО Номенклатура.Ссылка = ВТ_Ассортимент.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.Родитель КАК РодительЭл
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РодителиТоваров КАК РодителиТоваров
	|		ПО Номенклатура.Ссылка = РодителиТоваров.Родитель
	|ГДЕ
	|	Номенклатура.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ";

	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапросаВыборкиГруппНоменклатуры()

Функция ТекстЗапросаВыборкиВидовНоменклатуры()
	
	//++Дейнеко ВГ 2017-09-20 Бухгалтерия
	//В Бух30 делится на услуга и неуслуга
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыНоменклатуры.Ссылка КАК Ссылка,
	|	ВидыНоменклатуры.Наименование КАК Наименование,
	|	NULL КАК РодительЭл
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры";
	
	//--Дейнеко ВГ 2017-09-20 Бухгалтерия
	
	
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапросаВыборкиГруппНоменклатуры()

Функция ТекстЗапросаВыборкиДокументовЗаказПокупателя()
	
	//{{dm_180425
	стррЛитералы = Новый Структура("СуммаСкидки");		
	
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррЛитералы.СуммаСкидки = "0 КАК СуммаСкидки";
	Иначе
		стррЛитералы.СуммаСкидки = "СчетНаОплатуПокупателю.СуммаСкидки";
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка,
		|	СчетНаОплатуПокупателю.Дата,
		|	СчетНаОплатуПокупателю.Номер,
		|	СчетНаОплатуПокупателю.Проведен,
		|	СчетНаОплатуПокупателю.Контрагент,
		|	СчетНаОплатуПокупателю.Организация,
		|	СчетНаОплатуПокупателю.ДоговорКонтрагента,
		|	СчетНаОплатуПокупателю.ВалютаДокумента,
		|	СчетНаОплатуПокупателю.СуммаДокумента,
		|	СчетНаОплатуПокупателю.Склад,
		|	СчетНаОплатуПокупателю.ТипЦен,
		|	СчетНаОплатуПокупателю.Комментарий,
		|	[СуммаСкидки]
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|ГДЕ
		|	СчетНаОплатуПокупателю.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления
		|	И СчетНаОплатуПокупателю.Ответственный = &Агент
		|	И СчетНаОплатуПокупателю.Проведен"; //dm_180529 Выгружаем только проведнные документы
	
	ЗаменитьЛитералы(ТекстЗапроса, стррЛитералы);
	//}}dm_180425
	
	//--Дейнеко ВГ 2017-09-29 Бухгалтерия
		
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаВыборкиДокументовЗаказПокупателя()

//dm_09.10.17:Внесены изменения
Функция ТекстЗапросаВыборкиДокументовРеализация()
	
	//+dm_09.10.17
	
	//{{dm_180425
	стррЛитералы = Новый Структура("ДокументЗаказ");		
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррЛитералы.ДокументЗаказ = "
		|	ВЫБОР
		|		КОГДА ДокументыПродажи.Ссылка.ДокументОснование ССЫЛКА Документ.СчетНаОплатуПокупателю
		|			ТОГДА ДокументыПродажи.Ссылка.ДокументОснование
		|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)
		|	КОНЕЦ КАК ДокументЗаказ";
	Иначе
		стррЛитералы.ДокументЗаказ = "ДокументыПродажи.Ссылка.СчетНаОплатуПокупателю КАК ДокументЗаказ";
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокументыРеализация.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДокументыПродажи
		|ИЗ
		|	(ВЫБРАТЬ
		|		РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|	ГДЕ
		|		РеализацияТоваровУслуг.Склад =&Склад
		|	    И РеализацияТоваровУслуг.Ответственный = &Агент
		//dm_180529 Выгружаем только проведенные документы:
		|	    И РеализацияТоваровУслуг.Проведен) КАК ДокументыРеализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыПродажи.Ссылка КАК Ссылка,
		|	ДокументыПродажи.Ссылка.Дата КАК Дата,
		|	ДокументыПродажи.Ссылка.Номер,
		|	ДокументыПродажи.Ссылка.Проведен,
		|	ДокументыПродажи.Ссылка.Контрагент КАК Клиент,
		|	ДокументыПродажи.Ссылка.Организация КАК Организация,
		|	ДокументыПродажи.Ссылка.ДоговорКонтрагента КАК Соглашение,
		|	ДокументыПродажи.Ссылка.ВалютаДокумента КАК Валюта,
		|	ДокументыПродажи.Ссылка.СуммаДокумента КАК СуммаДокумента,
		|	ДокументыПродажи.Ссылка.Склад КАК Склад,
		|	ДокументыПродажи.Ссылка.ТипЦен КАК ТипЦен,
		|	[ДокументЗаказ],
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.Количество КАК Количество,
		|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения КАК Упаковка,
		|	РеализацияТоваровУслугТовары.Цена,
		|	РеализацияТоваровУслугТовары.Сумма,
		|	РеализацияТоваровУслугТовары.СтавкаНДС,
		|	РеализацияТоваровУслугТовары.СуммаНДС,
		|	РеализацияТоваровУслугТовары.Ссылка.Комментарий
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПродажи КАК ДокументыПродажи
		|		ПО (ДокументыПродажи.Ссылка = РеализацияТоваровУслугТовары.Ссылка)
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НЕ РеализацияТоваровУслугТовары.Ссылка.ПометкаУдаления
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Ссылка";
	//-dm_09.10.17
	
	ЗаменитьЛитералы(ТекстЗапроса, стррЛитералы);
	//}}dm_180425
	Возврат ТекстЗапроса;
	
КонецФункции

//dm_16.10.17:Внесены изменения
Функция ТекстЗапросаВыборкиДокументовПеремещение() // sd_22082017
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПеремещениеТоваров.Ссылка
	               |ИЗ
	               |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |ГДЕ
	               |	НЕ ПеремещениеТоваров.ПометкаУдаления
	               |	И ПеремещениеТоваров.Проведен
	               |	И ПеремещениеТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И (ПеремещениеТоваров.СкладПолучатель = &Склад
	               |			ИЛИ ПеремещениеТоваров.СкладОтправитель = &Склад)
				   //dm_16.10.17:Убрал Статус
				   //|	И ПеремещениеТоваров.Статус = &Статус
				   |	И ПеремещениеТоваров.Ответственный = &Агент
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПеремещениеТоваров.МоментВремени
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

//dm_28.09.17:Внесены изменения
Функция ТекстЗапросаПоВзаиморасчетам(СпособРасчета)
	
	//{{dm_180426
	стррЛитералы = Новый Структура("Регистр,ДатаПлатежа,Условие");
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррЛитералы.Условие = "";
		стррЛитералы.Регистр = "Типовой.Остатки(, Счет В (&СчетаКДЗ), , )";
		стррЛитералы.ДатаПлатежа = 
			"ВЫБОР
			|	КОГДА ХозрасчетныйОстатки.Субконто2.УстановленСрокОплаты
			|		ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ХозрасчетныйОстатки.Субконто3.Дата, ДЕНЬ), ДЕНЬ, ХозрасчетныйОстатки.Субконто2.СрокОплаты)
			|	ИНАЧЕ ВЫБОР
			|		КОГДА &СрокОплатыПокупателей > 0
			|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ХозрасчетныйОстатки.Субконто3.Дата, ДЕНЬ), ДЕНЬ, &СрокОплатыПокупателей)
			|		ИНАЧЕ КОНЕЦПЕРИОДА(ХозрасчетныйОстатки.Субконто3.Дата, ДЕНЬ)
			|	КОНЕЦ
			|КОНЕЦ";
	Иначе
		стррЛитералы.Условие = "И НЕ ХозрасчетныйОстатки.Счет = &Счет";
		стррЛитералы.Регистр = "Хозрасчетный.Остатки";
		стррЛитералы.ДатаПлатежа = 
			"ВЫБОР
			|	КОГДА ХозрасчетныйОстатки.Субконто2.УстановленСрокОплаты
			|		ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ХозрасчетныйОстатки.Субконто3.Дата, ДЕНЬ), ДЕНЬ, ХозрасчетныйОстатки.Субконто2.СрокОплаты)
			|	ИНАЧЕ ВЫБОР
			|			КОГДА &СрокОплатыПокупателей > 0
			|				И НЕ ХозрасчетныйОстатки.Субконто3.СчетНаОплатуПокупателю ССЫЛКА Документ.СчетНаОплатуПокупателю 
			|					ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ХозрасчетныйОстатки.Субконто3.Дата, ДЕНЬ), ДЕНЬ, &СрокОплатыПокупателей)
			|			ИНАЧЕ ВЫБОР
			|					КОГДА ХозрасчетныйОстатки.Субконто3.СчетНаОплатуПокупателю ССЫЛКА Документ.СчетНаОплатуПокупателю 
			|						ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ХозрасчетныйОстатки.Субконто3.Дата, ДЕНЬ), ДЕНЬ, &СрокОплатыСчетовПокупателю) 
			|					ИНАЧЕ НАЧАЛОПЕРИОДА(ХозрасчетныйОстатки.Субконто3.Дата, ДЕНЬ)
			|				  КОНЕЦ
			|		  КОНЕЦ
			|КОНЕЦ";
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	УчетДолгов.Контрагент,
				   |	УчетДолгов.Договор,
				   |	УчетДолгов.ОбъектРасчетов,
				   |	УчетДолгов.Организация,
				   |	УчетДолгов.НашДолг,
				   |	УчетДолгов.ДатаПлатежа,
				   |	УчетДолгов.ДолгКлиента КАК ДолгКлиентаБезУчетаПросрочки,
				   |	ВЫБОР
				   |		КОГДА УчетДолгов.ДатаПлатежа < УчетДолгов.ДатаРасчета
				   |		ТОГДА УчетДолгов.ДолгКлиента 
				   |	КОНЕЦ КАК ДолгКлиентаПросроченПоДате,
				   |	ВЫБОР
				   |		КОГДА &СпособРасчета = ""ПоКоличествуДнейПросрочки""
				   |			ТОГДА ВЫБОР
				   |					КОГДА РАЗНОСТЬДАТ(УчетДолгов.ДатаПлатежа, УчетДолгов.ДатаРасчета, ДЕНЬ) >= &КолПросроченныхДней  
				   |			ТОГДА УчетДолгов.ДолгКлиента
                   |	КОНЕЦ
				   |	КОНЕЦ КАК ДолгКлиентаПросроченПоДням,
				   |	РАЗНОСТЬДАТ(УчетДолгов.ДатаПлатежа, УчетДолгов.ДатаРасчета, ДЕНЬ) КАК ИнтервалПросрочки,	
				   |	УчетДолгов.ДатаРасчета,
				   |	УчетДолгов.ВалютаДокумента
				   |ИЗ
				   |(ВЫБРАТЬ ПЕРВЫЕ 121212121212
	               |	ХозрасчетныйОстатки.Счет,
	               |	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	               |	ХозрасчетныйОстатки.Субконто2 КАК Договор,
	               |	ХозрасчетныйОстатки.Субконто3 КАК ОбъектРасчетов,
	               |	ХозрасчетныйОстатки.Организация,
	               |	ХозрасчетныйОстатки.СуммаОстаток,
	               |	ХозрасчетныйОстатки.СуммаОстатокДт КАК ДолгКлиента,
	               |	ХозрасчетныйОстатки.СуммаОстатокКт КАК НашДолг,
	               |	ХозрасчетныйОстатки.Субконто3.ВалютаДокумента КАК ВалютаДокумента,
				   |	[ДатаПлатежа] КАК ДатаПлатежа,
				   |	ХозрасчетныйОстатки.Субконто2.УстановленСрокОплаты КАК УстановленСрокОплаты,
				   |	ХозрасчетныйОстатки.Субконто2.СрокОплаты КАК СрокОплаты,
				   |	НАЧАЛОПЕРИОДА(&ДатаРасчета, ДЕНЬ) КАК ДатаРасчета
	               |ИЗ
	               |	РегистрБухгалтерии.[Регистр] КАК ХозрасчетныйОстатки
				   |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Партнеры КАК ВТ_Партнеры
				   |	ПО ХозрасчетныйОстатки.Субконто1 = ВТ_Партнеры.Ссылка 
	               |ГДЕ
	               |	ХозрасчетныйОстатки.Субконто1 ССЫЛКА Справочник.Контрагенты
	               |	И ХозрасчетныйОстатки.Организация В(&СписокОрганизаций)
				   |	И ХозрасчетныйОстатки.Субконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
				   |	И НЕ ХозрасчетныйОстатки.Субконто3.Ссылка ЕСТЬ NULL
				   |	[Условие]
				   |УПОРЯДОЧИТЬ ПО
				   |	ХозрасчетныйОстатки.Субконто3) КАК УчетДолгов";
	
	ЗаменитьЛитералы(ТекстЗапроса, стррЛитералы);
	//}}dm_180426
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаПоВзаиморасчетам()

Функция ТекстЗапросаПолученияИзображений()
	
	Если Не ВыгружатьИзображенияТоваров И Не ВыгружатьИзображенияПартнеров Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	стрОбласть = "";
	
	Если ВыгружатьИзображенияТоваров Тогда
		
		стрОбласть = стрОбласть + "
		    |ВЫБРАТЬ
		    |	НоменклатураПрисоединенныеФайлы.Ссылка КАК Ссылка,
		    |	НоменклатураПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла,
		    |	НоменклатураПрисоединенныеФайлы.Наименование КАК Наименование,
		    |	НоменклатураПрисоединенныеФайлы.Расширение КАК Расширение,
		    |	НоменклатураПрисоединенныеФайлы.Описание КАК Описание,
		    |	НоменклатураПрисоединенныеФайлы.ФайлХранилище КАК ФайлХранилище
		    |ИЗ
		    |	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
		    |ГДЕ
		    |	НоменклатураПрисоединенныеФайлы.ВладелецФайла В ( ВЫБРАТЬ ВТ_Ассортимент.Ссылка ИЗ ВТ_Ассортимент )
		    |	И НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления
		    |	И НЕ НоменклатураПрисоединенныеФайлы.Зашифрован
			|";	
		
	КонецЕсли; 
	
	Если ВыгружатьИзображенияПартнеров Тогда
		
		//{{dm_180525 Заменил Партнеры на Контрагенты
		стрОбласть = стрОбласть + ?(стрОбласть = "", "", " ОБЪЕДИНИТЬ ВСЕ ") + "
		    |ВЫБРАТЬ
		    |	КонтрагентыПрисоединенныеФайлы.Ссылка,
		    |	КонтрагентыПрисоединенныеФайлы.ВладелецФайла,
		    |	КонтрагентыПрисоединенныеФайлы.Наименование,
		    |	КонтрагентыПрисоединенныеФайлы.Расширение,
		    |	КонтрагентыПрисоединенныеФайлы.Описание,
		    |	КонтрагентыПрисоединенныеФайлы.ФайлХранилище
		    |ИЗ
		    |	Справочник.КонтрагентыПрисоединенныеФайлы КАК КонтрагентыПрисоединенныеФайлы
		    |ГДЕ
		    |	КонтрагентыПрисоединенныеФайлы.ВладелецФайла В ( ВЫБРАТЬ ВТ_Партнеры.Ссылка ИЗ ВТ_Партнеры )
		    |	И НЕ КонтрагентыПрисоединенныеФайлы.ПометкаУдаления
		    |	И НЕ КонтрагентыПрисоединенныеФайлы.Зашифрован
			|";	
		
	КонецЕсли; 
	
	//(( sk_190724 Запрос изменен в рамках (MOD-229)
	//Текст = "
	//	|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//    |	ПрисоединенныеФайлы.ХранимыйФайл,
	//    |	ФайлыСправочников.Ссылка,
	//    |	ФайлыСправочников.ВладелецФайла,
	//    |	ФайлыСправочников.Наименование,
	//    |	ФайлыСправочников.Расширение,
	//    |	ФайлыСправочников.Описание
	//    |ИЗ
	//    |	([Область]) КАК ФайлыСправочников
	//    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрисоединенныеФайлы КАК ПрисоединенныеФайлы
	//    |		ПО ФайлыСправочников.Ссылка = ПрисоединенныеФайлы.ПрисоединенныйФайл
	//	|";
	//Возврат СтрЗаменить(Текст, "[Область]", стрОбласть);
	
	Текст = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		    |	ПрисоединенныеФайлы.[Ресурс] КАК ХранимыйФайл,
		    |	ФайлыСправочников.Ссылка,
	    	|	ФайлыСправочников.ВладелецФайла,
	        |	ФайлыСправочников.Наименование,
	   	    |	ФайлыСправочников.Расширение,
	    	|	ФайлыСправочников.Описание
	    	|ИЗ
	    	|	([Область]) КАК ФайлыСправочников
	   	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.[Регистр] КАК ПрисоединенныеФайлы
	   	    |		ПО ФайлыСправочников.Ссылка = ПрисоединенныеФайлы.[Измерение]
			|";

	стррРегистрСведенийИзображений = Новый Структура("Регистр, Измерение, Ресурс");
	
	Если ПоколениеКонфигурации(">=Бухгалтерия_3.0.52.32") 
			Или гКонфигурация = "Бухгалтерия_KZ" И ПоколениеКонфигурации(">=Бухгалтерия_3.0.22.4") Тогда
		стррРегистрСведенийИзображений.Регистр   = "ДвоичныеДанныеФайлов";
		стррРегистрСведенийИзображений.Измерение = "Файл";
		стррРегистрСведенийИзображений.Ресурс    = "ДвоичныеДанныеФайла";
	Иначе
		стррРегистрСведенийИзображений.Регистр   = "ПрисоединенныеФайлы";
		стррРегистрСведенийИзображений.Измерение = "ПрисоединенныйФайл";
		стррРегистрСведенийИзображений.Ресурс    = "ХранимыйФайл";
	КонецЕсли;
	
	стррРегистрСведенийИзображений.Вставить("Область", стрОбласть);
	ЗаменитьЛитералы(Текст, стррРегистрСведенийИзображений);	
	
	Возврат Текст; 
	//)) sk_190724
	
КонецФункции

Функция ТекстЗапросаПолученияИзображенийБух30()
	
	Если Не ВыгружатьИзображенияТоваров И Не ВыгружатьИзображенияПартнеров Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	стрОбласть = "";
	
	Если ВыгружатьИзображенияТоваров Тогда
		
		стрОбласть = стрОбласть + "
		    |ВЫБРАТЬ
		    |	НоменклатураПрисоединенныеФайлы.Ссылка КАК Ссылка,
		    |	НоменклатураПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла,
		    |	НоменклатураПрисоединенныеФайлы.Наименование КАК Наименование,
		    |	НоменклатураПрисоединенныеФайлы.Расширение КАК Расширение,
		    |	НоменклатураПрисоединенныеФайлы.Описание КАК Описание,
		    |	НоменклатураПрисоединенныеФайлы.ФайлХранилище КАК ФайлХранилище
		    |ИЗ
		    |	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
		    |ГДЕ
		    |	НоменклатураПрисоединенныеФайлы.ВладелецФайла В ( ВЫБРАТЬ ВТ_Ассортимент.Ссылка ИЗ ВТ_Ассортимент )
		    |	И НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления
		    |	И НЕ НоменклатураПрисоединенныеФайлы.Зашифрован
			|";	
		
	КонецЕсли; 
	
	Если ВыгружатьИзображенияПартнеров Тогда
		
		стрОбласть = стрОбласть + ?(стрОбласть = "", "", " ОБЪЕДИНИТЬ ВСЕ ") + "
		    |ВЫБРАТЬ
		    |	ПартнерыПрисоединенныеФайлы.Ссылка,
		    |	ПартнерыПрисоединенныеФайлы.ВладелецФайла,
		    |	ПартнерыПрисоединенныеФайлы.Наименование,
		    |	ПартнерыПрисоединенныеФайлы.Расширение,
		    |	ПартнерыПрисоединенныеФайлы.Описание,
		    |	ПартнерыПрисоединенныеФайлы.ФайлХранилище
		    |ИЗ
		    |	Справочник.ПартнерыПрисоединенныеФайлы КАК ПартнерыПрисоединенныеФайлы
		    |ГДЕ
		    |	ПартнерыПрисоединенныеФайлы.ВладелецФайла В ( ВЫБРАТЬ ВТ_Партнеры.Ссылка ИЗ ВТ_Партнеры )
		    |	И НЕ ПартнерыПрисоединенныеФайлы.ПометкаУдаления
		    |	И НЕ ПартнерыПрисоединенныеФайлы.Зашифрован
			|";	
		
	КонецЕсли; 
	
	Текст = "
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ПрисоединенныеФайлы.ХранимыйФайл,
	    |	ФайлыСправочников.Ссылка,
	    |	ФайлыСправочников.ВладелецФайла,
	    |	ФайлыСправочников.Наименование,
	    |	ФайлыСправочников.Расширение,
	    |	ФайлыСправочников.Описание
	    |ИЗ
	    |	([Область]) КАК ФайлыСправочников
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрисоединенныеФайлы КАК ПрисоединенныеФайлы
	    |		ПО ФайлыСправочников.Ссылка = ПрисоединенныеФайлы.ПрисоединенныйФайл
		|";
		
	Возврат СтрЗаменить(Текст, "[Область]", стрОбласть);
	
КонецФункции

// ТекстыЗапросов
#КонецОбласти

#Область ФормированиеВремеменныхТаблиц

Процедура МенеджерВТПартнеров(МенеджерВТ)

	//{{dm_180521
	//Отборы = ЭлементОтбораПоЛевомуЗначению("Партнеры", "СсылкаСписокТТ,ТипПартнера,ТолькоПартнерыОсновногоМенеджера");
	стррОтборы = ЭлементОтбораПоЛевомуЗначениюПартнеры("Контрагенты", "СсылкаСписокТТ");
	Маршруты = стррОтборы.Маршруты;
	Отборы = стррОтборы.Отборы;
	МакетКомпоновкиПартнеров = СформированныйМакетКомпоновкиДанных(Отборы, ТекстЗапросаВыборкиПартнеров());
	//////////////////////////////////////////////////////////////////////////////////////////
	// dm_180813 Изменил алгоритм формирования ВТ_Партнеры:                                 //
	//                                                                                      //
	//	Если используется Маршрут и Отбор, то выгружаются контрагенты из Маршрута + Отбор   //
	//		Если Отбор не используется, то только из Маршрута                               //
	//	Если Маршрут не используется, выгружаются контрагенты в соотаетствии с Отбором      //
	//                                                                                      //
	//////////////////////////////////////////////////////////////////////////////////////////
	
	Если Маршруты.Количество() > 0 Тогда
		Если Отборы[0].Использование Тогда 
			Запрос = Новый Запрос(МакетКомпоновкиПартнеров.НаборыДанных.НаборДанных.Запрос + ДополнительныйТекстЗапросаВыборкиПартнеров()); //dm_180521: + ДополнительныйТекстЗапросаВыборкиПартнеров()
		Иначе
			Запрос = Новый Запрос(ДополнительныйТекстЗапросаВыборкиПартнеров(Ложь)); //dm_180521: + ДополнительныйТекстЗапросаВыборкиПартнеров()
		КонецЕсли;
		Запрос.УстановитьПараметр("Маршруты", Маршруты[0].ПравоеЗначение);
	Иначе
		Запрос = Новый Запрос(МакетКомпоновкиПартнеров.НаборыДанных.НаборДанных.Запрос);
	КонецЕсли;
	//}}dm_180521
	
	Для Каждого ЭлементОтбора Из МакетКомпоновкиПартнеров.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
	КонецЦикла;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();

КонецПроцедуры 

Процедура МенеджерВТКонтрагенты(МенеджерВТ)

	Отборы = ЭлементОтбораПоЛевомуЗначению("Контрагенты");
	МакетКомпоновкиКонтрагенты = СформированныйМакетКомпоновкиДанных(Отборы, ТекстЗапросаВыборкиКонтрагентов());
	
	Запрос = Новый Запрос(МакетКомпоновкиКонтрагенты.НаборыДанных.НаборДанных.Запрос);
	Для Каждого ЭлементОтбора Из МакетКомпоновкиКонтрагенты.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
	КонецЦикла;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();

КонецПроцедуры

Процедура МенеджерВТНоменклатуры(МенеджерВТ)

	Отборы = ЭлементОтбораПоЛевомуЗначению("Номенклатура");
	МакетКомпоновкиНоменклатуры = СформированныйМакетКомпоновкиДанных(Отборы, ТекстЗапросаВыборкиНоменклатуры());
	
	// Выборка из справочника Номенклатура
	Запрос = Новый Запрос(МакетКомпоновкиНоменклатуры.НаборыДанных.НаборДанных.Запрос);
	Для Каждого ЭлементОтбора Из МакетКомпоновкиНоменклатуры.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
	КонецЦикла;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	//++Дейнеко ВГ 2017-09-18 Бухгалтерия
	//Мы удалили учет упаковок, поэтому удалим и параметр
	//Замена
	//Запрос.УстановитьПараметр("ИндивидуальныйНаборУпаковок", Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры);
	//--Дейнеко ВГ 2017-09-18 Бухгалтерия
	
	// Так же необходимо сделать выгрузку номенклатуры по созданным документам
	Запрос.Выполнить();

КонецПроцедуры 

Процедура МенеджерВТСклады(МенеджерВТ)
	
	Отборы = ЭлементОтбораПоЛевомуЗначению("Склады");
	МакетКомпоновкиСклады = СформированныйМакетКомпоновкиДанных(Отборы, ТекстЗапросаВыборкиСклады());
	
	// Выборка из справочника Склады
	//{{dm_180831
	Если ЗначениеЗаполнено(ВыбНастройкиАгента.МобильныйСклад) Тогда
		Запрос = Новый Запрос(МакетКомпоновкиСклады.НаборыДанных.НаборДанных.Запрос + ДополнительныйТекстЗапросаВыборкиСкладов());
		Запрос.УстановитьПараметр("МобильныйСклад", ВыбНастройкиАгента.МобильныйСклад);
	Иначе
		Запрос = Новый Запрос(МакетКомпоновкиСклады.НаборыДанных.НаборДанных.Запрос);
	КонецЕсли;
	//}}dm_180831
	Для Каждого ЭлементОтбора Из МакетКомпоновкиСклады.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
	КонецЦикла;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Функция МенеджерВТПолучить(стрВидыОбъектов = "Номенклатура,Партнеры,Склады")
	
	//Если ИспользоватьПунктыРазгрузки Тогда 
	//	стрВидыОбъектов = стрВидыОбъектов + ",Контрагенты";
	//КонецЕсли;
	
	мВидыОбъектов = СтрРазделить_(стрВидыОбъектов);
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Для каждого стрВидОбъекта Из мВидыОбъектов Цикл
		Если стрВидОбъекта = "Номенклатура" Тогда
		    МенеджерВТНоменклатуры(МенеджерВТ);
		ИначеЕсли стрВидОбъекта = "Партнеры" Тогда
			МенеджерВТПартнеров(МенеджерВТ);
		ИначеЕсли стрВидОбъекта = "Контрагенты" Тогда
			МенеджерВТКонтрагенты(МенеджерВТ);
		ИначеЕсли стрВидОбъекта = "Склады" Тогда
			МенеджерВТСклады(МенеджерВТ);
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат МенеджерВТ;

КонецФункции 

// ФормированиеВремеменныхТаблиц
#КонецОбласти

// Функция создает zip-архив выгружаемых картинок.
// 
// Параметры:
//		тзКартинки - Неопределено, ТаблицаЗначений - таблица свойств картинок с колонками:
//			* Ссылка - СправочникСсылка.НоменклатураПрисоединенныеФайлы или СправочникСсылка.ПартнерыПрисоединенныеФайлы
// 			* Описание - Строка - описание картинки
//  		* ИмяФайла - Строка - имя файла для записи в zip-архив
//  
// Возвращаемое значение:
//  Строка   - полный путь к zip-архиву.
//  
Функция СформироватьАрхивСКартинками(тзКартинки)
	   	
	Если тзКартинки = Неопределено Или тзКартинки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли; 
				
	КаталогКартинок = КаталогВременныхФайловДляТранспорта("Pictures");
	
	ПолноеИмяАрхиваКартинок = КаталогКартинок + "GoodsPhotosFromCDB.zip";
	
	АрхивКартинок = Новый ЗаписьZipФайла(ПолноеИмяАрхиваКартинок, , , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);		
	
	Для Каждого СтрокаТ Из тзКартинки Цикл			
		ФайлСсылка = СтрокаТ.Ссылка; 
		стррДанные = ПрисоединенныеФайлы.ПолучитьДанныеФайла(ФайлСсылка);	
		ПолноеИмяФайла = КаталогКартинок + СтрокаТ.ИмяФайла;
		Если Не ФайлСуществует(ПолноеИмяФайла) Тогда // если файла в каталоге нет, записываем его из БД
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(стррДанные.СсылкаНаДвоичныеДанныеФайла);
			Если ДвоичныеДанные = Неопределено Тогда
				Продолжить;
			Иначе
				ДвоичныеДанные.Записать(ПолноеИмяФайла);
			КонецЕсли;
		КонецЕсли; 
		АрхивКартинок.Добавить(ПолноеИмяФайла);
	КонецЦикла;	
	
	АрхивКартинок.Записать();
	
	Возврат ПолноеИмяАрхиваКартинок;
	
КонецФункции

// ВыгрузкаДанных
#КонецОбласти

#Область ЗагрузкаДанных

Процедура ОповеститьОСменеАгента(СтарыйАгент, НовыйАгент)
	
	Текст = "В файле загрузки данных указан агент (%1), отличающийся от текущего (%2). Загрузка проводится для агента из файла выгрузки (%1).";
	Текст = СтрШаблон_(Текст, Строка(НовыйАгент), Строка(СтарыйАгент));
	ОповеститьОСобытии(Текст, "ОшибкаНастройки", , СтарыйАгент);
	
КонецПроцедуры

// Функция возвращает Истина, если загрузка прошла корректно.
Функция ЗагрузитьДанныеИзФайлаОбмена(Агент, ФайлОбмена)

	Результат = Истина;	
	
	ЗагружаемыеОбъекты = ЗагруженныеОбъектыИзФайла();
	ТекстXML = Новый ЧтениеXML;
	ТекстXML.ОткрытьФайл(ФайлОбмена.ПолноеИмя);
	
	Пока ТекстXML.Прочитать() Цикл

		Если Не ТекстXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		КонецЕсли;
		Если ТекстXML.Имя = "DATA" Тогда
			НазваниеКонфигурации = ТекстXML.ЗначениеАтрибута("CONFIGNAME");
			ВерсияКонфигурации = ТекстXML.ЗначениеАтрибута("CONFIGVERSION");
		КонецЕсли;

		Если ТекстXML.Имя = "CONSTANTS" Тогда
			Если ТекстXML.Имя = "CONSTANTS"	И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				Продолжить;
			КонецЕсли;
			стррКонстанты = КонстантыИзФайлаОбмена(ТекстXML, "АгентЗагрузки,КодЗапроса");
			АгентЗагрузки = ТорговыйПредставительИзФайлаОбмена(стррКонстанты.АгентЗагрузки);
			Если Агент <> АгентЗагрузки Тогда
				
				Если Не ЗначениеЗаполнено(стррКонстанты.АгентЗагрузки) Тогда // константа отсутствует в файле
					Текст = СтрШаблон_(НСтр("ru = 'В файле загрузки отсуствтует константа ""ИдентификаторАгента""! (GUID=""%1"").'"), 
						КонстантыМТПолучитьGUID("АгентЗагрузки"));
				ИначеЕсли ЗначениеЗаполнено(АгентЗагрузки) Тогда // константа присутствует в файле и ссылается на существующего агента
					Текст = НСтр("ru = 'Получен файл загрузки от агента: '") + АгентЗагрузки;
				Иначе // константа присутствует в файле и ссылается на не существующего агента
					Текст = СтрШаблон_(НСтр("ru = 'В файле выгрузки указана ссылка на несуществующего агента ""%1"". Загрузка проигнорирована.'"), стррКонстанты.АгентЗагрузки);
					ОповеститьОСобытии(Текст);
					Результат = Ложь;
					Прервать;
				КонецЕсли; 
				ОповеститьОСобытии(Текст);
				
				Если Не ЭтоСсылкаНаНайденныйОбъект(АгентЗагрузки) Тогда // Не можем определить по значению константы "АгентЗагрузки" из МУ от какого агента получен файл ...
					Если ЗначениеЗаполнено(Агент) Тогда // ... тогда загружаем файл для текущего выбранного агента - такое допустимо, например, при автообмене по FTP - мы точно знаем - нужно загружать для выбранного агента
						ОповеститьОСобытии(СтрШаблон_(НСтр("ru = 'Данные загружаются для текущего агента ""%1"".'"), Агент), "ОшибкаЗапись",, "ТекущийАгент");
					Иначе // ... тогда останавливаем загрузку - не понятно для какого агента грузить файл
						ОповеститьОСобытии(НСтр("ru = 'Загрузка проигнорирована.'"));
						Результат = Ложь;
						Прервать;
					КонецЕсли;
				Иначе
					НастройкиАгента = ПолучитьНастройкиАгента(АгентЗагрузки);
					Если НастройкиАгента = Неопределено Тогда
						Если Не ЗначениеЗаполнено(Агент) Тогда
							ОповеститьОСобытии(СтрШаблон_(НСтр("ru = 'Не найдены настройки для агента ""%1"". Загрузка проигнорирована.'"), АгентЗагрузки), "ОшибкаЗапись");
							Результат = Ложь;
							Прервать;
						Иначе
							ОповеститьОСобытии(СтрШаблон_(НСтр("ru = 'Не найдены настройки для агента ""%1"". Загружаются данные с использованием настроек для агента ""%2"".'"), 
								АгентЗагрузки, Агент), "ОшибкаЗапись",, "ТекущийАгент");
							Агент = АгентЗагрузки;						
						КонецЕсли; 
					Иначе
						ВыбНастройкиАгента = НастройкиАгента;
						ОповеститьОСменеАгента(Агент, АгентЗагрузки);
						Агент = АгентЗагрузки;
					КонецЕсли; 
				КонецЕсли;
				
			КонецЕсли;
		ИначеЕсли ТекстXML.Имя = "CATALOGS" Тогда
			ЗагрузитьСправочники(ТекстXML, ЗагружаемыеОбъекты);
		ИначеЕсли ТекстXML.Имя = "DOCUMENTS" Тогда
			ЗагрузитьДокументы(ТекстXML, ЗагружаемыеОбъекты);
		ИначеЕсли ТекстXML.Имя = "PICTURES" Тогда
			//ЗагрузитьФотографии(ТекстXML, ПараметрыОбмена, ЗагружаемыеОбъекты, ПапкаСФотографиями);
		КонецЕсли;
		
	КонецЦикла;
	ТекстXML.Закрыть();

	Если Результат Тогда
		ЗакончитьЗагрузкуКонтактнойИнформации(ЗагружаемыеОбъекты);
		ЗакончитьЗагрузкуВозвратов(ЗагружаемыеОбъекты); //dm_180605
		ЗакончитьЗагрузкуКассовыхОрдеров(ЗагружаемыеОбъекты);
		ПодтвержденияСохранить(ВыбНастройкиАгента.СсылкаМУ, ЗагружаемыеОбъекты);
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

#Область ЗагрузкаСправочников
// sd_10082017
Процедура ЗагрузитьСправочники(ТекстXML, ЗагружаемыеОбъекты)
	
	ТипУзлаНачало = ТипУзлаXML.НачалоЭлемента;
	ТипУзлаКонец  = ТипУзлаXML.КонецЭлемента;
	
	Пока ТекстXML.Прочитать() Цикл
		
		Имя = ТекстXML.Имя;
		
		Если ТекстXML.ТипУзла = ТипУзлаНачало Тогда	
			Если Имя = "KILLEDS" Тогда
				ТекстXML.Пропустить();
				Продолжить;
			КонецЕсли;			
		ИначеЕсли ТекстXML.ТипУзла = ТипУзлаКонец Тогда
			Если Имя = "CATALOGS" Тогда
				Прервать;
			ИначеЕсли Имя = "CATALOG" Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ИдСпрXML = ТекстXML.ЗначениеАтрибута("GUID");
		Если ИдСпрXML <> Неопределено Тогда
			ИдВидСправочникаМТ = Новый УникальныйИдентификатор(ИдСпрXML); // gi_170902
			ВидСправочника = ВидОбъектаПоИдентификатору(ИдВидСправочникаМТ, Истина, "Справочник");
			Если ВидСправочника = Неопределено Тогда 
				ТекстXML.Пропустить();
				Если ТекстXML.Имя = "CATALOGS" И ТекстXML.ТипУзла = ТипУзлаКонец Тогда
					Прервать;
				Иначе
					Продолжить;				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Пока ТекстXML.Прочитать() Цикл
			
			Имя = ТекстXML.Имя;
			
			Если ТекстXML.ТипУзла = ТипУзлаНачало Тогда
				Если Имя = "ITEM" Тогда
					ЗагрузитьСправочник(ТекстXML, ЗагружаемыеОбъекты, ВидСправочника, ИдВидСправочникаМТ);
				ИначеЕсли Имя = "KILLEDS" Или Имя = "GROUPS" Тогда
					ТекстXML.Пропустить();
					Прервать;
				КонецЕсли;
			ИначеЕсли ТекстXML.ТипУзла = ТипУзлаКонец Тогда
				Если Имя = "ELEMENTS" Или Имя = "CATALOG" Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;				
			
		КонецЦикла;
		
	КонецЦикла; // Пока ТекстXML.Прочитать() Цикл
	
КонецПроцедуры

// Функция загружает элемент справочника из XML-файла в БД 1С:Предприятия.
// Параметры:
//		ТекстXML - ЧтениеXML - объект ЧтениеXML
//		ЗагружаемыеОбъекты - Структура - структура для запоминания загруженных объектов (используется для выгрузки подтверждений).
//		ВидСправочника - Строка - вид справочника в 1С:Предприятии
//		ИдВидСправочникаМТ - УникальныйИдентификатор - идентификатор вида документа в МТ
// Возвращаемое значение:
// 		Булево - Истина - если элемент справочника успешно записан в БД, иначе Ложь.
//  
Функция ЗагрузитьСправочник(ТекстXML, ЗагружаемыеОбъекты, ВидСправочника, ИдВидСправочникаМТ)
	
	Если ТекстXML.Имя = "ITEM" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		Возврат Ложь;
	ИначеЕсли ТекстXML.Имя = "ELEMENTS" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВидСправочника = "НастройкиОбмена" Тогда // sd_20082017 Внес правки по аналогии с замечаниями по загрузке документа Внеплановый маршрут
		Текст = СтрШаблон_("Пропущена загрузка справочника %1", ВидСправочника);
		//ОповеститьОСобытии(Текст); 
		ТекстXML.Пропустить();
		Возврат Истина;
	//{{dm_180704
	ИначеЕсли ВидСправочника = "*ФотоДокументов" Тогда
		ОповеститьОСобытии(СтрШаблон_("Пропущена загрузка справочника ""%1"". Загрузка не предусмотрена!", ВидСправочника)); 
		ТекстXML.Пропустить();
		Возврат Ложь;
	КонецЕсли;
	//}}dm_180704
	
	
	СпрМенеджер = Справочники[ВидСправочника];
	ПредставлениеСпр = СпрМенеджер.ПустаяСсылка().Метаданные().Синоним;
	
	ИдОбъекта = Новый УникальныйИдентификатор(ТекстXML.ЗначениеАтрибута("GUID"));
	
	СсылкаОбъекта = СпрМенеджер.ПолучитьСсылку(ИдОбъекта);
	
	Если СсылкаОбъекта.ПолучитьОбъект() = Неопределено Тогда			
		ОбъектСпр = СпрМенеджер.СоздатьЭлемент();						
		ОбъектСпр.УстановитьСсылкуНового(СсылкаОбъекта);
		ОбъектСпр.ОбменДанными.Загрузка = Истина;
		ОбъектСпр.УстановитьНовыйКод();
		ЭтоНовыйОбъект = Истина;
	Иначе						
		ОбъектСпр = СсылкаОбъекта.ПолучитьОбъект();
		ОбъектСпр.Разблокировать();
		ЭтоНовыйОбъект = Ложь;
	КонецЕсли;
	
	Если ВидСправочника = "Партнеры" Тогда   		
		Результат = ЗагрузитьПартнера(ТекстXML, ЗагружаемыеОбъекты, ОбъектСпр, ЭтоНовыйОбъект);	
		ТекстXML.Прочитать();
	ИначеЕсли ВидСправочника = "Контрагенты" Тогда
		Результат = ЗагрузитьКонтрагента(ТекстXML, ЗагружаемыеОбъекты, ОбъектСпр, ЭтоНовыйОбъект);
		ТекстXML.Прочитать();
	ИначеЕсли ВидСправочника = "ВидыКонтактнойИнформации" Тогда
		Результат = ЗагрузитьКонтактнуюИнформацию(ТекстXML, ЗагружаемыеОбъекты, ОбъектСпр, ЭтоНовыйОбъект);
		ТекстXML.Прочитать();
	ИначеЕсли ВидСправочника = "КонтактныеЛицаПартнеров" Тогда
		Результат = ЗагрузитьКонтактноеЛицо(ТекстXML, ЗагружаемыеОбъекты, ОбъектСпр, ЭтоНовыйОбъект);
		ТекстXML.Прочитать();
	Иначе // sd_20082017 Внес правки по аналогии с замечаниями по загрузке документа Внеплановый маршрут
		Текст = "Пропущена загрузка справочника ""%1 (%2)"". Загрузка справочников не предусмотрена!"; // sd_25082017
		ОповеститьОСобытии(СтрШаблон_(Текст, ПредставлениеСпр, ВидСправочника)); 
		ТекстXML.Пропустить();
		Возврат Ложь;
	КонецЕсли;
	
	Если Результат Тогда
		
		СтрокаТ = ЗагружаемыеОбъекты.ТЗЗагруженныеСправочники.Добавить();
		СтрокаТ.Идентификатор 	 	= ИдОбъекта; // идентификатор (GUID) элемента справочника
		СтрокаТ.ИдВидСправочникаМТ	= ИдВидСправочникаМТ; // идентификатор (GUID) вида справочника в МТ
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьПартнера(ТекстXML, ЗагружаемыеОбъекты, ОбъектСпр, ЭтоНовыйОбъект)
	
	НаименованиеПартнера 	= СокрЛП(ТекстXML.ПолучитьАтрибут("Name"));
	Долгота 				= ТекстXML.ПолучитьАтрибут("A016");
	Широта	 				= ТекстXML.ПолучитьАтрибут("A017");
	
	ОбъектСпр.Наименование 			= НаименованиеПартнера;
	ОбъектСпр.НаименованиеПолное 	= НаименованиеПартнера; 
	ОбъектСпр.ГруппаДоступа 		= СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("GrpId0"), "ГруппыДоступаПартнеров");
	ОбъектСпр.Комментарий 			= ТекстXML.ПолучитьАтрибут("A023");
	ОбъектСпр.ЮрФизЛицо 			= Перечисления.КомпанияЧастноеЛицо.Компания;
	ОбъектСпр.ОсновнойМенеджер		= ВыбНастройкиАгента.Пользователь;
	ОбъектСпр.ОбменДанными.Загрузка = Ложь;
		
	Если Не ОбъектСпр.ЭтоГруппа Тогда 
		ОбъектСпр.Клиент = Истина;		
	КонецЕсли;

	стррДопСвойств = Новый Структура("Долгота, Широта");
	стррДопСвойств.Широта 	= Широта;
	стррДопСвойств.Долгота 	= Долгота;
	
	Результат = ЗаписьСправочника(ОбъектСпр, стррДопСвойств, ЭтоНовыйОбъект);
	
	Возврат Результат;
	
КонецФункции

// предварительная загрузка фотографии в ТЗ
Функция ЗагрузитьФотографиюЭтап1(стррДанные, ЗагружаемыеОбъекты)
	
	тзФотографии = ЗагружаемыеОбъекты.тзФотографии;
	СтрокаТ = тзФотографии.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТ, стррДанные);
	
КонецФункции

Функция ЗагрузитьКонтрагента(ТекстXML, ЗагружаемыеОбъекты, ОбъектСпр, ЭтоНовыйОбъект)

	НаименованиеКонтрагента	= СокрЛП(ТекстXML.ПолучитьАтрибут("Name"));
	Долгота 				= ТекстXML.ПолучитьАтрибут("A09");
	Широта	 				= ТекстXML.ПолучитьАтрибут("A010");
	
	ОбъектСпр.Наименование 				= НаименованиеКонтрагента;
	ОбъектСпр.НаименованиеПолное 		= НаименованиеКонтрагента;
	ОбъектСпр.Партнер					= СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A02"), "Партнеры");
	ОбъектСпр.ЮрФизЛицо 				= Перечисления.ЮрФизЛицо.ЮрЛицо;
	ОбъектСпр.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	ОбъектСпр.ОбменДанными.Загрузка 	= Ложь;
	
	Если Не ЗначениеЗаполнено(ОбъектСпр.ГоловнойКонтрагент) И Не ОбъектСпр.ОбособленноеПодразделение Тогда
		ОбъектСпр.ГоловнойКонтрагент = ?(ЭтоНовыйОбъект, ОбъектСпр.ПолучитьСсылкуНового(), ОбъектСпр.Ссылка);
	КонецЕсли;
	
	стррДопСвойств = Новый Структура("Долгота, Широта", Долгота, Широта); // sd_25082017
	
	Результат = ЗаписьСправочника(ОбъектСпр, стррДопСвойств, ЭтоНовыйОбъект);
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьКонтактнуюИнформацию(ТекстXML, ЗагружаемыеОбъекты, ОбъектСпр, ЭтоНовыйОбъект);
	
	ИдЭлемента       = ТекстXML.ПолучитьАтрибут("GUID");
	ИдКонтрагент     = ТекстXML.ПолучитьАтрибут("A01");
	ИдТорговаяТочка  = ТекстXML.ПолучитьАтрибут("A02");
	ИдКонтактноеЛицо = ТекстXML.ПолучитьАтрибут("A03");
	ИдТип 		     = ТекстXML.ПолучитьАтрибут("A04");
	ИдВид 		     = ТекстXML.ПолучитьАтрибут("A05");
	Представление    = ТекстXML.ПолучитьАтрибут("A06");

	Если ИдКонтактноеЛицо <> Неопределено Тогда
		ТекОбъект = СсылкаИзСправочника(ИдКонтактноеЛицо, "КонтактныеЛицаПартнеров");
		Если НЕ ЗначениеЗаполнено(ТекОбъект) Тогда 
			ОбъектСпр = Справочники.КонтактныеЛицаПартнеров.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдКонтактноеЛицо)); // sd_25082017
		КонецЕсли;
	ИначеЕсли ИдКонтрагент <> Неопределено Тогда
		ТекОбъект = СсылкаИзСправочника(ИдКонтрагент, "Партнеры");
		Если НЕ ЗначениеЗаполнено(ТекОбъект) Тогда 
			ОбъектСпр = Справочники.Партнеры.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдКонтрагент)); // sd_25082017
		КонецЕсли;
	ИначеЕсли ИдТорговаяТочка <> Неопределено Тогда
		ТекОбъект = СсылкаИзСправочника(ИдТорговаяТочка, "Контрагенты");
		Если НЕ ЗначениеЗаполнено(ТекОбъект) Тогда 
			ОбъектСпр = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдТорговаяТочка)); // sd_25082017
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	ТипКИ = ПолучитьЗначениеПеречисленияПоИдентификатору("ТипыКонтактнойИнформации", ИдТип);
	ВидКИ = СсылкаИзСправочника(ИдВид, "ВидыКонтактнойИнформации");
	Если ТипКИ = "" Или ВидКИ.Пустая() Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	// Значит, скорее всего, объект контактной информации еще не был загружен.
	Если НЕ ЗначениеЗаполнено(ТекОбъект) Тогда 
		
		Если НЕ ЗагружаемыеОбъекты.Свойство("ТЗКонтактнаяИнформация") Тогда 
			ТЗ = Новый ТаблицаЗначений();
			ТЗ.Колонки.Добавить("ОбъектСпр");
			ТЗ.Колонки.Добавить("ИдЭлемента");
			ТЗ.Колонки.Добавить("Тип");
			ТЗ.Колонки.Добавить("Вид");
			ТЗ.Колонки.Добавить("Представление");
			ЗагружаемыеОбъекты.Вставить("ТЗКонтактнаяИнформация", ТЗ);
		КонецЕсли;
		
		СтрокаТ = ЗагружаемыеОбъекты.ТЗКонтактнаяИнформация.Добавить();
		СтрокаТ.ОбъектСпр		= ОбъектСпр;
		СтрокаТ.ИдЭлемента     	= ИдЭлемента;
		СтрокаТ.Тип            	= ТипКИ;
		СтрокаТ.Вид            	= ВидКИ;
		СтрокаТ.Представление  	= Представление;
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ОбъектСпр = ТекОбъект.ПолучитьОбъект();
	
	Если ОбъектСпр = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	тчКИ = ОбъектСпр.КонтактнаяИнформация;  		
	Отбор = Новый Структура("Тип, Вид", ТипКИ, ВидКИ);
	
	мСтрокТ = тчКИ.НайтиСтроки(Отбор); 
	
	Если мСтрокТ.Количество() = 0 Тогда
		СтрокаТЧ = тчКИ.Добавить();						
	Иначе  						
		СтрокаТЧ = мСтрокТ[0];
	КонецЕсли;
	
	СтрокаТЧ.Тип		   = ТипКИ;	
	СтрокаТЧ.Вид 		   = ВидКИ;	
	СтрокаТЧ.Представление = Представление;
	
	Результат = ЗаписьСправочника(ОбъектСпр, Неопределено, ЭтоНовыйОбъект);
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьКонтактноеЛицо(ТекстXML, ЗагружаемыеОбъекты, ОбъектСпр, ЭтоНовыйОбъект);
	
	НаименованиеКЛ	= СокрЛП(ТекстXML.ПолучитьАтрибут("Name"));
	ДатаРождения 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A02"));
	ИдКонтрагент    = ТекстXML.ПолучитьАтрибут("A03");
	Комментарий		= ТекстXML.ПолучитьАтрибут("A05");
	
	Если ИдКонтрагент <> Неопределено Тогда
		ТекОбъект = СсылкаИзСправочника(ИдКонтрагент, "Партнеры", Истина);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекОбъект) Тогда 
		Текст = "Не найден владелец контактного лица: " + Строка(НаименованиеКЛ) + ". Загрузка не будет выполнена!";;
		ОповеститьОСобытии(Текст, "ОшибкаОбмен", ОбъектСпр.Ссылка, "ТекущийАгент");
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектСпр.Владелец 				= ТекОбъект;
	ОбъектСпр.Наименование 		 	= НаименованиеКЛ;
	ОбъектСпр.ДатаРождения			= ДатаРождения;
	ОбъектСпр.ДатаРегистрацииСвязи  = ТекущаяДата();
	ОбъектСпр.Автор  				= ВыбНастройкиАгента.Пользователь;
	ОбъектСпр.Комментарий   		= Комментарий;
	ОбъектСпр.ОбменДанными.Загрузка = Истина;
	
	Результат = ЗаписьСправочника(ОбъектСпр, Неопределено, ЭтоНовыйОбъект);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗакончитьЗагрузкуКонтактнойИнформации(ЗагружаемыеОбъекты)
	
	Если НЕ ЗагружаемыеОбъекты.Свойство("ТЗКонтактнаяИнформация") Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТ Из ЗагружаемыеОбъекты.ТЗКонтактнаяИнформация Цикл 
		
		ОбъектСпр = СтрокаТ.ОбъектСпр.ПолучитьОбъект();
		
		Если ОбъектСпр = Неопределено Тогда
			Продолжить;
		КонецЕсли;          
		
		Тип 		  = СтрокаТ.Тип;
		Вид 		  = СтрокаТ.Вид;
		Представление = СтрокаТ.Представление;
		ИдЭлемента 	  = СтрокаТ.ИдЭлемента;
		  				
		тчКИ = ОбъектСпр.КонтактнаяИнформация;  		
		Отбор = Новый Структура("Тип, Вид", Тип, Вид);
		
		мСтрокТ = тчКИ.НайтиСтроки(Отбор); 
		
		Если мСтрокТ.Количество() = 0 Тогда
			СтрокаТЧ = тчКИ.Добавить();						
		Иначе  						
			СтрокаТЧ = мСтрокТ[0];
		КонецЕсли;
		
		СтрокаТЧ.Тип		   = Тип;	
		СтрокаТЧ.Вид 		   = Вид;	
		СтрокаТЧ.Представление = Представление;	  
		
		Если Не ВыполнитьОперациюДляОбъекта(ОбъектСпр, "запись") Тогда
			Текст = "Не удалось записать элемент справочника: " + Строка(ОбъектСпр) + " в базу!";
			ОповеститьОСобытии(Текст, "ОшибкаЗапись", ОбъектСпр.Ссылка, "ТекущийАгент");
			Возврат;
		КонецЕсли;
		
		Текст = "Записана контактная информация для объекта: " + ОбъектСпр;
		ОповеститьОСобытии(Текст, "ИнфоОбмен", ОбъектСпр.Ссылка);
		
		Если ЗагружаемыеОбъекты.ТЗЗагруженныеСправочники.Найти(ИдЭлемента, "Идентификатор") = Неопределено Тогда 
			СтрокаТ = ЗагружаемыеОбъекты.ТЗЗагруженныеСправочники.Добавить();
			СтрокаТ.Идентификатор 	 	= ИдЭлемента;
			СтрокаТ.ИдВидСправочникаМТ	= "85B62882-0156-4881-85BA-B8FEF05C867B"; // идентификатор (GUID) вида справочника в МТ
		КонецЕсли;
		
	КонецЦикла;
	
	ЗагружаемыеОбъекты.ТЗКонтактнаяИнформация.Очистить();
	
КонецПроцедуры


// ЗагрузкаСправочников
#КонецОбласти

#Область ЗагрузкаДокументов

Процедура ЗагрузитьДокументы(ТекстXML, ЗагружаемыеОбъекты)

	ТипУзлаНачало = ТипУзлаXML.НачалоЭлемента;
	ТипУзлаКонец  = ТипУзлаXML.КонецЭлемента;
	
	Пока ТекстXML.Прочитать() Цикл
		
		Имя = ТекстXML.Имя;
		
		Если ТекстXML.ТипУзла = ТипУзлаНачало Тогда	
			Если Имя = "KILLEDS" Тогда
				ТекстXML.Пропустить();
				Продолжить;
			КонецЕсли;
		//{{dm_180704: Если после документов идут картинки, то эта конструкция не срабатывает. Взял из БМ для УТ
		//ИначеЕсли ТекстXML.ТипУзла = ТипУзлаКонец Тогда
		//	Если Имя = "DOCUMENTS" Или Имя = "DOCUMENT" Тогда
		//		Продолжить;
		//	КонецЕсли;
		//КонецЕсли;
		ИначеЕсли ТекстXML.ТипУзла = ТипУзлаКонец Тогда
			Если Имя = "DOCUMENTS" Тогда
				Прервать;
			ИначеЕсли Имя = "DOCUMENT" Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		//}}dm_180704		

		ИдДокXML = ТекстXML.ЗначениеАтрибута("GUID");
		Если ИдДокXML <> Неопределено Тогда
			ИдВидДокументаМТ = Новый УникальныйИдентификатор(ИдДокXML); // gi_170902
			ВидДокумента = ВидОбъектаПоИдентификатору(ИдВидДокументаМТ, Истина, "Документ");
			Если ВидДокумента = Неопределено Тогда 
				ТекстXML.Пропустить();
				Если ТекстXML.Имя = "DOCUMENTS" И ТекстXML.ТипУзла = ТипУзлаКонец Тогда
					Прервать;
				Иначе
					Продолжить;				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;			

		Пока ТекстXML.Прочитать() Цикл
			
			Имя = ТекстXML.Имя;
			
			Если ТекстXML.ТипУзла = ТипУзлаНачало Тогда
				Если Имя = "ITEM" Тогда
					ЗагрузитьДокумент(ТекстXML, ЗагружаемыеОбъекты, ВидДокумента, ИдВидДокументаМТ);
				ИначеЕсли Имя = "KILLEDS" Тогда
					ТекстXML.Пропустить();
					Прервать;
				КонецЕсли;
			ИначеЕсли ТекстXML.ТипУзла = ТипУзлаКонец Тогда
				Если Имя = "ELEMENTS" Или Имя = "DOCUMENT" Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;				
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьДокументы

Функция ЗагрузитьДокументЗаказДляБух30(ТекстXML, ОбъектДок, ЭтоНовыйОбъект)
	
	ЗагрузкаВВидеЗаказа = (ОбъектДок.Метаданные().Имя = "СчетНаОплатуПокупателю");
	
	//++Заполнение оновных полей документа СчетНаОплатуПокупателю
	ОбъектДок.Заполнить(Неопределено);
	
	стррДокумент = ОбщиеРеквизитыДокумента();
	стррДокумент.ВидДокумента 	= "Заказ";
	стррДокумент.Номер 			= ТекстXML.ПолучитьАтрибут("DocNumberPrefix") + ТекстXML.ПолучитьАтрибут("DocNumber");
	стррДокумент.Дата 			= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("dt"));
	стррДокумент.ИдОрганизации 	= ТекстXML.ПолучитьАтрибут("A02");
	стррДокумент.ИдКлиента		= ТекстXML.ПолучитьАтрибут("A03");
	стррДокумент.ИдСоглашения	= ТекстXML.ПолучитьАтрибут("A05");
	стррДокумент.СуммаДокумента = Число(ТекстXML.ПолучитьАтрибут("A08"));
	стррДокумент.Комментарий 	= ТекстXML.ПолучитьАтрибут("A011");
	стррДокумент.ИдКатегории 	= ТекстXML.ПолучитьАтрибут("A012");
	стррДокумент.Широта 		= ТекстXML.ПолучитьАтрибут("A014");
	стррДокумент.Долгота 		= ТекстXML.ПолучитьАтрибут("A015");
	стррДокумент.ДатаНачала 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A017"));
	стррДокумент.ДатаОкончания 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A018"));

	ОбщаяСкидка 		= Число(ТекстXML.ПолучитьАтрибут("A06"));
	ВидЦены 			= СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A07"), "ТипыЦенНоменклатуры");
	ОбщийВес 			= Число(ТекстXML.ПолучитьАтрибут("A09"));
	ДатаДоставки 		= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A010"));
	ИдМерчендайзинга	= ТекстXML.ПолучитьАтрибут("A013");
	ВидОплаты 			= ПолучитьЗначениеПеречисленияПоИдентификатору("ФормыОплаты", ТекстXML.ПолучитьАтрибут("A019")); 
	Склад 				= СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A023"), "Склады");
	ПометкаУдаления 	= Булево(Число(ТекстXML.ПолучитьАтрибут("IsDeleted")));

	ДокМенеджер = Документы.СчетНаОплатуПокупателю;
	стррОбязательныеПоля = Новый Структура("Организация, Контрагент, ДоговорКонтрагента");
	ЗаполнитьОсновныеПараметрыДокумента(ОбъектДок, стррДокумент, ДокМенеджер, стррОбязательныеПоля);
	//dm В вышеуказанной /\ процедуре в документе ПоступлениеТоваровУслуг заполнились реквизиты:
	// - Организация
	// - Контрагент
	// - ДоговорКонтрагента
	// - Ответственный
	// - Комментарий
	// - Дата
	// - Номер
	// - Автор
	// - СуммаДокумента
	//--Заполнение оновных полей документа СчетНаОплатуПокупателю
	
	Если Склад = Справочники.Склады.ПустаяСсылка() Тогда
		ОбъектДок.Склад = ВыбНастройкиАгента.ОсновнойСклад;
	Иначе
		ОбъектДок.Склад = Склад;	
	КонецЕсли;
	
	Соглашение = ОбъектДок.ДоговорКонтрагента;
	Если ЗначениеЗаполнено(Соглашение) Тогда
		//{{dm_180426-180427
		ЗаполнитьПоДоговору(ОбъектДок, Соглашение, ВидЦены);
	Иначе
		ЗаполнитьНеПоДоговору(ОбъектДок,ВидЦены);
		//{{dm_180426-180427
	КонецЕсли;
		
	//Банковский счет
	ОбъектДок.СтруктурнаяЕдиница = ОбъектДок.Организация.ОсновнойБанковскийСчет;
	
	//+dm_18.10.17
	//(( sk_190724 Заполнение признака налогооблажения НДС вынесено в отдельную процедуру  	
	//УчитыватьНДС = ОбъектДок.СуммаВключаетНДС;
	УчитыватьНДС = УчитыватьНДС(ОбъектДок);
	
	ЗаполнитьНалогооблажениеНДСДокумента(ОбъектДок, УчитыватьНДС);
	//)) sk_190724
	//+dm_18.10.17
	
	//{{dm_180626
	Если ЗначениеЗаполнено(стррДокумент.ИдКатегории) Тогда
		Категория = ПолучитьКатегориюДокумента(стррДокумент.ИдКатегории);	
		ОбъектДок.Комментарий = Категория + Символы.ВК + ОбъектДок.Комментарий;
	КонецЕсли;
	//}}dm_180626
		
//ТОВАРЫ////////////////////////////////////////////////////////////////////////////////	
	
	Если Не ОбъектДок.ЭтоНовый() Тогда
		ОбъектДок.Товары.Очистить();
		//{{dm_180428
		Если гКонфигурация = "Бухгалтерия_KZ" Тогда
			ОбъектДок.Услуги.Очистить();
		КонецЕсли;
		//}}dm_180428
	КонецЕсли;
	
	ИдТЧТовары = НРег("0738E61B-F06F-464A-8483-4249E0254819"); // идентификатор ТЧ "Товары" у Заказа в МТ 2.0
	
	ТекстXML.Прочитать();
	Если ТекстXML.Имя = "TABLES" И ТекстXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		ТекстXML.Прочитать();
		Если НРег(СокрЛП(ТекстXML.ПолучитьАтрибут("GUID"))) = ИдТЧТовары Тогда
			Пока ТекстXML.Прочитать() Цикл
				Если ТекстXML.Имя = "TABLE" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					ТекстXML.Пропустить();
					Прервать;
				КонецЕсли;
				Если ТекстXML.Имя = "ITEM" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					Продолжить;
				КонецЕсли;
				
				//{{dm_180427
				стррАтрибуты = ПолучитьСтруктуруАтрибутовТЧЗаказ(ТекстXML, УчитыватьНДС);
				
				Если стррАтрибуты.Номенклатура.Услуга И гКонфигурация = "Бухгалтерия_KZ" Тогда
					//Услуга
					НоваяСтрока = ОбъектДок.Услуги.Добавить();										
				Иначе
					//Товар
					НоваяСтрока = ОбъектДок.Товары.Добавить();
				КонецЕсли;
				
				//((dm_180420-180427
				Если ЭтоУпаковка(стррАтрибуты.ИдЕдиницыИзм) Тогда
					ПересчитатьИзУпаковок(стррАтрибуты.Количество, стррАтрибуты.Цена, стррАтрибуты.ИдЕдиницыИзм);
				КонецЕсли;
				//))dm_180420-180427
							
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стррАтрибуты);
								
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
//--Товары/////////////////////////////////////////////////////////////////////////////	
	
	
	Результат = ЗаписьДокумента(ОбъектДок, стррДокумент, ЭтоНовыйОбъект);
	Возврат Результат
КонецФункции

//{{dm_180420: Добавил функции для рабрты с виртуальным справочником Упаковки номенклатуры
Функция ЭтоУпаковка(ИдЕдиницыИзм)
	
	Результат = СсылкаИзСправочника(ИдЕдиницыИзм, "КлассификаторЕдиницИзмерения");
	Возврат Результат.Пустая();
	
КонецФункции

Процедура ПересчитатьИзУпаковок(Количество, Цена, ИдЕдиницыИзм)
	
	Поиск = гтзУпаковки.Найти(Новый УникальныйИдентификатор(ИдЕдиницыИзм), "УникальныйИдентификатор");
	
	Если Поиск = Неопределено Тогда
		Возврат;
	Иначе
		Количество = Количество * Поиск.Коэффициент;
		Цена = Цена / Поиск.Коэффициент;
	КонецЕсли;
	 
КонецПроцедуры
//}}dm_180420

//dm_171003: Новая функция
Функция ЗагрузитьДокументРеализацияДляБух30(ТекстXML, ОбъектДок, ЭтоНовыйОбъект, ИзСчета = Ложь)

	//{{dm_180515
	стррДокумент = ОбщиеРеквизитыДокумента();
	стррДокумент.ВидДокумента 	= "Реализация";
	Если ИзСчета Тогда
		стррДокумент.Номер 			= ТекстXML.ПолучитьАтрибут("DocNumberPrefix") + ТекстXML.ПолучитьАтрибут("DocNumber");
		стррДокумент.Дата 			= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("dt"));
		стррДокумент.ИдОрганизации 	= ТекстXML.ПолучитьАтрибут("A02");
		стррДокумент.ИдКлиента		= ТекстXML.ПолучитьАтрибут("A03");
		стррДокумент.ИдСоглашения	= ТекстXML.ПолучитьАтрибут("A05");
		стррДокумент.СуммаДокумента = Число(ТекстXML.ПолучитьАтрибут("A08"));
		стррДокумент.Комментарий 	= ТекстXML.ПолучитьАтрибут("A011");
		стррДокумент.ИдКатегории 	= ТекстXML.ПолучитьАтрибут("A012");
		стррДокумент.Широта 		= ТекстXML.ПолучитьАтрибут("A014");
		стррДокумент.Долгота 		= ТекстXML.ПолучитьАтрибут("A015");
		стррДокумент.ДатаНачала 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A017"));
		стррДокумент.ДатаОкончания 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A018"));
	
		ОбщаяСкидка 		= Число(ТекстXML.ПолучитьАтрибут("A06"));
		ВидЦены 			= СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A07"), "ТипыЦенНоменклатуры");
		ОбщийВес 			= Число(ТекстXML.ПолучитьАтрибут("A09"));
		ДатаДоставки 		= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A010"));
		ИдМерчендайзинга	= ТекстXML.ПолучитьАтрибут("A013");
		ВидОплаты 			= ПолучитьЗначениеПеречисленияПоИдентификатору("ФормыОплаты", ТекстXML.ПолучитьАтрибут("A019")); 
		Склад 				= СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A023"), "Склады");
		ПометкаУдаления 	= Булево(Число(ТекстXML.ПолучитьАтрибут("IsDeleted")));
		ИдДокОснования		= Неопределено;
	Иначе
	
		стррДокумент.Номер 			= ТекстXML.ПолучитьАтрибут("DocNumberPrefix") + ТекстXML.ПолучитьАтрибут("DocNumber");
		стррДокумент.Дата 			= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("dt"));
		стррДокумент.ИдОрганизации 	= ТекстXML.ПолучитьАтрибут("A01");
		стррДокумент.ИдКлиента		= ТекстXML.ПолучитьАтрибут("A02");
		стррДокумент.ИдСоглашения	= ТекстXML.ПолучитьАтрибут("A04");
		стррДокумент.СуммаДокумента = Число(ТекстXML.ПолучитьАтрибут("A07"));
		стррДокумент.Комментарий 	= ТекстXML.ПолучитьАтрибут("A09");
		стррДокумент.ИдКатегории 	= ТекстXML.ПолучитьАтрибут("A010");
		стррДокумент.Широта 		= ТекстXML.ПолучитьАтрибут("A012");
		стррДокумент.Долгота 		= ТекстXML.ПолучитьАтрибут("A013");
		стррДокумент.ДатаНачала 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A016"));
		стррДокумент.ДатаОкончания 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A017"));

		ОбщаяСкидка 		= Число(ТекстXML.ПолучитьАтрибут("A05"));
		ВидЦены 			= СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A06"), "ТипыЦенНоменклатуры");
		ОбщийВес 			= Число(ТекстXML.ПолучитьАтрибут("A08"));
		ИдДокОснования 	 	= ТекстXML.ПолучитьАтрибут("A011");
		ИдМерчендайзинга	= ТекстXML.ПолучитьАтрибут("A015");
		ВидОплаты 			= ПолучитьЗначениеПеречисленияПоИдентификатору("ФормыОплаты", ТекстXML.ПолучитьАтрибут("A018")); 
		ПометкаУдаления 	= Булево(Число(ТекстXML.ПолучитьАтрибут("IsDeleted")));
	КонецЕсли;
	//}}dm_180515
	ВалютаУчета			= КонстантыПолучитьЗначение("ВалютаРегламентированногоУчета");
	
	ОбъектДок.Заполнить(Неопределено);
	// При выполнении ОбъектДок.Заполнить(Неопределено) заполняются следующие реквизиты документа:
	// - БанковскийСчетОрганизации
	// - ВалютаДокумента
	// - ВидОперации
	// - Дата
	// - Организация
	// - Ответственный
	// - Склад (выбирается Основной)
	// - СпособЗачетаАвансов (Автоматически)
	// - СуммаВключаетНДС
	// - СчетУчетаРасчетовПоАвансам
	// - СчетУчетаРасчетовПоТаре
	// - СчетУчетаРасчетовСКонтрагентом
	///////////////////////////////////////
	
	ОбъектДок.Ответственный = ВыбНастройкиАгента.Пользователь;
	//{{dm_180517
	Если ЗначениеЗаполнено(ВыбНастройкиАгента.ПодразделениеОрганизации) Тогда
		ОбъектДок.СтруктурноеПодразделение = ВыбНастройкиАгента.ПодразделениеОрганизации;
	КонецЕсли;
	//}}dm_180517
	
	ОбъектДок.ТипЦен = ВидЦены;
	
	ДокМенеджер = Документы.РеализацияТоваровУслуг;
	//{{dm_180428
	ОбъектДок.КратностьВзаиморасчетов = 1;
	ОбъектДок.КурсВзаиморасчетов = 1;
	//}}dm_180428
	
	Если ИспользоватьПунктыРазгрузки Тогда
		стррДокумент.ИдПунктаРазгрузки = ТекстXML.ПолучитьАтрибут("A03");
		стррОбязательныеПоля = Новый Структура("Организация, Контрагент, ПунктРазгрузки, Договор");
	Иначе 
		стррОбязательныеПоля = Новый Структура("Организация, Контрагент, ДоговорКонтрагента");
	КонецЕсли;
	ЗаполнитьОсновныеПараметрыДокумента(ОбъектДок, стррДокумент, ДокМенеджер, стррОбязательныеПоля);
	
	ОснованиеЗаказ = СсылкаИзДокумента(ИдДокОснования, "ЗаказКлиента");
	Если ЗначениеЗаполнено(ОснованиеЗаказ) Тогда
		//(( sk_190725 Добавлена проверка конфигурации
		// ОбъектДок.СчетНаОплатуПокупателю = ОснованиеЗаказ;
		Если гКонфигурация = "Бухгалтерия_KZ" Тогда 
			ОбъектДок.Сделка = ОснованиеЗаказ;	
		Иначе
			ОбъектДок.СчетНаОплатуПокупателю = ОснованиеЗаказ;
		КонецЕсли;
		//)) sk_190725
	КонецЕсли;
	
	//{{dm_180516
	Если ИзСчета Тогда
		ОбъектДок.Склад = Склад;
	Иначе
		Если ЗначениеЗаполнено(ВыбНастройкиАгента.МобильныйСклад) Тогда 
			ОбъектДок.Склад = ВыбНастройкиАгента.МобильныйСклад;
		КонецЕсли;
	КонецЕсли;
	//}}dm_180516
	
	//{{dm_180516
	Договор = ОбъектДок.ДоговорКонтрагента;
	Если ЗначениеЗаполнено(Договор) Тогда
		ЗаполнитьПоДоговору(ОбъектДок, Договор, ВидЦены);
	Иначе
		ЗаполнитьНеПоДоговору(ОбъектДок, ВидЦены);
	КонецЕсли;
	//}}dm_180516
	
	//{{dm_180423
	ОбщийМодуль = ?(гКонфигурация = "Бухгалтерия_KZ", Вычислить("ПроцедурыНалоговогоУчета"), Вычислить("УчетнаяПолитика"));
	//}}dm_180423
	
	//{{dm_180427
	Перечисление = Перечисления.ВидыОперацийРеализацияТоваров;
	ВидОперации = ?(гКонфигурация = "Бухгалтерия_KZ", Перечисление.ПродажаКомиссия, Перечисление.Товары); 
	//}}dm_180427
	
	ОбъектДок.ВидОперации = ВидОперации; //dm_180427
	ОбъектДок.БанковскийСчетОрганизации = ОбъектДок.Организация.ОсновнойБанковскийСчет;
		//{{dm_180423
	//(( sk_190724 Заполнение признака налогооблажения НДС вынесено в отдельную процедуру  	
	//Если гКонфигурация = "Бухгалтерия_KZ" Тогда	
	//	ОбъектДок.СуммаВключаетНДС = ОбщийМодуль.ПолучитьПризнакПлательщикаНДС(ОбъектДок.Организация, ТекущаяДата());
	//Иначе
	//	ОбъектДок.СуммаВключаетНДС = ОбщийМодуль.ПлательщикНДС(ОбъектДок.Организация, ТекущаяДата());
	//КонецЕсли;
	УчитыватьНДС = УчитыватьНДС(ОбъектДок);
	
	ЗаполнитьНалогооблажениеНДСДокумента(ОбъектДок, УчитыватьНДС);
	//)) sk_190724
		//}}dm_180423
	//(( sk_190724	
	//УчитыватьНДС = ОбъектДок.СуммаВключаетНДС;
	//)) sk_190724	
	//{{dm_180427
	Если НЕ гКонфигурация = "Бухгалтерия_KZ" Тогда 
		ОбъектДок.ОтпускПроизвел = ВыбНастройкиАгента.Пользователь; 
	КонецЕсли;
	//}}dm_180427
	
	//{{dm_180626
	Если ЗначениеЗаполнено(стррДокумент.ИдКатегории) Тогда
		Категория = ПолучитьКатегориюДокумента(стррДокумент.ИдКатегории);	
		ОбъектДок.Комментарий = Категория + Символы.ВК + ОбъектДок.Комментарий;
	КонецЕсли;
	//}}dm_180626

	Если Не ОбъектДок.ЭтоНовый() Тогда
		ОбъектДок.Товары.Очистить();
		//{{dm_180428
		ОбъектДок.Услуги.Очистить();
		//}}dm_180428
	КонецЕсли;
	
	//{{dm_180516
	Если ИзСчета Тогда
		ИдТЧТовары = НРег("0738E61B-F06F-464A-8483-4249E0254819"); // идентификатор ТЧ "Товары" у Заказа в МТ 2.0
	Иначе
		ИдТЧТовары = НРег("E4D61E0A-1D62-48D7-B70C-BCBA935D377A"); // идентификатор ТЧ "Товары" у Реализации в МТ 2.0
	КонецЕсли;
	//}}dm_180516
	
	ТекстXML.Прочитать();
	Если ТекстXML.Имя = "TABLES" И ТекстXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		ТекстXML.Прочитать();
		Если НРег(СокрЛП(ТекстXML.ПолучитьАтрибут("GUID"))) = ИдТЧТовары Тогда
			Пока ТекстXML.Прочитать() Цикл
				Если ТекстXML.Имя = "TABLE" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					ТекстXML.Пропустить();
					Прервать;
				КонецЕсли;
				Если ТекстXML.Имя = "ITEM" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					Продолжить;
				КонецЕсли;
			
				//{{dm_180428
				стррАтрибуты = ПолучитьСтруктуруАтрибутовТЧРеализация(ТекстXML, УчитыватьНДС);
				
				Если стррАтрибуты.Номенклатура.Услуга Тогда
					НоваяСтрока = ОбъектДок.Услуги.Добавить();
				Иначе
					НоваяСтрока = ОбъектДок.Товары.Добавить();
				КонецЕсли;
				
				Если ЭтоУпаковка(стррАтрибуты.ИдЕдиницыИзм) Тогда
					ПересчитатьИзУпаковок(стррАтрибуты.Количество, стррАтрибуты.Цена, стррАтрибуты.ИдЕдиницыИзм);
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стррАтрибуты);
				//}}dm_180428
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//{{dm_180428
	ДокМенеджер.ЗаполнитьСчетаУчетаВТабличнойЧасти(ОбъектДок, "Товары");
	ДокМенеджер.ЗаполнитьСчетаУчетаВТабличнойЧасти(ОбъектДок, "Услуги");
	ДокМенеджер.ЗаполнитьСчетаУчетаРасчетов(ОбъектДок);
	//}}dm_180428
	
	
	
	Результат = ЗаписьДокумента(ОбъектДок, стррДокумент, ЭтоНовыйОбъект);
	Если Результат Тогда
		Если ОбъектДок.ПометкаУдаления Тогда
			Текст = "На основании документа """ + Строка(ОбъектДок.Ссылка) + """ не будет создан документ ""Реализация товаров и услуг"", т.к. он помечен на удаление.";
			ОповеститьОСобытии(Текст, "ОшибкаЗапись", ОбъектДок.Ссылка, "ТекущийАгент");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//dm_16.10.17:Внесены изменения
Функция ЗагрузитьДокументПеремещение1(ТекстXML, ОбъектДок, ЭтоНовыйОбъект) // sd_22082017
	
	стррДокумент = ОбщиеРеквизитыДокумента();
	стррДокумент.ВидДокумента 	= "ПеремещениеТоваров";
	стррДокумент.Номер 			= ТекстXML.ПолучитьАтрибут("DocNumberPrefix") + ТекстXML.ПолучитьАтрибут("DocNumber");
	стррДокумент.Дата 			= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("dt"));
	стррДокумент.ИдОрганизации 	= ТекстXML.ПолучитьАтрибут("A01");
	стррДокумент.ИдКатегории	= ТекстXML.ПолучитьАтрибут("A02");
	стррДокумент.Комментарий 	= ТекстXML.ПолучитьАтрибут("A06");
	стррДокумент.Широта 		= ТекстXML.ПолучитьАтрибут("A07");
	стррДокумент.Долгота 		= ТекстXML.ПолучитьАтрибут("A08");
	стррДокумент.ДатаНачала 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A010"));
	стррДокумент.ДатаОкончания 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A011"));
	
	СкладОтправитель = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A03"), "Склады");
	СкладПолучатель	 = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A04"), "Склады");
	//dm_16.10.17
	ВидЦены			 = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A09"), "ТипыЦенНоменклатуры");
	
	ОбъектДок.Заполнить(Неопределено);
	ОбъектДок.Ответственный = ВыбНастройкиАгента.Пользователь;
	
	ДокМенеджер = Документы.ПеремещениеТоваров;
	
	стррОбязательныеПоля = Новый Структура("Организация");
	ЗаполнитьОсновныеПараметрыДокумента(ОбъектДок, стррДокумент, ДокМенеджер, стррОбязательныеПоля); //dm:Заполнит Организация, Ответственный, Комментарий
	
	Если НЕ ЗначениеЗаполнено(СкладОтправитель) Тогда
		Текст = "В документе Перемещение товаров № " + стррДокумент.Номер + " от " + стррДокумент.Дата + "  не указан склад-отправитель!";
		ОповеститьОСобытии(Текст, "ОшибкаЗапись", ОбъектДок.Ссылка, "ТекущийАгент");
	Иначе 
		ОбъектДок.СкладОтправитель = СкладОтправитель;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СкладПолучатель) Тогда
		Текст = "В документе Перемещение товаров № " + стррДокумент.Номер + " от " + стррДокумент.Дата + "  не указан склад-получатель!";
		ОповеститьОСобытии(Текст, "ОшибкаЗапись", ОбъектДок.Ссылка, "ТекущийАгент");
	Иначе 
		ОбъектДок.СкладПолучатель = СкладПолучатель;
	КонецЕсли;
	
	Если Не ОбъектДок.ЭтоНовый() Тогда		
		ОбъектДок.Товары.Очистить();		
	КонецЕсли;
	
	//dm_16.10.17
	ПоляСтруктуры = "Номенклатура, ЕдиницаИзмерения, Количество, СчетУчета, НовыйСчетУчета, СпособУчетаНДС";
	//+dm_16.10.17
	СчетУчета = ПланыСчетов.Хозрасчетный.НайтиПоКоду("41.01");
	НовыйСчетУчета = ПланыСчетов.Хозрасчетный.НайтиПоКоду("41.01");
	СпособУчетаНДС = Перечисления.СпособыУчетаНДС.ПринимаетсяКВычету;
	//-dm_16.10.17
	
	СтруктураДействий = Новый Структура("ПроверитьЗаполнитьУпаковкуПоВладельцу,ПересчитатьКоличествоЕдиниц");
	
	ИдТЧТовары = НРег("3097F10A-BEE6-4A76-AD7A-D4663C9B73EC"); // идентификатор ТЧ "Товары" у Перемещения в МТ 2.0
	
	ТекстXML.Прочитать();
	Если ТекстXML.Имя = "TABLES" И ТекстXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		ТекстXML.Прочитать();
		Если НРег(СокрЛП(ТекстXML.ПолучитьАтрибут("GUID"))) = ИдТЧТовары Тогда
			Пока ТекстXML.Прочитать() Цикл
				Если ТекстXML.Имя = "TABLE" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					ТекстXML.Пропустить();
					Прервать;
				КонецЕсли;
				Если ТекстXML.Имя = "ITEM" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					Продолжить;
				КонецЕсли;
				
				ИдНоменклатуры 		= ТекстXML.ПолучитьАтрибут("A01");
				ИдЕдиницыИзм 		= ТекстXML.ПолучитьАтрибут("A03");
				Количество 			= Число(ТекстXML.ПолучитьАтрибут("A04"));
				Цена 				= Число(ТекстXML.ПолучитьАтрибут("A05"));
				
				ТекНоменклатура  	= СсылкаИзСправочника(ИдНоменклатуры, "Номенклатура");
				ТекЕдиница 			= ТекНоменклатура.ЕдиницаИзмерения;
				
				НоваяСтрока = ОбъектДок.Товары.Добавить();
				
				СтруктураЗаполнения = Новый Структура(ПоляСтруктуры, ТекНоменклатура, ТекЕдиница, Количество, СчетУчета, НовыйСчетУчета, СпособУчетаНДС);

				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураЗаполнения, ПоляСтруктуры);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Результат = ЗаписьДокумента(ОбъектДок, стррДокумент, ЭтоНовыйОбъект);
	
	Возврат Результат;
	
КонецФункции

//dm_180614 Переделал функцию
Функция ЗагрузитьДокументПеремещение(ТекстXML, ОбъектДок, ЭтоНовыйОбъект) // sd_22082017
	
	стррДокумент = ОбщиеРеквизитыДокумента();
	стррДокумент.ВидДокумента 	= "ПеремещениеТоваров";
	стррДокумент.Номер 			= ТекстXML.ПолучитьАтрибут("DocNumberPrefix") + ТекстXML.ПолучитьАтрибут("DocNumber");
	стррДокумент.Дата 			= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("dt"));
	стррДокумент.ИдОрганизации 	= ТекстXML.ПолучитьАтрибут("A01");
	стррДокумент.ИдКатегории	= ТекстXML.ПолучитьАтрибут("A02");
	стррДокумент.Комментарий 	= ТекстXML.ПолучитьАтрибут("A06");
	стррДокумент.Широта 		= ТекстXML.ПолучитьАтрибут("A07");
	стррДокумент.Долгота 		= ТекстXML.ПолучитьАтрибут("A08");
	стррДокумент.ДатаНачала 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A010"));
	стррДокумент.ДатаОкончания 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A011"));
	
	СкладОтправитель = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A03"), "Склады");
	СкладПолучатель	 = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A04"), "Склады");
	ВидЦены			 = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A09"), "ТипыЦенНоменклатуры");
	
	ОбъектДок.Заполнить(Неопределено);
	
	ДокМенеджер = Документы.ПеремещениеТоваров;
	
	стррОбязательныеПоля = Новый Структура("Организация");
	ЗаполнитьОсновныеПараметрыДокумента(ОбъектДок, стррДокумент, ДокМенеджер, стррОбязательныеПоля); //dm:Заполнит Организация, Ответственный, Комментарий
	//dm_180531 В вышеуказанной /\ процедуре в документе ПеремещениеТоваров заполнились реквизиты:
	// - Организация
	// - Ответственный
	// - Комментарий
	// - Дата
	// - Номер
	// - Автор (для Казахской версии)
	
	Если НЕ ЗначениеЗаполнено(СкладОтправитель) Тогда
		Текст = "В документе Перемещение товаров № " + стррДокумент.Номер + " от " + стррДокумент.Дата + "  не указан склад-отправитель!";
		ОповеститьОСобытии(Текст, "ОшибкаЗапись", ОбъектДок.Ссылка, "ТекущийАгент");
	Иначе 
		ОбъектДок.СкладОтправитель = СкладОтправитель;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СкладПолучатель) Тогда
		Текст = "В документе Перемещение товаров № " + стррДокумент.Номер + " от " + стррДокумент.Дата + "  не указан склад-получатель!";
		ОповеститьОСобытии(Текст, "ОшибкаЗапись", ОбъектДок.Ссылка, "ТекущийАгент");
	Иначе 
		ОбъектДок.СкладПолучатель = СкладПолучатель;
	КонецЕсли;
	
	Если гКонфигурация = "Бухгалтерия_RU" Тогда
		СчетаУчета = Вычислить("СчетаУчетаВДокументах");
		ИменаРеквизитов = Новый Соответствие;
		ИменаРеквизитов.Вставить("СчетСписанияНДС",      Истина);
		ИменаРеквизитов.Вставить("СубконтоСписанияНДС1", Истина);
		ИменаРеквизитов.Вставить("СубконтоСписанияНДС2", Истина);
		ИменаРеквизитов.Вставить("СубконтоСписанияНДС3", Истина);
		ИменаРеквизитов.Вставить("НДСвСтоимостиТоваров", Истина);
		
		ЗаполнениеСчетов = Вычислить("СчетаУчетаВДокументах");
		СчетаУчета.ЗаполнитьРеквизиты(ОбъектДок, ИменаРеквизитов);
	КонецЕсли;
	
	
	Если Не ОбъектДок.ЭтоНовый() Тогда		
		ОбъектДок.Товары.Очистить();		
	КонецЕсли;
	
	
	ИдТЧТовары = НРег("3097F10A-BEE6-4A76-AD7A-D4663C9B73EC"); // идентификатор ТЧ "Товары" у Перемещения в МТ 2.0
	
	ТекстXML.Прочитать();
	Если ТекстXML.Имя = "TABLES" И ТекстXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		ТекстXML.Прочитать();
		Если НРег(СокрЛП(ТекстXML.ПолучитьАтрибут("GUID"))) = ИдТЧТовары Тогда
			Пока ТекстXML.Прочитать() Цикл
				Если ТекстXML.Имя = "TABLE" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					ТекстXML.Пропустить();
					Прервать;
				КонецЕсли;
				Если ТекстXML.Имя = "ITEM" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					Продолжить;
				КонецЕсли;
				
				стррАтрибуты = ПолучитьСтруктуруАтрибутовТЧПеремещение(ТекстXML);
				
				НоваяСтрока = ОбъектДок.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стррАтрибуты);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ДокМенеджер.ЗаполнитьСчетаУчетаВТабличнойЧасти(ОбъектДок, "Товары");
	
	Результат = ЗаписьДокумента(ОбъектДок, стррДокумент, ЭтоНовыйОбъект);
	
	Возврат Результат;
	
КонецФункции

//dm_180604 добавил загрузку документа ПоступлениеТоваровУслуг
Функция ЗагрузитьДокументПоступление(ТекстXML, ОбъектДок, ЭтоНовыйОбъект) //dm_180604
	
	стррДокумент = ОбщиеРеквизитыДокумента();
	стррДокумент.ВидДокумента 	= "ПоступлениеТоваровУслуг";
	стррДокумент.Номер 			= ТекстXML.ПолучитьАтрибут("DocNumberPrefix") + ТекстXML.ПолучитьАтрибут("DocNumber");
	стррДокумент.Дата 			= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("dt"));
	стррДокумент.ИдОрганизации 	= ТекстXML.ПолучитьАтрибут("A01");
	стррДокумент.ИдКлиента		= ТекстXML.ПолучитьАтрибут("A02");
	стррДокумент.ИдСоглашения	= ТекстXML.ПолучитьАтрибут("A04");
	стррДокумент.СуммаДокумента = Число(ТекстXML.ПолучитьАтрибут("A07"));
	стррДокумент.Комментарий 	= ТекстXML.ПолучитьАтрибут("A09");
	стррДокумент.ИдКатегории 	= ТекстXML.ПолучитьАтрибут("A010");
	
	стррДокумент.Широта 		= ТекстXML.ПолучитьАтрибут("A013");
	стррДокумент.Долгота 		= ТекстXML.ПолучитьАтрибут("A014");
	стррДокумент.ДатаНачала 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A017"));
	стррДокумент.ДатаОкончания 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A018"));
	
	СкладПолучатель	 = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A016"), "Склады");
	ТипЦены			 = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A06"), "ТипыЦенНоменклатуры");
	ВалютаУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ОбъектДок.Заполнить(Неопределено);
	
	ДокМенеджер = Документы.ПоступлениеТоваровУслуг;
	
	стррОбязательныеПоля = Новый Структура("Организация, Контрагент, ДоговорКонтрагента");
	ЗаполнитьОсновныеПараметрыДокумента(ОбъектДок, стррДокумент, ДокМенеджер, стррОбязательныеПоля);
	//dm_180531 В вышеуказанной /\ процедуре в документе ПоступлениеТоваровУслуг заполнились реквизиты:
	// - Организация
	// - Контрагент
	// - ДоговорКонтрагента
	// - Ответственный
	// - Комментарий
	// - Дата
	// - Номер
	// - Автор
	// - СуммаДокумента
	
	Если НЕ ЗначениеЗаполнено(СкладПолучатель) Тогда
		Текст = "В документе Поступление товаров № " + стррДокумент.Номер + " от " + стррДокумент.Дата + "  не указан склад-получатель!";
		ОповеститьОСобытии(Текст, "ОшибкаЗапись", ОбъектДок.Ссылка, "ТекущийАгент");
	Иначе 
		ОбъектДок.Склад = СкладПолучатель;
	КонецЕсли;
	
	ОбъектДок.ВалютаДокумента = ТипЦены.ВалютаЦены;
	ОбъектДок.ТипЦен = ТипЦены;
	
	Если ЗначениеЗаполнено(ОбъектДок.ДоговорКонтрагента) И НЕ ВалютаУчета = ОбъектДок.ДоговорКонтрагента.ВалютаВзаиморасчетов Тогда
		ДанныеКурса = ПолучитьКурсВалюты(ОбъектДок.ДоговорКонтрагента.ВалютаВзаиморасчетов, ТекущаяДата());
		ОбъектДок.КурсВзаиморасчетов = ДанныеКурса.Курс;
		ОбъектДок.КратностьВзаиморасчетовт = ДанныеКурса.Кратность;
	Иначе
		ОбъектДок.КурсВзаиморасчетов = 1;
		ОбъектДок.КратностьВзаиморасчетов = 1;
	КонецЕсли;
		
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		
		// sk_190724 ОбщийМодуль = Вычислить("ПроцедурыНалоговогоУчета");
		ПроцедурыБУ = Вычислить("ПроцедурыБухгалтерскогоУчета");
		
		ОбъектДок.ВидОперации = ?(ОбъектДок.ВалютаДокумента = ВалютаУчета, Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомисия, Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Импорт);
		
		ОбъектДок.СтруктурноеПодразделение = ВыбНастройкиАгента.ПодразделениеОрганизации;
		
		ДокМенеджер.ЗаполнитьСчетаУчетаРасчетов(ОбъектДок);
		ДанныеОбъекта = Новый Структура("Дата, Организация, ВидОперации, УчитыватьКПН, УчитыватьНДС");
		ЗаполнитьЗначенияСвойств(ДанныеОбъекта, ОбъектДок);
	Иначе
		ОбъектДок.ПодразделениеОрганизации = ВыбНастройкиАгента.ПодразделениеОрганизации;
		ЗаполнениеСчетов = Вычислить("СчетаУчетаВДокументах");
		
		ИменаРеквизитов = Новый Соответствие;
		ИменаРеквизитов.Вставить("СчетУчетаРасчетовСКонтрагентом", Истина);
		ИменаРеквизитов.Вставить("СчетУчетаРасчетовПоАвансам",     Истина);
		ИменаРеквизитов.Вставить("СчетУчетаРасчетовПоТаре",        Истина);
		
		ЗаполнениеСчетов.ЗаполнитьРеквизиты(ОбъектДок, ИменаРеквизитов);
	КонецЕсли;
		
		Если Не ОбъектДок.ЭтоНовый() Тогда		
			ОбъектДок.Товары.Очистить();		
		КонецЕсли;
		
		//(( sk_190725
		УчитыватьНДС = УчитыватьНДС(ОбъектДок);
		//)) sk_190725
		
		ИдТЧТовары = НРег("A10221FA-5AC6-4E8C-80D8-D40D8DFC7779"); // идентификатор ТЧ "Товары" у Поступления в МТ 2.0
		
		ТекстXML.Прочитать();
		Если ТекстXML.Имя = "TABLES" И ТекстXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ТекстXML.Прочитать();
			Если НРег(СокрЛП(ТекстXML.ПолучитьАтрибут("GUID"))) = ИдТЧТовары Тогда
				Пока ТекстXML.Прочитать() Цикл
					Если ТекстXML.Имя = "TABLE" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
						ТекстXML.Пропустить();
						Прервать;
					КонецЕсли;
					Если ТекстXML.Имя = "ITEM" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
						Продолжить;
					КонецЕсли;
					
					стррАтрибуты = ПолучитьСтруктуруАтрибутовТЧПоступление(ТекстXML, УчитыватьНДС);
					
					НоваяСтрока = ОбъектДок.Товары.Добавить();
					
					Если ЭтоУпаковка(стррАтрибуты.ИдЕдиницыИзм) Тогда
						ПересчитатьИзУпаковок(стррАтрибуты.Количество, стррАтрибуты.Цена, стррАтрибуты.ИдЕдиницыИзм);
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стррАтрибуты);
					
					Если гКонфигурация = "Бухгалтерия_KZ" Тогда
						СведенияОНоменклатуре = ПроцедурыБУ.ПолучитьСчетаУчетаНоменклатуры(ОбъектДок.Организация, НоваяСтрока.Номенклатура, ТекущаяДата());
						ДокМенеджер.ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(ДанныеОбъекта, НоваяСтрока, "Товары", СведенияОНОменклатуре);
						ДокМенеджер.ЗаполнитьРеквизитыНалоговогоУчета(ОбъектДок, НоваяСтрока, "Товары");
					Иначе
						ДокМенеджер.ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(ОбъектДок, НоваяСтрока, "Товары");
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	
	Результат = ЗаписьДокумента(ОбъектДок, стррДокумент, ЭтоНовыйОбъект);
	
	Возврат Результат;
	
КонецФункции

//dm_180605 добавил загрузку документа ВозвратТоваровОтПокупателя
Процедура ЗагрузитьДокументВозврат(ТекстXML, ЗагружаемыеОбъекты, ОбъектДок, ЭтоНовыйОбъект) //dm_180605
	
	ОпределитьВерсиюКонфигурации();
	
	стррДокумент = ОбщиеРеквизитыДокумента();
	стррДокумент.ВидДокумента 	= "ВозвратТоваровОтПокупателя";
	стррДокумент.Номер 			= ТекстXML.ПолучитьАтрибут("DocNumberPrefix") + ТекстXML.ПолучитьАтрибут("DocNumber");
	стррДокумент.Дата 			= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("dt"));
	стррДокумент.ИдОрганизации 	= ТекстXML.ПолучитьАтрибут("A01");
	стррДокумент.ИдКлиента		= ТекстXML.ПолучитьАтрибут("A02");
	стррДокумент.ИдСоглашения	= ТекстXML.ПолучитьАтрибут("A04");
	стррДокумент.СуммаДокумента = Число(ТекстXML.ПолучитьАтрибут("A07"));
	стррДокумент.Комментарий 	= ТекстXML.ПолучитьАтрибут("A09");
	стррДокумент.ИдКатегории 	= ТекстXML.ПолучитьАтрибут("A010");
	
	стррДокумент.Широта 		= ТекстXML.ПолучитьАтрибут("A013");
	стррДокумент.Долгота 		= ТекстXML.ПолучитьАтрибут("A014");
	стррДокумент.ДатаНачала 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A017"));
	стррДокумент.ДатаОкончания 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A018"));
	
	СкладПолучатель	 = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A016"), "Склады");
	ТипЦены			 = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A06"), "ТипыЦенНоменклатуры");
	ИдДокОснования = ТекстXML.ПолучитьАтрибут("A011");
	ВалютаУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ДокМенеджер = Документы.ВозвратТоваровОтПокупателя;
	ПредставлениеДокВМУ = стррДокумент.ВидДокумента + " № " + стррДокумент.Номер + " от " + стррДокумент.Дата;
	
	Если ЗначениеЗаполнено(ИдДокОснования) Тогда
		ЕстьОснование = Истина;
	Иначе
		Текст = "В документе """ + ПредставлениеДокВМУ + """ не указан документ-основание! Документ не будет проведен. Перед проведением установите документ-основание.";
		ОповеститьОСобытии(Текст, "ОшибкаЗапись", ОбъектДок.Ссылка, "ТекущийАгент");
	    ЕстьОснование = Ложь;
	КонецЕсли;
	
	Если гКонфигурация = "Бухгалтерия_KZ" И ЕстьОснование Тогда
		ТекстXML.Пропустить();
	КонецЕсли;
	
	ОбъектДок.Заполнить(Неопределено);
	стррОбязательныеПоля = Новый Структура("Организация, Контрагент, ДоговорКонтрагента");
	ЗаполнитьОсновныеПараметрыДокумента(ОбъектДок, стррДокумент, ДокМенеджер, стррОбязательныеПоля);
	//dm В вышеуказанной /\ процедуре в документе ПоступлениеТоваровУслуг заполнились реквизиты:
	// - Организация
	// - Контрагент
	// - ДоговорКонтрагента
	// - Ответственный
	// - Комментарий
	// - Дата
	// - Номер
	// - СуммаДокумента
	// - Автор
	
	Если НЕ ЗначениеЗаполнено(СкладПолучатель) Тогда
		Текст = "В документе """ + ПредставлениеДокВМУ + """ не указан склад-получатель!";
		ОповеститьОСобытии(Текст, "ОшибкаЗапись", ОбъектДок.Ссылка, "ТекущийАгент");
	Иначе 
		ОбъектДок.Склад = СкладПолучатель;
	КонецЕсли;
	
	ОбъектДок.ТипЦен = ТипЦены;
	ОбъектДок.ВалютаДокумента = ТипЦены.ВалютаЦены;
	
	Если ЗначениеЗаполнено(ОбъектДок.ДоговорКонтрагента) И НЕ ВалютаУчета = ОбъектДок.ДоговорКонтрагента.ВалютаВзаиморасчетов Тогда
		ДанныеКурса = ПолучитьКурсВалюты(ОбъектДок.ДоговорКонтрагента.ВалютаВзаиморасчетов, ТекущаяДата());
		ОбъектДок.КурсВзаиморасчетов = ДанныеКурса.Курс;
		ОбъектДок.КратностьВзаиморасчетовт = ДанныеКурса.Кратность;
	Иначе
		ОбъектДок.КурсВзаиморасчетов = 1;
		ОбъектДок.КратностьВзаиморасчетов = 1;
	КонецЕсли;
	
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		
		ПроцедурыБУ = Вычислить("ПроцедурыБухгалтерскогоУчета");
		
		ОбъектДок.СтруктурноеПодразделение = ВыбНастройкиАгента.ПодразделениеОрганизации;
		
		
		ДокМенеджер.ЗаполнитьСчетаУчетаРасчетов(ОбъектДок);
		
	Иначе
		ОбъектДок.ПодразделениеОрганизации = ВыбНастройкиАгента.ПодразделениеОрганизации;
		ЗаполнениеСчетов = Вычислить("СчетаУчетаВДокументах");
		
		ИменаРеквизитов = Новый Соответствие;
		ИменаРеквизитов.Вставить("СчетУчетаРасчетовСКонтрагентом", Истина);
		ИменаРеквизитов.Вставить("СчетУчетаРасчетовПоАвансам",     Истина);
		ИменаРеквизитов.Вставить("СчетУчетаРасчетовПоТаре",        Истина);
		ИменаРеквизитов.Вставить("СчетУчетаНДС", 			       Истина);
		
		ЗаполнениеСчетов.ЗаполнитьРеквизиты(ОбъектДок, ИменаРеквизитов);
	КонецЕсли;
		
		
		ИдТЧТовары = НРег("235DC1EA-5963-4DCD-95E1-E8CEF487A2AE"); // идентификатор ТЧ "Товары" у Возврата в МТ 2.0
		
		ТекстXML.Прочитать();
		Если ТекстXML.Имя = "TABLES" И ТекстXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ТекстXML.Прочитать();
			Если НРег(СокрЛП(ТекстXML.ПолучитьАтрибут("GUID"))) = ИдТЧТовары Тогда
				Пока ТекстXML.Прочитать() Цикл
					Если ТекстXML.Имя = "TABLE" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
						ТекстXML.Пропустить();
						Прервать;
					КонецЕсли;
					Если ТекстXML.Имя = "ITEM" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
						Продолжить;
					КонецЕсли;
		
					стррАтрибуты = ПолучитьСтруктуруАтрибутовТЧВозврат(ТекстXML);
					
					НоваяСтрока = ОбъектДок.Товары.Добавить();
					
					Если ЭтоУпаковка(стррАтрибуты.ИдЕдиницыИзм) Тогда
						ПересчитатьИзУпаковок(стррАтрибуты.Количество, стррАтрибуты.Цена, стррАтрибуты.ИдЕдиницыИзм);
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, стррАтрибуты);
					
					Если гКонфигурация = "Бухгалтерия_KZ" Тогда
						ДокМенеджер.ЗаполнитьРеквизитыНалоговогоУчета(ОбъектДок, НоваяСтрока, "Товары");
						СчетаУчета = ПроцедурыБУ.ПолучитьСчетаУчетаНоменклатуры(ОбъектДок.Организация, НоваяСтрока.Номенклатура, ОбъектДок.Дата);
						ДокМенеджер.ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(ОбъектДок, НоваяСтрока, "Товары", СчетаУчета);
					Иначе
						ДокМенеджер.ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(ОбъектДок, НоваяСтрока, "Товары");
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	тзДокументыВозврат  	= ЗагружаемыеОбъекты.тзДокументыВозврат;
	НоваяЗапись = тзДокументыВозврат.Добавить();
	НоваяЗапись.Документ 		= ОбъектДок;
	НоваяЗапись.стррДокумент 	= стррДокумент;
	НоваяЗапись.ЭтоНовыйОбъект 	= ЭтоНовыйОбъект;
	НоваяЗапись.ИдОснования 	= ИдДокОснования;
	ЗагружаемыеОбъекты.тзДокументыВозврат = тзДокументыВозврат;
	
КонецПроцедуры

//dm_180531 Изменил процедуру загрузки
Процедура ЗагрузитьДокументКассовыйОрдер(ТекстXML, ЗагружаемыеОбъекты, ОбъектДок, ЭтоНовыйОбъект)
	
	стррДокумент = ОбщиеРеквизитыДокумента();
	стррДокумент.ВидДокумента 	= "Касса";
	стррДокумент.Номер 			= ТекстXML.ПолучитьАтрибут("DocNumberPrefix") + ТекстXML.ПолучитьАтрибут("DocNumber");
	стррДокумент.Дата			= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("dt"));
	стррДокумент.ИдОрганизации	= ТекстXML.ПолучитьАтрибут("A01");
	стррДокумент.ИдКлиента		= ТекстXML.ПолучитьАтрибут("A02");
	стррДокумент.ИдСоглашения 	= ТекстXML.ПолучитьАтрибут("A04");
	стррДокумент.Комментарий 	= ТекстXML.ПолучитьАтрибут("A06");
	стррДокумент.СуммаДокумента = Число(ТекстXML.ПолучитьАтрибут("A07"));
	стррДокумент.ИдКатегории 	= ТекстXML.ПолучитьАтрибут("A011");
	стррДокумент.Широта 		= ТекстXML.ПолучитьАтрибут("A012");
	стррДокумент.Долгота 		= ТекстXML.ПолучитьАтрибут("A013");
	стррДокумент.ДатаНачала 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A014"));
	стррДокумент.ДатаОкончания 	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A015"));

	ИдДокОснования	= ТекстXML.ПолучитьАтрибут("A09");
	ВидОплаты 		= ТекстXML.ПолучитьАтрибут("A016");
	ПометкаУдаления = Булево(Число(ТекстXML.ПолучитьАтрибут("IsDeleted")));
	Подразделение = ВыбНастройкиАгента.ПодразделениеОрганизации;
		
	Если гКонфигурация = "Бухгалтерия_RU" Тогда
		
		ОбъектДок.Заполнить(Неопределено);
		ИмяОбъекта = ОбъектДок.Ссылка.Метаданные().Имя;
		
		ДокМенеджер = Документы[ИмяОбъекта];
		
		стррОбязательныеПоля = Новый Структура("Организация, Контрагент, ДоговорКонтрагента");
		ЗаполнитьОсновныеПараметрыДокумента(ОбъектДок, стррДокумент, ДокМенеджер, стррОбязательныеПоля);
		
		ОбщийМодуль = Вычислить("УчетнаяПолитика");
		
		Если ТипЗнч(ОбъектДок.Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
			ОбъектДок.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя;  
		Иначе
			ДокМенеджер = Документы.РасходныйКассовыйОрдер; //dm_180531 Вид операции для РКО будем заполнять при записи в базу
			ОбъектДок.Налог = Справочники.ВидыНалоговИПлатежейВБюджет.ПустаяСсылка();
		КонецЕсли;
		
		ОбъектДок.ПодразделениеОрганизации = ВыбНастройкиАгента.ПодразделениеОрганизации;
		
		ОбъектДок.СчетКасса = ПланыСчетов.Хозрасчетный.НайтиПоКоду("50.01");
		
		Если ТипЗнч(ОбъектДок.Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
			ОбъектДок.ПринятоОт = ОбъектДок.Контрагент.Наименование;
			Попытка
				ОбъектДок.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателя;	
			Исключение
				ОбъектДок.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
			КонецПопытки;
		Иначе
			ОбъектДок.Выдать = ОбъектДок.Контрагент.Наименование;
			ОбъектДок.СчетКонтрагента = ОбъектДок.Контрагент.ОсновнойБанковскийСчет;
			ОбъектДок.СчетОрганизации = ОбъектДок.Организация.ОсновнойБанковскийСчет;
		КонецЕсли;
		
		Если ОбщийМодуль.ПлательщикНДС(ОбъектДок.Организация, ТекущаяДата()) Тогда
			ОбъектДок.СтавкаНДС = ПолучитьСтавкуНДСДляОрдера();
		Иначе
			ОбъектДок.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		КонецЕсли;
	
	КонецЕсли;

	//Добавление обьекта в виртуальную ТЗ для дальнейшего добавления в док ПриходныйКассовыйОрдер, это нужно для того что бы ПриходныйКассовыйОрдер небыл создан без документа основания (ПКО создается только на основании документов), то есть без НоваяЗапись.ИдОснования 
	тзКассовыеДокументы  	= ЗагружаемыеОбъекты.тзКассовыеДокументы;
	НоваяЗапись = тзКассовыеДокументы.Добавить();
	НоваяЗапись.Документ 		= ОбъектДок;
	НоваяЗапись.стррДокумент 	= стррДокумент;
	НоваяЗапись.ЭтоНовыйОбъект 	= ЭтоНовыйОбъект;
	НоваяЗапись.ИдОснования 	= ИдДокОснования;
	ЗагружаемыеОбъекты.тзКассовыеДокументы = тзКассовыеДокументы;

КонецПроцедуры

//dm_180622: Новая функция
Функция ЗагрузитьДокументМерчендайзинг(ТекстXML, ОбъектДок, ЗагружаемыеОбъекты, ЭтоНовыйОбъект)

	стррДокумент = ОбщиеРеквизитыДокумента();
	стррДокумент.ВидДокумента	= "Мерчендайзинг";
	стррДокумент.Номер 			= ТекстXML.ПолучитьАтрибут("DocNumberPrefix") + ТекстXML.ПолучитьАтрибут("DocNumber");
	стррДокумент.Дата 			= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("dt"));
	стррДокумент.ИдОрганизации 	= ТекстXML.ПолучитьАтрибут("A01");
	стррДокумент.ИдКлиента	 	= ТекстXML.ПолучитьАтрибут("A02");	
	стррДокумент.СуммаДокумента = Число(ТекстXML.ПолучитьАтрибут("A06"));
	стррДокумент.Комментарий   	= ТекстXML.ПолучитьАтрибут("A07");		
	стррДокумент.ИдКатегории 	= ТекстXML.ПолучитьАтрибут("A08");
	стррДокумент.Широта	     	= ТекстXML.ПолучитьАтрибут("A09");
	стррДокумент.Долгота	    = ТекстXML.ПолучитьАтрибут("A010");			
	стррДокумент.ДатаНачала	= ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A013"));
	стррДокумент.ДатаОкончания = ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("A014"));
	
	ВидЦены	        			= СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A05"), "ТипыЦенНоменклатуры");	
	
	ОбъектДок.ДокументОснование = СсылкаИзДокументаПоСпискуВидов(ТекстXML.ПолучитьАтрибут("A011"), "СчетНаОплатуПокупателю,РеализацияТоваровУслуг");
	
	ОбъектДок.Менеджер = ВыбНастройкиАгента.Пользователь;

	стррОбязательныеПоля = Новый Структура("Организация, Контрагент");		
	ЗаполнитьОсновныеПараметрыДокумента(ОбъектДок, стррДокумент,, стррОбязательныеПоля);
	ЗаполнитьЗначенияСвойств(ОбъектДок, стррДокумент, "ДатаНачала,ДатаОкончания,Широта,Долгота");
	
	ИдТЧТовары = НРег("a9c8662f-9554-4deb-a78a-fb66dc757060"); // идентификатор ТЧ "Товары" у Мерчендайзинга в МТ 2.0
	
	тзТовары = ОбъектДок.Товары;
	Если НЕ ЭтоНовыйОбъект Тогда
		тзТовары.Очистить();
	КонецЕсли;

	ТекстXML.Прочитать();
	Если ТекстXML.Имя = "TABLES" И ТекстXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		ТекстXML.Прочитать();
		Если НРег(СокрЛП(ТекстXML.ПолучитьАтрибут("GUID"))) = ИдТЧТовары Тогда
			Пока ТекстXML.Прочитать() Цикл
				
				Если ТекстXML.Имя = "TABLE" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					ТекстXML.Пропустить();
					Прервать;
				КонецЕсли;
				
				Если ТекстXML.Имя = "ITEM" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					Продолжить;
				КонецЕсли;
				
				ИдНоменклатуры   = ТекстXML.ПолучитьАтрибут("A01");
				ИдХарактеристики = ТекстXML.ПолучитьАтрибут("A02");
				ИдЕдиницыИзм	 = Новый УникальныйИдентификатор(НРег(ТекстXML.ПолучитьАтрибут("A03")));
				Количество		 = ТекстXML.ПолучитьАтрибут("A04");
				Цена			 = ТекстXML.ПолучитьАтрибут("A05");
				Сумма			 = ТекстXML.ПолучитьАтрибут("A07");
				ДоляПолки		 = ТекстXML.ПолучитьАтрибут("A09");
				КоличествоФейсов = ТекстXML.ПолучитьАтрибут("A010");
				
				СтрокаТ = тзТовары.Добавить();
				
				ТекНоменклатура  	= СсылкаИзСправочника(ИдНоменклатуры, "Номенклатура");
				ЕИНоменклатуры = ?(гКонфигурация = "Бухгалтерия_RU", ТекНоменклатура.ЕдиницаИзмерения, ТекНоменклатура.БазоваяЕдиницаИзмерения);
				Если ЭтоУпаковка(ИдЕдиницыИзм) Тогда
					СтрокаУп = гтзУпаковки.Найти(ИдЕдиницыИзм, "УникальныйИдентификатор");
					стррУпаковка = Новый Структура;
					Для Каждого Колонка Из гтзУпаковки.Колонки Цикл
						стррУпаковка.Вставить(Колонка.Имя);
					КонецЦикла;
					ЗаполнитьЗначенияСвойств(стррУпаковка,СтрокаУп);
					НаименованиеУп = стррУпаковка.Наименование + " (1 " + стррУпаковка.Наименование + " = " + Строка(стррУпаковка.Коэффициент) + " " + стррУпаковка.ЕдиницаИзмеренияНоменклатуры.Наименование + ")";
					ЗначУпак = 0;
				Иначе	
					стррУпаковка = ЕИНоменклатуры;
					НаименованиеУп = ЕИНоменклатуры.Наименование;
					ЗначУпак = 1;
				КонецЕсли;
				
				СтрокаТ.Номенклатура		= ТекНоменклатура;
				СтрокаТ.Упаковка			= стррУпаковка;				
				СтрокаТ.УпаковкаНаименование = НаименованиеУп;
				СтрокаТ.ЗначУпак = ЗначУпак;
				СтрокаТ.Количество  = Число(Количество);
				СтрокаТ.Цена      			= Число(Цена);
				СтрокаТ.Сумма     			= Число(Сумма);
				СтрокаТ.ДоляПолки		 	= Число(ДоляПолки);
				СтрокаТ.КоличествоФейсов 	= Число(КоличествоФейсов);
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Результат = ЗаписьВиртуальногоДокумента(ОбъектДок,стррДокумент, ЭтоНовыйОбъект); //ЗаписьВиртуальногоДокумента(стррДокумент, стррЗначения, ОбъектДок, ЗагружаемыеОбъекты);
	
	Возврат Результат;

КонецФункции

Процедура УстановитьБанковскийСчетВКассовомОрдере(ДокументОбъект)
	
	//++Дейнеко ВГ 2017-09-15 Бухгалтерия
	ДокументОбъект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ДокументОбъект.Организация, Неопределено);
	//--Дейнеко ВГ 2017-09-15 Бухгалтерия
	
КонецПроцедуры

Процедура УстановитьРеквизитыДляКонтрагентаВКассовомОрдере(ДокументОбъект)

	СтррРеквизиты = Справочники.Контрагенты.РеквизитыКонтрагента(ДокументОбъект.Контрагент);
	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		ДокументОбъект.ПринятоОт = СтррРеквизиты.Наименование;
		ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента;
		ДокументОбъект.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
	Иначе
		ДокументОбъект.Выдать = СтррРеквизиты.Наименование;
		ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
		ДокументОбъект.СтатьяДвиженияДенежныхСредств =  Справочники.СтатьиДвиженияДенежныхСредств.ВозвратОплатыКлиенту;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьКассуВКассовомОрдере(ДокументОбъект)

	Валюта = КонстантыПолучитьЗначение("ВалютаРегламентированногоУчета");
	Выборка = Справочники.Кассы.Выбрать( , ДокументОбъект.Организация);
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.ПометкаУдаления И Выборка.ВалютаДенежныхСредств = Валюта Тогда
			ДокументОбъект.Касса = Выборка.Ссылка;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если Не ЗначениеЗаполнено(ДокументОбъект.Касса) Тогда
		Текст = "Не найдено ни одной кассы для организации """ + ДокументОбъект.Организация + """. Выберите кассу в документе вручную!";
		ОповеститьОСобытии(Текст,, ДокументОбъект.Ссылка);
	КонецЕсли;

КонецПроцедуры

//Дейнеко ВГ 2017-09-26//dm_04.10.17:Внесены изменения
Процедура ЗаполнитьОсновныеПараметрыДокумента(Док, СтруктураДокументаВМУ, Менеджер, СтруктураПолей)

	ИдФирмы 	 = СтруктураДокументаВМУ.ИдОрганизации;
	ИдКлиента 	 = СтруктураДокументаВМУ.ИдКлиента;
	ИдСоглашения = СтруктураДокументаВМУ.ИдСоглашения;
	ВидДок 		 = СтруктураДокументаВМУ.ВидДокумента;
	НомерДок 	 = Строка(СтруктураДокументаВМУ.Номер);
	ДатаДок 	 = СтруктураДокументаВМУ.Дата;
	Комментарий  = СтруктураДокументаВМУ.Комментарий;
	
	Если Менеджер = Неопределено Тогда // виртуальный документ
	    РеквизитыДок = гВДокРеквизиты.Получить("*" + ВидДок); 
		ПредставлениеДокВМУ = ВидДок + " № " + НомерДок + " от " + ДатаДок;
	Иначе // обычный документ
		РеквизитыДок = Док.Метаданные().Реквизиты;
		ПредставлениеДокВМУ = Док.Метаданные().Синоним + " № " + НомерДок + " от " + ДатаДок;		
	КонецЕсли; 

	Если СтруктураПолей.Свойство("Организация") Тогда
		Если ЭтоПустойИдентификатор(ИдФирмы) Тогда
			Текст = "В документе """ + ПредставлениеДокВМУ + """ не указана организация!";
			ОповеститьОСобытии(Текст, "ОшибкаЗапись", Док.Ссылка, "ТекущийАгент");
		Иначе
			Организация = СсылкаИзСправочника(ИдФирмы, "Организации");
			Если РеквизитыДок.Найти("Организация") <> Неопределено Тогда
				Док.Организация = Организация;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
//++Дейнеко ВГ 2017-09-26 Бухгалтерия
	
	Если СтруктураПолей.Свойство("Контрагент") И РеквизитыДок.Найти("Контрагент") <> Неопределено Тогда
		Если ЭтоПустойИдентификатор(ИдКлиента) Тогда
			Текст = "В документе """ + ПредставлениеДокВМУ + """ не указан контрагент!";
			ОповеститьОСобытии(Текст, "ОшибкаЗапись", Док.Ссылка, "ТекущийАгент");
		Иначе
			Контрагент = СсылкаИзСправочника(ИдКлиента, "Контрагенты");
			Док.Контрагент = Контрагент;
		КонецЕсли;
	КонецЕсли;
	
	//dm_04.10.17:Замена
	Если СтруктураПолей.Свойство("ДоговорКонтрагента") И ИспользоватьСоглашения Тогда
		Если ЭтоПустойИдентификатор(ИдСоглашения) Тогда
			Текст = "В документе """ + ПредставлениеДокВМУ + """ не указан договор!";
			ОповеститьОСобытии(Текст, "ОшибкаЗапись", Док.Ссылка, "ТекущийАгент");
			//{{dm_180531
			Если РеквизитыДок.Найти("ДоговорКонтрагента") <> Неопределено Тогда
				Док.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			КонецЕсли;
			//}}dm_180531
		Иначе
			Если РеквизитыДок.Найти("ДоговорКонтрагента") <> Неопределено Тогда
				Док.ДоговорКонтрагента = СсылкаИзСправочника(ИдСоглашения, "ДоговорыКонтрагентов");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
//--Дейнеко ВГ 2017-09-26 Бухгалтерия

	Если РеквизитыДок.Найти("Ответственный") <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(Док.Ответственный) Тогда
			Док.Ответственный = ВыбНастройкиАгента.Пользователь;
		//{{dm_180426
		ИначеЕсли НЕ Док.Ответственный = ВыбНастройкиАгента.Пользователь Тогда
			Док.Ответственный = ВыбНастройкиАгента.Пользователь;
		//}}dm_180426
		КонецЕсли;
	КонецЕсли;
	
	//{{dm_180428
	Если РеквизитыДок.Найти("Автор") <> Неопределено Тогда
		Док.Автор = Пользователи.ТекущийПользователь(); //ВыбНастройкиАгента.Пользователь;
	КонецЕсли;
	//}}dm_180428

	Если РеквизитыДок.Найти("Комментарий") <> Неопределено Тогда
		Док.Комментарий = Комментарий;
	КонецЕсли;

	Док.Дата = ДатаДок;
	
	Если ЗначениеЗаполнено(НомерДок) Тогда 
		Если Менеджер = Неопределено Тогда
			Док.Номер = НомерДок;
		Иначе
			Если НЕ (ИспользоватьНумерациюЦБД ИЛИ Док.Метаданные().КонтрольУникальности) ИЛИ Менеджер.НайтиПоНомеру(НомерДок, ТекущаяДата()) = Менеджер.ПустаяСсылка() Тогда
				Док.Номер = НомерДок;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	

	Если СтруктураДокументаВМУ.Свойство("СуммаДокумента") Тогда
		Если РеквизитыДок.Найти("СуммаДокумента") <> Неопределено Тогда
			Док.СуммаДокумента = СтруктураДокументаВМУ.СуммаДокумента;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

// Функция загружает документ из XML-файла в БД 1С:Предприятия.
// Параметры:
//		ТекстXML - ЧтениеXML - объект ЧтениеXML
//		ЗагружаемыеОбъекты - Структура - структура для запоминания загруженных объектов (используется для выгрузки подтверждений).
//		ВидДокумента - Строка - вид документа в 1С:Предприятии
//		ИдВидДокументаМТ - УникальныйИдентификатор - идентификатор вида документа в МТ
// Возвращаемое значение:
// 		Булево - Истина - если документ успешно записан в БД, иначе Ложь.
//  
Функция ЗагрузитьДокумент(ТекстXML, ЗагружаемыеОбъекты, ВидДокумента, ИдВидДокументаМТ)

	Если ТекстXML.Имя = "ITEM" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		Возврат Ложь;
	ИначеЕсли ТекстXML.Имя = "ELEMENTS" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Проведен 	= Булево(Число(ТекстXML.ЗначениеАтрибута("IsPost")));
	Дата 		= Строка(ДатаВремяXMLВФормат1С(ТекстXML.ПолучитьАтрибут("dt")));
	Номер 		= СокрЛП(ТекстXML.ПолучитьАтрибут("DocNumberPrefix")) + СокрЛП(ТекстXML.ПолучитьАтрибут("DocNumber"));
	
	ПропускДокумента = Ложь;
	
	Если ВидДокумента = "*Мерчендайзинг" Тогда
		Виртуальный = Истина;
		стрРеквизиты = ВДокРеквизитыШапки(ВидДокумента);
		ПредставлениеДок = "Мерчендайзинг";
		ЭтоНовыйОбъект = Истина;
		ИдОбъекта = Новый УникальныйИдентификатор(ТекстXML.ЗначениеАтрибута("GUID"));
		ОбъектДок = ПолучитьОбъектИзХранилища("ДокМерч", ИдОбъекта);
		Если ОбъектДок = Неопределено Тогда
			ОбъектДок = Новый Структура(стрРеквизиты);
			ВДокРеквизитыТЧДобавить(ВидДокумента, ОбъектДок);
			ОбъектДок.ID = ИдОбъекта;
			ОбъектДок.Проведен = Проведен;
		Иначе
			Если Не ОбновлятьДокументыПриЗагрузке Тогда
				стррПараметры = Новый Структура("ВидДокумента,Номер,Дата,СсылкаНаОбъект", ПредставлениеДок, Номер, Дата, Неопределено);
				СообщитьОПропускеДокумента(стррПараметры);
				ТекстXML.Пропустить();
				ПропускДокумента = Истина;
				Результат = Истина;
			КонецЕсли;
		    ЭтоНовыйОбъект = Ложь;
		КонецЕсли;
		Если гВДокРеквизиты = Неопределено Тогда
			гВДокРеквизиты = Новый Соответствие;
		КонецЕсли; 
		Если гВДокРеквизиты.Получить(ВидДокумента) = Неопределено Тогда
			гВДокРеквизиты.Вставить(ВидДокумента, СтрРазделить_(стрРеквизиты)); // аналог "Метаданные().Реквизиты" для виртуальных документов
		КонецЕсли; 
	ИначеЕсли ВидДокумента = "*Посещение" Или ВидДокумента = "*ВнеплановыйМаршрут" Тогда // sd_20082017 добавил документ ВнеплановыйМаршрут.
		Текст = СтрШаблон_("Пропущена загрузка документа %1 N %2 от %3. Данный вид документов не поддерживается.", ВидДокумента, Номер, Дата); //dm_180528
		ОповеститьОСобытии(Текст); 
		ТекстXML.Пропустить();
		Возврат Истина;
	Иначе
		Виртуальный = Ложь;
		
		//++Дейнеко ВГ 2017-09-22 Бухгалтерия
		//В бух30 ЗаказКлиента это СчетНаОплатуПокупателю
		//{{dm_180426
		Если ВидДокумента = "СчетНаОплатуПокупателю" Тогда
			
			ДокМенеджер = Документы["СчетНаОплатуПокупателю"];
		Иначе
			ДокМенеджер = Документы[ВидДокумента];
		КонецЕсли;
		//++Дейнеко ВГ 2017-09-22 Бухгалтерия
		//}}dm_180426	
		ПредставлениеДок = ДокМенеджер.ПустаяСсылка().Метаданные().Синоним;
		
		Если Не Проведен Тогда
			Текст = "Пропущена загрузка документа """ + ПредставлениеДок + " N " + Номер + " от " + Дата + """. Документ не проведен в мобильном приложении!";
			ОповеститьОСобытии(Текст); 
			ТекстXML.Пропустить();
			Возврат Истина;
		КонецЕсли;

		ЭтоНовыйОбъект = Истина;
		ИдОбъекта = Новый УникальныйИдентификатор(ТекстXML.ЗначениеАтрибута("GUID"));
		
		СсылкаОбъекта = ДокМенеджер.ПолучитьСсылку(ИдОбъекта);
		ОбъектДок = СсылкаОбъекта.ПолучитьОбъект();
		
		//{{dm_180426
		Если ОбъектДок = Неопределено И ВидДокумента = "СчетНаОплатуПокупателю" Тогда // заказ не нашли, пытаемся найти заказ среди реализаций
		//}}dm_180426	
			ОбъектДок = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(ИдОбъекта).ПолучитьОбъект();
		КонецЕсли;
		
		ПропускДокумента = Ложь;
		
		Если ОбъектДок = Неопределено Тогда // загружаем новый документ
			//{{dm_180426
			Если ВидДокумента = "СчетНаОплатуПокупателю" Тогда
			//}}dm_180426	
				Если РежимЗагрузкиЗаказов = "ЗагружатьКакРеализацию" Тогда  // "Заказ" должны загрузить как "Реализацию"
					ДокМенеджер   = Документы.РеализацияТоваровУслуг;
					СсылкаОбъекта = ДокМенеджер.ПолучитьСсылку(ИдОбъекта); // заново устанавливаем ссылку из нового менеджера документов
				КонецЕсли;
			КонецЕсли;
			ОбъектДок = ДокМенеджер.СоздатьДокумент();
			ОбъектДок.УстановитьСсылкуНового(СсылкаОбъекта);
			ЭтоНовыйОбъект = Истина;
		Иначе
			Если Не ОбновлятьДокументыПриЗагрузке Тогда
				стррПараметры = Новый Структура("ВидДокумента,Номер,Дата,СсылкаНаОбъект", ПредставлениеДок, Номер, Дата, ОбъектДок.Ссылка);
				СообщитьОПропускеДокумента(стррПараметры);
				ТекстXML.Пропустить();
				ПропускДокумента = Истина;
				Результат = Истина;
			КонецЕсли;
			ОбъектДок.Разблокировать();
			ЭтоНовыйОбъект = Ложь;
		КонецЕсли;
		
	КонецЕсли;

	Если Не ПропускДокумента Тогда
		
		Если ТекстXML.Имя = "ITEM" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Возврат Ложь;
		ИначеЕсли ТекстXML.Имя = "ELEMENTS" И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Возврат Ложь;
		КонецЕсли;

		//{{dm_180426
		Если ВидДокумента = "СчетНаОплатуПокупателю" Тогда
		//}}dm_180426
			//{{dm_180515
			Если РежимЗагрузкиЗаказов = "ЗагружатьКакРеализацию" Тогда
				Результат = ЗагрузитьДокументРеализацияДляБух30(ТекстXML, ОбъектДок, ЭтоНовыйОбъект, Истина);
			Иначе
				Результат = ЗагрузитьДокументЗаказДляБух30(ТекстXML, ОбъектДок, ЭтоНовыйОбъект);
			КонецЕсли;
			//}}dm_180515
		ИначеЕсли ВидДокумента = "ПриходныйКассовыйОрдер" Или ВидДокумента = "РасходныйКассовыйОрдер" Тогда
			ЗагрузитьДокументКассовыйОрдер(ТекстXML, ЗагружаемыеОбъекты, ОбъектДок, ЭтоНовыйОбъект); //!!!! переделать - загрузка сделана сначала в ТЗ, можно сразу грузить в БД!!!!
			Результат = Истина; // !!!! убрать после переделки
		ИначеЕсли ВидДокумента = "РеализацияТоваровУслуг" Тогда 
			//{{dm_180428
			Результат = ЗагрузитьДокументРеализацияДляБух30(ТекстXML, ОбъектДок, ЭтоНовыйОбъект);
			//}}dm_180428
		ИначеЕсли ВидДокумента = "ПеремещениеТоваров" Тогда // sd_22082017
			Результат = ЗагрузитьДокументПеремещение(ТекстXML, ОбъектДок, ЭтоНовыйОбъект);
		ИначеЕсли ВидДокумента = "ПоступлениеТоваровУслуг" Тогда //dm_180601
			Результат = ЗагрузитьДокументПоступление(ТекстXML, ОбъектДок, ЭтоНовыйОбъект);
		ИначеЕсли ВидДокумента = "ВозвратТоваровОтПокупателя" Тогда //dm_180605
			ЗагрузитьДокументВозврат(ТекстXML, ЗагружаемыеОбъекты, ОбъектДок, ЭтоНовыйОбъект);
			Результат = Истина;
		ИначеЕсли ВидДокумента = "*Мерчендайзинг" Тогда
			Результат = ЗагрузитьДокументМерчендайзинг(ТекстXML, ОбъектДок, ЗагружаемыеОбъекты, ЭтоНовыйОбъект);
		Иначе
			Текст = "Пропущена загрузка документа ""%1(%2) № %3 от %4"". Загрузка таких документов не предусмотрена!";
			ОповеститьОСобытии(СтрШаблон_(Текст, ПредставлениеДок, ВидДокумента, Номер, Дата)); 
			ТекстXML.Пропустить();
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат Тогда
		
		СтрокаТ = ЗагружаемыеОбъекты.ТЗЗагруженныеДокументы.Добавить();
		СтрокаТ.Идентификатор 	 = ИдОбъекта; // идентификатор (GUID) документа
		СтрокаТ.ВидДокумента  	 = ?(Виртуальный, ВидДокумента, ОбъектДок.Метаданные().Имя);
		СтрокаТ.ИдВидДокументаМТ = ИдВидДокументаМТ; // идентификатор (GUID) вида документа в МТ
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ОбщиеРеквизитыДокумента()
	
	Реквизиты = "ВидДокумента,Номер,Дата,ИдОрганизации,ИдКлиента,ИдСоглашения,СуммаДокумента,Комментарий," // основные реквизиты
		+ "Широта,Долгота,ДатаНачала,ДатаОкончания,ИдКатегории" // дополнительные реквизиты
		+ ?(ИспользоватьПунктыРазгрузки, ",ИдПунктаРазгрузки", "");
	
	Возврат Новый Структура(Реквизиты);
	
КонецФункции

Функция ДатаВремяXMLВФормат1С(ДатаВремя) Экспорт

	СимвРазделителяА15 = " ";
	СимвРазделителяМТ  = "T";

	Поз = Найти(ДатаВремя, "-");
	Если Поз <> 0 Тогда	 
		Год = Число(Лев(ДатаВремя,  Поз - 1));
		Месяц = Число(Сред(ДатаВремя, Поз + 1,2));
		День = Число(Сред(ДатаВремя, Поз + 4,2));
	Иначе
		Возврат '00010101';
	КонецЕсли;

	ПозПробела = Найти(ДатаВремя, СимвРазделителяА15);
	Часы = 0;
	Минуты = 0;
	Секунды = 0;
	Если ПозПробела = 0 Тогда
		ПозПробела = Найти(ДатаВремя, СимвРазделителяМТ);
	КонецЕсли;

	Если ПозПробела > 0 Тогда
		Часы    = Число(Сред(ДатаВремя, ПозПробела + 1, 2));
		Минуты  = Число(Сред(ДатаВремя, ПозПробела + 4, 2));
		Секунды = Число(Сред(ДатаВремя, ПозПробела + 7, 2));
	КонецЕсли;

	Возврат Дата(Год, Месяц, День, Часы, Минуты, Секунды);
	
КонецФункции

// sk_190724 Процедура добавлена
// Выполняет заполнение признака налогооблажения НДС по документу 
//
// Параметры:
//	ОбъектДок 	 - ДокументОбъект - объект документа
//	УчитыватьНДС - Булево - признак учета НДС
//
Процедура ЗаполнитьНалогооблажениеНДСДокумента(ОбъектДок, УчитыватьНДС)
		
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		ОбъектДок.УчитыватьНДС = УчитыватьНДС;
	Иначе
		ОбъектДок.ДокументБезНДС = Не УчитыватьНДС;
	КонецЕсли;
		
КонецПроцедуры

// sk_190725 Функция добавлена
// Возвращает признак учета НДС по документу
//
// Параметры:
//	ОбъектДок 	 - ДокументОбъект - объект документа
//
// Возвращаемое значение:
//	УчитыватьНДС - Булево - признак учета НДС
//
Функция УчитыватьНДС(ОбъектДок)

	УчитыватьНДС = Ложь;
	
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда	
		ОбщийМодуль = Вычислить("ПроцедурыНалоговогоУчета");
		УчитыватьНДС = ОбщийМодуль.ПолучитьПризнакПлательщикаНДС(ОбъектДок.Организация, ТекущаяДата());
	Иначе
		ОбщийМодуль = Вычислить("УчетнаяПолитика"); 
		УчитыватьНДС = ОбщийМодуль.ПлательщикНДС(ОбъектДок.Организация, ТекущаяДата());
	КонецЕсли;
	
	Возврат УчитыватьНДС; 
	
КонецФункции // УчитыватьНДС()

// ЗагрузкаДокументов
#КонецОбласти

#Область ЗагрузкаТреков

//dm_12.10.17:Внесены изменения
Процедура ЗагрузитьТрек(ФайлТрека, СсылкаМУ)

	ТекущаяДатаТрека = Неопределено; // текущая дата трека в виде строки "YYYY-MM-DD" (дата точек трека).
	стррДанные		 = Неопределено; 	
	ДатаВремяТочки	 = Неопределено;
	БылиИзменения 	 = Ложь;
	Сортировать		 = Ложь;

	ЧтениеТрека 	    = Новый ЧтениеТекста(ФайлТрека.ПолноеИмя);
	
	//dm_12.10.17	
	КаталогТрековАгента = КаталогФайловТрековАгента(ФайлТрека.Путь);
	
	СтрокаФайла	= ЧтениеТрека.ПрочитатьСтроку();
	
	Пока СтрокаФайла <> Неопределено Цикл
		
		ДатаВремяТочки = ТрекДатаИзСтроки(Лев(СтрокаФайла, 19)); // дата-время в виде строки "YYYY-MM-DD HH-MM-SS"
		Если ТекущаяДатаТрека <> НачалоДня(ДатаВремяТочки) Тогда
			Если БылиИзменения Тогда			
				ТрекЗакрытьФайл(стррДанные, КаталогТрековАгента, Сортировать);
			КонецЕсли;
			ТекущаяДатаТрека = НачалоДня(ДатаВремяТочки);
			стррДанные = ТрекОткрытьФайл(ТекущаяДатаТрека, КаталогТрековАгента);
			тзТрек				= стррДанные.Трек;						
			ВремяНачалаТрека 	= стррДанные.ВремяНачала;
			ВремяОкончанияТрека = стррДанные.ВремяОкончания;
			БылиИзменения 	 = Ложь;
			Сортировать		 = Ложь;
		КонецЕсли;

		Если ДатаВремяТочки > ВремяОкончанияТрека Тогда
			стзТрек = тзТрек.Добавить();
			стзТрек.Время = ДатаВремяТочки;
			ТрекЗаполнитьРеквизитыСтроки(стзТрек, СтрокаФайла);
			БылиИзменения = Истина;	
		ИначеЕсли ДатаВремяТочки < ВремяНачалаТрека Тогда // изменено время в МУ?
			стзТрек = тзТрек.Добавить();
			стзТрек.Время = ДатаВремяТочки;
			ТрекЗаполнитьРеквизитыСтроки(стзТрек, СтрокаФайла);
			БылиИзменения = Истина;
			Сортировать	= Истина;			
		КонецЕсли;
		
		СтрокаФайла = ЧтениеТрека.ПрочитатьСтроку();
		
	КонецЦикла;
	
	Если БылиИзменения Тогда
		ТрекЗакрытьФайл(стррДанные, КаталогТрековАгента, Сортировать);
	КонецЕсли; 
	
	Если ДатаВремяТочки <> Неопределено Тогда // есть дата и время последней точки трека, нужно ее запомнить для подтверждения.
		Имя = СДИмяФайлаДляМУ(СсылкаМУ);
		стррЗначения = СДПрочитать(Имя, Истина);
		стррЗначения.Вставить("ПоследнееВремяТрека", ДатаВремяТочки);
		СДЗаписать(Имя, стррЗначения);
	КонецЕсли; 

КонецПроцедуры

Процедура ТрекЗакрытьФайл(стррДанные, КаталогТрековАгента, Сортировать = Ложь)

	тзТрек = стррДанные.Трек;
	Если тзТрек.Количество() = 0 Тогда // пустой трек не записываем
		Возврат;
	КонецЕсли; 
	
	Если Сортировать Тогда
		тзТрек.Сортировать("Время");
	КонецЕсли; 
	
	стррДанные.ВремяНачала 		= тзТрек[0].Время;
	стррДанные.ВремяОкончания 	= тзТрек[тзТрек.Количество()-1].Время;
	ИмяФайла = ТрекИмяФайлаПоДате(стррДанные.ВремяНачала, КаталогТрековАгента);
	
	ЗначениеВФайл(ИмяФайла, стррДанные);

КонецПроцедуры

Функция ТрекОткрытьФайл(ДатаТочкиТрека, КаталогТрековАгента) Экспорт

	ИмяФайла = ТрекИмяФайлаПоДате(ДатаТочкиТрека, КаталогТрековАгента);
	Если ФайлСуществует(ИмяФайла) Тогда
		стррДанные = ЗначениеИзФайла(ИмяФайла);
	Иначе
		стррДанные = Новый Структура;
		стррДанные.Вставить("Версия", 1);
		стррДанные.Вставить("ВремяНачала", 		'00010101');
		стррДанные.Вставить("ВремяОкончания", 	'00010101');
		
		ТипДата	 = Новый ОписаниеТипов("Дата");
		ТипЧисло = Новый ОписаниеТипов("Число");
		
		тзТрек = Новый ТаблицаЗначений;
		тзТрек.Колонки.Добавить("Время", 	ТипДата);
		тзТрек.Колонки.Добавить("Широта", 	ТипЧисло);
		тзТрек.Колонки.Добавить("Долгота", 	ТипЧисло);
		тзТрек.Колонки.Добавить("Скорость",	ТипЧисло);
		тзТрек.Колонки.Добавить("ИсточникСигнала",  ТипЧисло);
		
		стррДанные.Вставить("Трек", тзТрек);

	КонецЕсли; 
	
	Возврат стррДанные;

КонецФункции 

// процедура не заполняет перевый параметр строки (Время), т.к. время устанавливается перед вызовом процедуры.
Процедура ТрекЗаполнитьРеквизитыСтроки(стзТрек, Строка)
	
	Разделитель = Символы.Таб;
	
	НомерПараметра = 0;
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		СтрЗначение = Лев(Строка, Позиция - 1);
		Если НомерПараметра > 0 Тогда
			стзТрек[НомерПараметра] = ?(ПустаяСтрока(СтрЗначение), 0, Число(СтрЗначение));
		КонецЕсли; 
		Строка = Сред(Строка, Позиция + 1);
		Позиция = Найти(Строка, Разделитель);
		НомерПараметра = НомерПараметра + 1;
	КонецЦикла;
	
	стзТрек[НомерПараметра] = ?(ПустаяСтрока(Строка), 0, Число(Строка));
	
КонецПроцедуры	

Функция ТрекДатаИзСтроки(СтрокаТрека)

	СтрокаДаты = СтрЗаменить(Лев(СтрокаТрека, 19), "-", "");
	СтрокаДаты = СтрЗаменить(СтрокаДаты, " ", "");
	Возврат Дата(СтрокаДаты);

КонецФункции

Функция ТрекИмяФайлаПоДате(ДатаТрека, КаталогТрековАгента)

	Возврат КаталогТрековАгента + Формат(ДатаТрека, "ДФ=yyyyMMdd") + "_GPS.dat";
	
КонецФункции

// ЗагрузкаТреков
#КонецОбласти

Процедура СообщитьОПропускеДокумента(стррПараметры)

	Текст = "Пропущена загрузка документа """ + стррПараметры.ВидДокумента +
		""" № " + Строка(стррПараметры.Номер) + " от " + Строка(стррПараметры.Дата) +
		" - документ был загружен ранее.";
	СсылкаНаОбъект = Неопределено;
	стррПараметры.Свойство("СсылкаНаОбъект", СсылкаНаОбъект);
	ОповеститьОСобытии(Текст,, СсылкаНаОбъект, "ТекущийАгент");

КонецПроцедуры

Процедура ЗакончитьЗагрузкуКассовыхОрдеров(ЗагружаемыеОбъекты)
	
	тзКассовыеДокументы = ЗагружаемыеОбъекты.тзКассовыеДокументы;
	Если Не тзКассовыеДокументы = Неопределено Тогда
		
		СтррВидыДокументовОснования = ОснованияДляДокументовОрдер();

		Для Каждого СтрокаТ Из тзКассовыеДокументы Цикл
			ОбъектДок = СтрокаТ.Документ;
			УстановитьДокументОснованияОрдеру(ОбъектДок, СтррВидыДокументовОснования, СтрокаТ);
			
			ДокументОснование = Неопределено;
			Если ЗначениеЗаполнено(ОбъектДок.ДокументОснование) Тогда 
				ДокументОснование = ОбъектДок.ДокументОснование;
			КонецЕсли;
			
			Результат = ЗаписьДокумента(ОбъектДок, СтрокаТ.стррДокумент, СтрокаТ.ЭтоНовыйОбъект);
			Если Не Результат Тогда
				СообщитьОПропускеДокумента(СтрокаТ.стррДокумент);
			ИначеЕсли Результат И ПроводитьДокументыПриЗагрузке Тогда
				Попытка
					Если Не ДокументОснование = Неопределено Тогда 
						ДокументОснование.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
				Исключение
				КонецПопытки;
			Иначе
				Если ТипЗнч(ОбъектДок) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") И НЕ гКонфигурация = "Бухгалтерия_KZ" Тогда
					ОснованиеДок = ДокументОснование.ПолучитьОбъект();
					ОснованиеДок.НомерРасходногоКассовогоОрдера = ОбъектДок.Номер;
					ОснованиеДок.ДатаРасходногоКассовогоОрдера = ОбъектДок.Дата;
					Если ОснованиеДок.Проведен ИЛИ ПроводитьДокументыПриЗагрузке Тогда
						ОснованиеДок.Записать(РежимЗаписиДокумента.Проведение);
					Иначе
						ОснованиеДок.Записать();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		тзКассовыеДокументы.Очистить();
		ЗагружаемыеОбъекты.тзКассовыеДокументы = тзКассовыеДокументы;
		
	КонецЕсли;

КонецПроцедуры

//dm_180531 Переделал полностью 
Процедура УстановитьДокументОснованияОрдеру(ОбъектДок, СтррВидыДокументовОснования, ДанныеОрдера)

	ОбщийМодуль = ?(гКонфигурация = "Бухгалтерия_KZ", Вычислить("ПроцедурыНалоговогоУчета"), Вычислить("УчетнаяПолитика"));
	УправлениеДС = ?(гКонфигурация = "Бухгалтерия_KZ", Вычислить("УправлениеДенежнымиСредствамиСервер"), Неопределено);
	Для Каждого Элемент Из СтррВидыДокументовОснования Цикл
		СсылкаОснования = СсылкаИзДокумента(ДанныеОрдера.ИдОснования, Элемент.Значение);
		Если Не ЗначениеЗаполнено(СсылкаОснования) Тогда
			Продолжить;
		КонецЕсли;
		ОснованиеДок = СсылкаОснования.ПолучитьОбъект();
		ОснованиеТип = ТипЗнч(ОснованиеДок);
		
		Если гКонфигурация = "Бухгалтерия_KZ" Тогда
			
			ИмяОбъекта = ОбъектДок.Ссылка.Метаданные().Имя;
			
			ДокМенеджер = Документы[ИмяОбъекта];
			
			ДокМенеджер.ЗаполнитьПоДокументуОснованию(ОбъектДок, СсылкаОснования);
			УправлениеДС.ЗаполнитьРеквизитыРасчетногоДокумента(ОбъектДок, ОбъектДок.РасшифровкаПлатежа);
			ДокМенеджер.ЗаполнитьСчетаКассы(ОбъектДок.Касса, ОбъектДок.СчетКасса);
			
			Для Каждого СтрокаПлатеж Из ОбъектДок.РасшифровкаПлатежа Цикл
				
				Если НЕ ЗначениеЗаполнено(СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентомБУ) Тогда
					ДокМенеджер.ЗаполнитьСчетаРасчетовСКонтрагентом(ОбъектДок, СтрокаПлатеж);
				КонецЕсли;
				
			КонецЦикла; 
			ЗаполнитьОсновныеПараметрыДокумента(ОбъектДок, ДанныеОрдера.стррДокумент, ДокМенеджер, Новый Структура); 
			ОбъектДок.Основание = ОбъектДок.ВидОперации;
		Иначе
		
			ОбъектДок.ДокументОснование = СсылкаОснования; //ОснованиеДок;
			ОбъектДок.ВалютаДокумента = ОснованиеДок.ВалютаДокумента;
			
			Если ТипЗнч(ОбъектДок) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
				Попытка
					Если ОснованиеТип = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
						ОбъектДок.ВидОперации = Перечисления.ВидыОперацийРКО.ОплатаПоставщику;
						ОбъектДок.СтатьяДвиженияДенежныхСредств =  Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику;
					Иначе
						ОбъектДок.ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратПокупателю;
						ОбъектДок.СтатьяДвиженияДенежныхСредств =  Справочники.СтатьиДвиженияДенежныхСредств.ВозвратПокупателю;
					КонецЕсли;
				Исключение
					ОбъектДок.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
				КонецПопытки;
			КонецЕсли;
			
			Если НЕ ДанныеОрдера.ЭтоНовыйОбъект Тогда
				ОбъектДок.РасшифровкаПлатежа.Очистить();
			КонецЕсли;
			
			Для Каждого СтрокаТ Из ОснованиеДок.Товары Цикл
				СтрокаО = ОбъектДок.РасшифровкаПлатежа.Добавить();
				СтрокаО.ДоговорКонтрагента = ОбъектДок.ДоговорКонтрагента;
				Если ОснованиеТип = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
					СтрокаО.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.ПоДокументу;
				Иначе
					СтрокаО.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
				КонецЕсли;
				
				Если ТипЗнч(ОбъектДок) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") ИЛИ ОснованиеТип = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
					СтрокаО.Сделка = ОснованиеДок.Ссылка;
					СтрокаО.СчетНаОплату = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
				Иначе
					СтрокаО.Сделка = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
					СтрокаО.СчетНаОплату = ОснованиеДок.Ссылка;
				КонецЕсли;
				
				СтрокаО.СуммаПлатежа = СтрокаТ.Сумма;
				
				Если НЕ ЗначениеЗаполнено(ОбъектДок.ДоговорКонтрагента) Тогда
					СтрокаО.КурсВзаиморасчетов = 1;
					СтрокаО.КратностьВзаиморасчетов = 1;
					СтрокаО.СуммаВзаиморасчетов = СтрокаО.СуммаПлатежа;
				Иначе
					ВалютныеДанные = ПолучитьВалютныеДанные(ОбъектДок.ВалютаДокумента, ОбъектДок.ДоговорКонтрагента.ВалютаВзаиморасчетов, СтрокаО.СуммаПлатежа);
					ЗаполнитьЗначенияСвойств(СтрокаО, ВалютныеДанные);
				КонецЕсли;
				
				СтрокаО.СтавкаНДС = СтрокаТ.СтавкаНДС;
				СтрокаО.СуммаНДС = СтрокаТ.СуммаНДС;
				СтрокаО.СтатьяДвиженияДенежныхСредств = ОбъектДок.СтатьяДвиженияДенежныхСредств;
				
				Если ТипЗнч(ОбъектДок) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") И ОснованиеТип = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
					СтрокаО.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.01").Ссылка; //РасчетыСПоставщикамиИПодрядчиками.Ссылка;
					СтрокаО.СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным.Ссылка;
				Иначе
					СтрокаО.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.01").Ссылка; //РасчетыСПокупателямиИЗаказчиками.Ссылка;
					СтрокаО.СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным.Ссылка;
				КонецЕсли;
				
				Если ТипЗнч(ОбъектДок) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
					СтрокаО.ВидПлатежаПоКредитамЗаймам = Перечисления.ВидыПлатежейПоКредитамЗаймам.ПустаяСсылка();
				Иначе
					Если гКонфигурация = "Бухгалтерия_KZ" Тогда	
						//ОбъектДок.СуммаВключаетНДС = ОбщийМодуль.ПолучитьПризнакПлательщикаНДС(ОбъектДок.Организация, ТекущаяДата());
					Иначе
						Если НЕ ОбщийМодуль.ПлательщикНДС(ОбъектДок.Организация, ТекущаяДата()) Тогда
							СтрокаО.ПорядокОтраженияАванса = Перечисления.ПорядокОтраженияАвансов.ДоходУСН;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		Прервать;
	КонецЦикла;

КонецПроцедуры

//dm_180605 Добавил завершение загрузки документа Возврат
Процедура ЗакончитьЗагрузкуВозвратов(ЗагружаемыеОбъекты)
	
	тзДокументыВозврат = ЗагружаемыеОбъекты.тзДокументыВозврат;
	Если Не тзДокументыВозврат = Неопределено Тогда
		
		СтррВидыДокументовОснования = ОснованияДляДокументовОрдер();

		Для Каждого СтрокаТ Из тзДокументыВозврат Цикл
			ОбъектДок = СтрокаТ.Документ;
			Если ЗначениеЗаполнено(СтрокаТ.ИдОснования) Тогда
				УстановитьДокументОснованияВозврату(ОбъектДок, "РеализацияТоваровУслуг", СтрокаТ);
				СтрокаТ.стррДокумент.Вставить("Проводить", Истина);
			Иначе
				СтрокаТ.стррДокумент.Вставить("Проводить", Ложь);
			КонецЕсли;
			
			ДокументОснование = Неопределено;
			Если ЗначениеЗаполнено(ОбъектДок.Сделка) Тогда 
				ДокументОснование = ОбъектДок.Сделка;
			КонецЕсли;
			
			Результат = ЗаписьДокумента(ОбъектДок, СтрокаТ.стррДокумент, СтрокаТ.ЭтоНовыйОбъект);
			Если Не Результат Тогда
				СообщитьОПропускеДокумента(СтрокаТ.стррДокумент);
			ИначеЕсли Результат И ПроводитьДокументыПриЗагрузке Тогда
				Попытка
					Если Не ДокументОснование = Неопределено Тогда 
						ДокументОснование.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
		тзДокументыВозврат.Очистить();
		ЗагружаемыеОбъекты.тзДокументыВозврат = тзДокументыВозврат;
		
	КонецЕсли;

КонецПроцедуры

//dm_180605 Добавил установку документа-основания для документа Возврат
Процедура УстановитьДокументОснованияВозврату(ОбъектДок, ВидДокументаОснования, ДанныеВозврата)

	СсылкаОснования = СсылкаИзДокумента(ДанныеВозврата.ИдОснования, ВидДокументаОснования);
	
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		ДокМенеджер = Документы.ВозвратТоваровОтПокупателя;
		
		ДокМенеджер.ЗаполнитьПоРеализацииТоваровУслуг(ОбъектДок, СсылкаОснования);
		
		стррОбязательныеПоля = Новый Структура("Организация, Контрагент, ДоговорКонтрагента");
		ЗаполнитьОсновныеПараметрыДокумента(ОбъектДок, ДанныеВозврата.стррДокумент, ДокМенеджер, стррОбязательныеПоля);
	Иначе
		ОснованиеДок = СсылкаОснования.ПолучитьОбъект();
		ОснованиеТип = ТипЗнч(ОснованиеДок);
		
		ОбъектДок.Сделка = СсылкаОснования;
	КонецЕсли;

КонецПроцедуры

// Загрузка значений всех реквизитов обработки. Таблицы значений загружаются в реквизит "ВременныеТаблицы" (тип - Структура).
Процедура ЗагрузитьНастройкиДляРаботыОбмена()

	ОпределитьВерсиюКонфигурации();
	
	Имена = "";
	
	Для Каждого ЭлементМетаданных Из ЭтотОбъект.Метаданные().Реквизиты Цикл
		Имя = ЭлементМетаданных.Имя;
		Если Имя <> "ВыбАгент" Тогда
			Имена = Имена + Имя + ",";
		КонецЕсли;
	КонецЦикла;
	
	ВосстановитьЗначенияНастроекОбработки(Лев(Имена, СтрДлина(Имена)-1), Истина);
	
	гКэшЧтенияКонстант  		= Новый Структура;
	гКэшСравненияКонфигураций 	= Новый Соответствие;
	гКэшРеквизитыОбъектов 		= Новый Соответствие;
	гКэшСпискиОбъектов 			= Новый Соответствие;
	
	гОбновитьСпрХарактеристикиНоменклатурыСлужебный = Ложь;

КонецПроцедуры

Функция ХранитьСлужебныеДанныеВФайлах() // gi_170902 изменено с процедуры на функцию	
	
	Если гСлужебныеДанныеВФайлах = Неопределено Тогда	
		гСлужебныеДанныеВФайлах = Ложь; // хранение в Хранилище подтверждений для загруженных: документов, справочников, треков. 
	КонецЕсли;
	
	Возврат гСлужебныеДанныеВФайлах;
	
КонецФункции

Функция НовыйДополнительныйРеквизитИлиСведение(ИмяСвойства, ПредставлениеСвойства, ОписаниеТипа, ЭтоДополнительноеСведение, Подсказка)

	НовыйЭлемент = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
	НовыйЭлемент.ДополнительныеЗначенияИспользуются = Истина;
	Если ПоколениеКонфигурации(">=УТ_11.2") Тогда 
		НовыйЭлемент.Доступен = Ложь;
	КонецЕсли;
	НовыйЭлемент.Заголовок 		= ПредставлениеСвойства;
	НовыйЭлемент.Наименование 	= ИмяСвойства;
	НовыйЭлемент.ТипЗначения 	= ОписаниеТипа;
	НовыйЭлемент.ЭтоДополнительноеСведение = ЭтоДополнительноеСведение;
	НовыйЭлемент.Подсказка 		= Подсказка;
	НовыйЭлемент.Записать();

	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

Функция НовыйДополнительныйРеквизитИлиСведение_KZ(ИмяСвойства, Назначение, ОписаниеТипа)
	
	НовыйЭлемент = ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
	НовыйЭлемент.Наименование = ИмяСвойства;
	НовыйЭлемент.ТипЗначения = ОписаниеТипа;
	НовыйЭлемент.НазначениеСвойства = Назначение;
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	                            
КонецФункции	

// Функция возвращает структуру, используемую для запоминания загруженных объектов
// (документов, элементов справочников) из XML-файла, полученного от МТ.
Функция ЗагруженныеОбъектыИзФайла() // gi_170902 переименовал из НовыйЗагруженныеОбъектыИзФайла

	стррРезультат = Новый Структура;
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки());
	ОписаниеТипаИдентификатор = Новый ОписаниеТипов("УникальныйИдентификатор"); // gi_170830
	
	тзЗагруженныеДокументы = Новый ТаблицаЗначений;
	тзЗагруженныеДокументы.Колонки.Добавить("Идентификатор", 	ОписаниеТипаИдентификатор);	// gi_170830 идентификатор документа
	тзЗагруженныеДокументы.Колонки.Добавить("ВидДокумента", 	ОписаниеТипаСтрока); // вид документа в 1С
	тзЗагруженныеДокументы.Колонки.Добавить("ИдВидДокументаМТ", ОписаниеТипаИдентификатор); // gi_170830 // идентификатор (GUID) вида документа в МУ (на случай, если, например, Заказ в МУ загружался в 1С как РеализацияТоваровУслуг)
	стррРезультат.Вставить("тзЗагруженныеДокументы", 			тзЗагруженныеДокументы); // идентификаторы загруженных документов
	
	// sd_10082017 {
	тзЗагруженныеСправочники = Новый ТаблицаЗначений;
	тзЗагруженныеСправочники.Колонки.Добавить("Идентификатор", 		ОписаниеТипаИдентификатор);	// gi_170830 идентификатор элемента справочника
	тзЗагруженныеСправочники.Колонки.Добавить("ИдВидСправочникаМТ", ОписаниеТипаИдентификатор); // gi_170830 // идентификатор (GUID) вида справочника в МУ ? возможно не нужен
	стррРезультат.Вставить("тзЗагруженныеСправочники", 	тзЗагруженныеСправочники); // идентификаторы загруженных элементов справочников
	// } sd_10082017 
	
	тзКассовыеДокументы = Новый ТаблицаЗначений; // gi_170902 переименовал из ТаблицаКассовыхДокументов
	тзКассовыеДокументы.Колонки.Добавить("Документ");
	тзКассовыеДокументы.Колонки.Добавить("стррДокумент");
	тзКассовыеДокументы.Колонки.Добавить("ЭтоНовыйОбъект");
	тзКассовыеДокументы.Колонки.Добавить("ИдОснования");
	стррРезультат.Вставить("тзКассовыеДокументы", тзКассовыеДокументы);
	
	//{{dm_180605
	тзДокументыВозврат = Новый ТаблицаЗначений; 
	тзДокументыВозврат.Колонки.Добавить("Документ");
	тзДокументыВозврат.Колонки.Добавить("стррДокумент");
	тзДокументыВозврат.Колонки.Добавить("ЭтоНовыйОбъект");
	тзДокументыВозврат.Колонки.Добавить("ИдОснования");
	стррРезультат.Вставить("тзДокументыВозврат", тзДокументыВозврат);
	//}}dm_180605

	Возврат стррРезультат;
	
КонецФункции // ЗагруженныеОбъектыИзФайла()

Функция СсылкаИзДокументаПоСпискуВидов(ИдДокумента, стрВидыДокументов)
	
	мВидыДокументов = СтрРазделить_(стрВидыДокументов);
	ТипИдентификатора = ТипЗнч(ИдДокумента);
	
	Если ТипИдентификатора = Тип("Строка") И Не ПустаяСтрока(ИдДокумента) Тогда
		ID = Новый УникальныйИдентификатор(ИдДокумента);
	ИначеЕсли ТипИдентификатора = Тип("УникальныйИдентификатор") Тогда
		ID = ИдДокумента;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Неопределено;
	
	Для каждого ВидДокумента Из мВидыДокументов Цикл
		Ссылка = СсылкаИзДокумента(ID, ВидДокумента);
		Если Не Ссылка.Пустая() Тогда
			Результат = Ссылка;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	Если Результат = Неопределено Тогда // возвращаем пустую ссылку вида из первого элемента массива
		Результат = Документы[мВидыДокументов[0]].ПустаяСсылка();
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаИзДокумента(ИдДокумента, ВидДокумента)
	
	//++Дейнеко ВГ 2017-09-28 Бухгалтерия
	Если ВидДокумента = "ЗаказКлиента" Тогда
		ДокМенеджер = Документы["СчетНаОплатуПокупателю"];
	Иначе
		ДокМенеджер = Документы[ВидДокумента];
	КонецЕсли;
	//Замена
	//--Дейнеко ВГ 2017-09-28 Бухгалтерия
	
	ОбъектДок = Неопределено;	
	
	Если Не ПустаяСтрока(ИдДокумента) Тогда
		Ссылка = ДокМенеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдДокумента));
		ОбъектДок = Ссылка.ПолучитьОбъект();
	КонецЕсли; 
	
	Возврат ?(ОбъектДок = Неопределено, ДокМенеджер.ПустаяСсылка(), Ссылка);
	
КонецФункции

Функция СсылкаИзСправочника(ИдЭлемента, Спр, СоздаватьЭлемент = Ложь)
	
	СпрМенеджер = Справочники[Спр];
	
	Если ИдЭлемента = Неопределено Или ЭтоПустойИдентификатор(ИдЭлемента) Тогда
		Возврат СпрМенеджер.ПустаяСсылка();
	КонецЕсли;
	
	Результат = Неопределено;	

	Если ЗначениеЗаполнено(ИдЭлемента) Тогда
		ГуидЭлемента = Новый УникальныйИдентификатор(ИдЭлемента);
		Результат = СпрМенеджер.ПолучитьСсылку(ГуидЭлемента);
		Если Результат.ПолучитьОбъект() = Неопределено Тогда
			Если СоздаватьЭлемент Тогда // sd_10082017 
				ЭлементОбъект = СпрМенеджер.СоздатьЭлемент();
				ЭлементОбъект.УстановитьСсылкуНового(Результат); 
				//ЭлементОбъект.апОбменДанными.Загрузка = Истина; // sd_10082017 свойства апОбменДанными не существует, скорее всего опечатка.
				ЭлементОбъект.ОбменДанными.Загрузка = Истина;
				Если Не ВыполнитьОперациюДляОбъекта(ЭлементОбъект, "запись") Тогда
					Текст = "Не удалось записать элемент справочника: " + Строка(ЭлементОбъект);
					ОповеститьОСобытии(Текст, "ОшибкаЗапись", ЭлементОбъект, "ТекущийАгент");
					Возврат Результат;
				КонецЕсли;
				Результат = ЭлементОбъект.Ссылка;
			Иначе
				Результат = СпрМенеджер.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Результат = Неопределено Тогда
		Результат = СпрМенеджер.ПустаяСсылка();
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Функция записыввает и (если требуется в настройках) проводит документ.
// Возвращает Истина, если документ удалось записать, или Ложь в противном случае.
Функция ЗаписьДокумента(Док, стррДокумент, НовыйДок = Истина, ДобавлятьЗаписьВРегистр = Истина)
	
	МожноПроводить = Истина;
	МетаданныеДок = Док.Метаданные();
	РеквизитыДок = МетаданныеДок.Реквизиты;

	Если ПроводитьДокументыПриЗагрузке Тогда
		
		Если РеквизитыДок.Найти("Контрагент") <> Неопределено Тогда
			Если Не ЗначениеЗаполнено(Док.Контрагент) Тогда
				Текст = "В документе " + Строка(Док) + " не указан контрагент. Документ не будет проведен!";
				ОповеститьОСобытии(Текст, "ОшибкаЗапись", Док.Ссылка, "ТекущийАгент");
				МожноПроводить = Ложь;
			КонецЕсли;
		КонецЕсли;

		Если РеквизитыДок.Найти("ДоговорКонтрагента") <> Неопределено И ИспользоватьСоглашения Тогда //dm_180514
			Если Не ЗначениеЗаполнено(Док.ДоговорКонтрагента) Тогда
				Текст = "В документе " + Строка(Док) + " не указан договор. Документ не будет проведен!";
				ОповеститьОСобытии(Текст, "ОшибкаЗапись", Док.Ссылка, "ТекущийАгент");
				МожноПроводить = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		
		Если РеквизитыДок.Найти("СуммаДокумента") <> Неопределено Тогда
			Если Док.СуммаДокумента = 0 Тогда
				Текст = "Сумма документа " + Строка(Док) + " равна 0. Документ не будет проведен!";
				ОповеститьОСобытии(Текст, "ОшибкаЗапись", Док.Ссылка, "ТекущийАгент");
				МожноПроводить = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		//{{dm_180608 Для документа Возврат
		Если стррДокумент.Свойство("Проводить") Тогда
			МожноПроводить = стррДокумент.Проводить;
		КонецЕсли;
		//}}dm_180608
		
	Иначе
		
		МожноПроводить = Ложь;
		
	КонецЕсли;

	Если Не ВыполнитьОперациюДляОбъекта(Док, "запись") Тогда
		Текст = "Не удалось записать документ " + Строка(Док) + " в базу!";
		ОповеститьОСобытии(Текст, "ОшибкаЗапись", Док.Ссылка, "ТекущийАгент");
		Возврат Ложь;
	КонецЕсли;
	
	ЗаписатьДополнительныеСвойстваДокумента(Док.Ссылка, стррДокумент);

	Если МетаданныеДок.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить 
		И ПроводитьДокументыПриЗагрузке
		И МожноПроводить 
	Тогда
		Если Не ВыполнитьОперациюДляОбъекта(Док, "проведение") Тогда
			ОповеститьОСобытии("Не удалось провести документ: " + Строка(Док), "ОшибкаЗапись", Док.Ссылка, "ТекущийАгент");
			Возврат Истина; // 
		КонецЕсли;
	КонецЕсли;
	
	Текст = ?(НовыйДок, "Создан", "Перезаписан") + " документ " + Строка(Док);
	ОповеститьОСобытии(Текст, "ИнфоОбмен", Док.Ссылка);
	
	Возврат Истина;
	
КонецФункции

// Функция записыввает и (если требуется в настройках) проводит документ.
// Возвращает Истина, если документ удалось записать, или Ложь в противном случае.
Функция ЗаписьВиртуальногоДокумента(ОбъектДок, стррЗначенияДопРеквизитов, ЭтоНовыйОбъект) //dm: Пока только для Мерчендайзинга
	
	Представление = стррЗначенияДопРеквизитов.ВидДокумента + " № " + ОбъектДок.Номер + " от " + ОбъектДок.Дата;
	
	ОбъектДок.Статус = ?(ОбъектДок.Проведен, 1, 0);
	
	Префикс = ВОСвойстваОбъекта("*" + стррЗначенияДопРеквизитов.ВидДокумента).Префикс;
	ID = ОбъектДок.ID;
	СохранитьОбъектВХранилище(Префикс, ID, ОбъектДок);
	
	Текст = ?(ЭтоНовыйОбъект, "Создан", "Перезаписан") + " документ " + Представление; 
	ОповеститьОСобытии(Текст, "ИнфоОбмен", Неопределено);
	
	тз = ПрочитатьЗначениеНастройки("ДокументыМерчендайзинга");
	
	Если ЭтоНовыйОбъект Тогда
		НоваяСтрока = тз.Добавить();
	ИначеЕсли ОбновлятьДокументыПриЗагрузке Тогда
		НоваяСтрока = тз.Найти(ID, "ID");
	Иначе
		НоваяСтрока = Неопределено;
	КонецЕсли;
	
	Если НЕ НоваяСтрока = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОбъектДок);
		СохранитьЗначениеНастройки("ДокументыМерчендайзинга", тз);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// sd_10082017
Функция ЗаписьСправочника(Спр, стррДопСвойств = Неопределено, НовыйСпр = Истина)
	
	Если Не ВыполнитьОперациюДляОбъекта(Спр, "запись") Тогда
		Текст = "Не удалось записать справочник " + Строка(Спр) + " в базу!";
		ОповеститьОСобытии(Текст, "ОшибкаЗапись", Спр.Ссылка, "ТекущийАгент");
		Возврат Ложь;
	КонецЕсли;
	
	Если стррДопСвойств <> Неопределено Тогда 
		тзРеквизиты = Новый ТаблицаЗначений;
		//{{dm_180514
		Если гКонфигурация = "Бухгалтерия_KZ" Тогда
			ТипСвойства = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СвойстваОбъектов");
		Иначе
			ОбщийМодуль = Вычислить("УправлениеСвойствами");
			ТипСвойства = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения");
		КонецЕсли;
		//тзРеквизиты.Колонки.Добавить("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
		тзРеквизиты.Колонки.Добавить("Свойство", ТипСвойства);
		//}}dm_180514	
		тзРеквизиты.Колонки.Добавить("Значение");
			
		стзШирота = тзРеквизиты.Добавить();	
		стзШирота.Свойство  = ДополнительноеСвойствоПоНаименованию(ИмяСвойстваШиротаПартнер());	
		стзШирота.Значение	= стррДопСвойств.Широта;
		стзДолгота = тзРеквизиты.Добавить();
		стзДолгота.Свойство = ДополнительноеСвойствоПоНаименованию(ИмяСвойстваДолготаПартнер());
		стзДолгота.Значение = стррДопСвойств.Долгота;

		//{{dm_180514
		Если гКонфигурация = "Бухгалтерия_KZ" Тогда
			ЗаписатьСвойстваУОбъекта(Спр.Ссылка, тзРеквизиты);
		Иначе
			ОбщийМодуль.ЗаписатьСвойстваУОбъекта(Спр.Ссылка, тзРеквизиты); 
		КонецЕсли;
		//}}dm_180514
	КонецЕсли;
	
	Текст = ?(НовыйСпр, "Создан", "Перезаписан") + " справочник " + Строка(Спр);
	ОповеститьОСобытии(Текст, "ИнфоОбмен", Спр.Ссылка);
	
	Возврат Истина;
	
КонецФункции

Функция ВыполнитьОперациюДляОбъекта(Объект, ВидОперации)
	
	Результат = Ложь;
	
	Попытка
		
		Если ВидОперации = "запись" Тогда
			
			Объект.Записать();
			
		ИначеЕсли ВидОперации = "проведение" Тогда
			
			Если Объект.ПометкаУдаления Тогда
				ОповеститьОСобытии("Документ помечен на удаление - проведение отменено!", "ОшибкаЗапись", Объект.Ссылка, "ТекущийАгент");
				Возврат Ложь;
			Иначе
				Объект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
		ИначеЕсли ВидОперации = "создание" Тогда
			
			СтрОбъект = Строка(Объект);
			
			Если Лев(СтрОбъект, 10)     = "Справочник" Тогда
				Объект = Объект.СоздатьЭлемент();
			ИначеЕсли Лев(СтрОбъект, 8) = "Документ" Тогда
				Объект = Объект.СоздатьДокумент();
			ИначеЕсли Лев(СтрОбъект, 7) = "Регистр" Тогда
				Объект = Объект.СоздатьМенеджерЗаписи();
			Иначе
				Возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		Результат = Истина;
		
	Исключение
		
		Текст = "Не удалось выполнить " + ВидОперации + " для объекта: """ + Строка(Объект) + """. Причина: " + ОписаниеОшибки();
		Ссылка = ?(ЕстьРеквизитОбъекта("Ссылка", Объект), Объект.Ссылка, Неопределено);
		ОповеститьОСобытии(Текст, "ОшибкаЗапись", Ссылка, "ТекущийАгент");
		
		Если ВидОперации = "проведение" И ЗначениеЗаполнено(Объект.Ссылка) Тогда 
			// запись документа прошла успешно, возвращаем Истина, чтобы документ был зарегистрирован в журнале обмена
			Результат = Истина;
		КонецЕсли; 
		
	КонецПопытки;

	Возврат Результат;
	
КонецФункции

Функция ОснованияДляДокументовОрдер()

	СписокОснованийДляОрдера = Новый СписокЗначений;
	СписокОснованийДляОрдера.Добавить("СчетНаОплатуПокупателю"); //ЗаказКлиента");
	СписокОснованийДляОрдера.Добавить("РеализацияТоваровУслуг");
	СписокОснованийДляОрдера.Добавить("ВозвратТоваровОтПокупателя"); //Клиента");
	СписокОснованийДляОрдера.Добавить("ПоступлениеТоваровУслуг");

	Возврат СписокОснованийДляОрдера;
КонецФункции // ОснованияДляДокументовОрдер()

Функция ЭтоПустойИдентификатор(ИД)

	Возврат (ПустаяСтрока(ИД) Или СокрЛП(ИД) = "00000000-0000-0000-0000-000000000000");

КонецФункции

Функция КонстантыИзФайлаОбмена(ТекстXML, ИменаКонстант)

	стррРезультат = Новый Структура(ИменаКонстант);
	ствКонстанты = КонстантыМТПолучитьСоответствие();
	
	Пока ТекстXML.Прочитать() Цикл
		Если ТекстXML.Имя = "CONSTANTS"	И ТекстXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Прервать;
		ИначеЕсли ТекстXML.Имя = "ITEM" И ТекстXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ИмяКонстанты = ствКонстанты.Получить(НРег(ТекстXML.ЗначениеАтрибута("GUID")));
			Если ЗначениеЗаполнено(ИмяКонстанты) Тогда
				стррРезультат[ИмяКонстанты] = ТекстXML.ЗначениеАтрибута("Value");
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат стррРезультат;
	
КонецФункции 

Функция ТорговыйПредставительИзФайлаОбмена(Идентификатор)

	Если Идентификатор = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));		
	КонецЕсли;
	
КонецФункции

Функция НайтиФайлОбменаВКаталоге(Путь)

	Маска = "To*.zip";
	НайденныеФайлы = НайтиФайлы(Путь, Маска);
	ФайлАрхив = Неопределено;
	Если НайденныеФайлы.Количество() > 0 Тогда
		ФайлАрхив = НайденныеФайлы[0];
	КонецЕсли;

	Возврат ФайлАрхив;
	
КонецФункции 

Функция ФайлОбменаТрек(ПутьККаталогуФайла)

	НайденныеФайлы = НайтиФайлы(ПутьККаталогуФайла, "gps*.txt");
	Результат = Неопределено;
	Если НайденныеФайлы.Количество() > 0 Тогда
		Результат = НайденныеФайлы[0];
	КонецЕсли;

	Возврат Результат;
	
КонецФункции 

Функция ФайлОбменаРаспакованный(ПутьККаталогуФайла)

	Маска = "To*.xml";
	НайденныеФайлы = НайтиФайлы(ПутьККаталогуФайла, Маска);
	ФайлОбмена = Неопределено;
	Если НайденныеФайлы.Количество() > 0 Тогда
		ФайлОбмена = НайденныеФайлы[0];
	Иначе
		Текст = СтрШаблон_("Не найден файл в папке ""%1"" по маске ""%2"".", ПутьККаталогуФайла, Маска);
		ВызватьИсключение(Текст);
	КонецЕсли;

	Возврат ФайлОбмена;
	
КонецФункции 

Функция УстановитьВидЦеныТЧ(ИдВидЦены, ВидЦеныДокумента) 
	
	//++Дейнеко ВГ 2017-09-25 Бухгалтерия
	ВидЦены = СсылкаИзСправочника(ИдВидЦены, "ТипыЦенНоменклатуры");
	//--Дейнеко ВГ 2017-09-25 Бухгалтерия
	
	Если ВидЦены.Пустая() 
			И НЕ ВыбНастройкиАгента.НастройкиМобильногоПриложения.РазрешитьРедактироватьЦены.Значение
				И НЕ ВыбНастройкиАгента.НастройкиМобильногоПриложения.ИспользоватьТипыЦенВТЧ.Значение Тогда 
		
		ВидЦены = ВидЦеныДокумента;
		
	КонецЕсли;
	
	Возврат ВидЦены;
	
КонецФункции

Функция УстановитьОбеспечениеЗаказа();
	
	Если РегистрОстатковТоваров = "СвободныеОстатки" Или ПоколениеКонфигурации("<=УТ_11.1.2") Тогда 
		ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
	Иначе
		ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
	КонецЕсли;
		
	Возврат ВариантОбеспечения;
	
КонецФункции

// ЗагрузкаДанных
#КонецОбласти

// sk_190115 Функция изменена
// Возвращает числовое значение ставки НДС по значению перечисления.
//
// Параметры:
//  СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС.
//
// Возвращаемое значение:
//  Число - Значение ставки НДС числом.
//  Если СтавкаНДС = 0%, то число = О;
//  Если СтавкаНДС = БезНДС, то число = Неопределено.
//
Функция ПолучитьСтавкуНДСЧислом(Знач СтавкаНДС) Экспорт
	
	//{{dm_180425
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		Возврат ?(ЗначениеЗаполнено(СтавкаНДС.Ставка), СтавкаНДС.Ставка/100, 0);
	Иначе
		//(( sk_190115 Получаем НДС начиная с версии Бухгалтерия_RU_3.0.67.38 (MOD-228)
		Если ПоколениеКонфигурации(">=Бухгалтерия_3.0.67.38") Тогда
			СтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(СтавкаНДС, ОбщегоНазначения.ТекущаяДатаПользователя());
		КонецЕсли;
		//)) sk_190115
		Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			Возврат Неопределено;
		ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
			Возврат 10/100;
		ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
			Возврат 18/100;
		//(( sk_190115 Предусматриваем выгрузку НДС 20%	
		ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Или СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
			Возврат 20/100;
		//)) sk_190115
		КонецЕсли;
	
		Возврат 0;
	КонецЕсли;
	//}}dm_180425
КонецФункции

//(( dm_180315
Функция ПолучитьИмяФормы(ИмяФормы) Экспорт
	
	Возврат Метаданные().ПолноеИмя() + ".Форма." + ИмяФормы;
	
КонецФункции

//{{dm_180423
Функция Конфигурация(КонфигурацияСравнения) Экспорт
	
	стррВерсия = ВерсияКонфигурации();
	
	Возврат стррВерсия.Конфигурация = КонфигурацияСравнения;
	
КонецФункции	
//}}dm_180423

//{{dm_180424-180426////// ДОБАВЛЕННЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ////////////

// Возвращает таблицу, содержащую контактную информацию нескольких объектов. Перенесено из Бухгалтерия 3.0 (Россия)
//
// Параметры:
//    СсылкиИлиОбъекты         - Массив - владельцы контактной информации.
//    ТипыКонтактнойИнформации - Массив, ПеречислениеСсылка.ТипыКонтактнойИнформации - Если указаны, то будет получена
//        контактную информацию только этих типов.
//    ВидыКонтактнойИнформации - Массив, СправочникСсылка.ВидыКонтактнойИнформации   - Если указаны, то будет получена
//        контактную информацию только этих видов.
//    Дата                     - Дата   - необязательный, дата с которой действует запись контактной информации,
//                              используется при хранении истории изменения контактной информации.
//                              Если владелец хранит историю изменений, то при несоответствии параметра
//                              дате будет вызвано исключение.
//
// Возвращаемое значение:
//  ТаблицаЗначений -  таблица с контактной информацией объектов содержащая колонки:
//    * СсылкиИлиОбъекты - Ссылка - Владелец контактной информации.
//    * Вид              - СправочникСсылка.ВидыКонтактнойИнформации - Вид контактной информации.
//    * Тип              - ПеречислениеСсылка.ТипыКонтактнойИнформации - Тип контактной информации.
//    * ЗначенияПолей    - Строка - XML соответствующий XDTO пакету КонтактнаяИнформация или Адрес.
//    * Представление    - Строка - Представление контактной информации.
//    * Дата             - Дата - Дата с которой действует запись контактной информации.
//
Функция КонтактнаяИнформацияОбъектов(СсылкиИлиОбъекты, Знач ТипыКонтактнойИнформации = Неопределено, Знач ВидыКонтактнойИнформации = Неопределено, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ТипЗнч(ТипыКонтактнойИнформации) = Тип("ПеречислениеСсылка.ТипыКонтактнойИнформации") Тогда
		ТипыКонтактнойИнформации = ЗначениеВМассиве(ТипыКонтактнойИнформации);
	КонецЕсли;
	
	Если ТипЗнч(ВидыКонтактнойИнформации) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
		ВидыКонтактнойИнформации = ЗначениеВМассиве(ВидыКонтактнойИнформации);
	КонецЕсли;
	
	СоздатьВТКонтактнаяИнформация(Запрос.МенеджерВременныхТаблиц, СсылкиИлиОбъекты, ТипыКонтактнойИнформации, ВидыКонтактнойИнформации, Дата);
	
	Если ТипЗнч(Дата) = Тип("Дата") Тогда
		ДействуетС = "КонтактнаяИнформация.ДействуетС";
	Иначе
		ДействуетС = "ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект КАК Объект,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	" + ДействуетС +" КАК Дата,
	|	КонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	ВТКонтактнаяИнформация КАК КонтактнаяИнформация";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Создает временную таблицу с контактной информацией нескольких объектов. Перенесено из Бухгалтерия 3.0 (Россия) и доработано для Казахской версии
//
// Параметры:
//    МенеджерВременныхТаблиц  - МенеджерВременныхТаблиц - В менеджере создается временная таблица
//     ВТКонтактнаяИнформация с полями:
//     * Объект        - Ссылка - владелец контактной информации.
//     * Вид           - СправочникСсылка.ВидыКонтактнойИнформации - Ссылка на вид контактной информации.
//     * Тип           - ПеречислениеСсылка.ТипыКонтактнойИнформации - Тип контактной информации.
//     * ЗначенияПолей - Строка - XML соответствующий XDTO пакету КонтактнаяИнформация или Адрес.
//     * Представление - Строка - Представление контактной информации.
//    МассивОбъектов           - Массив - Владельцы контактной информации.
//    ТипыКонтактнойИнформации - Массив - Если указаны, то временная таблица будет содержать только контактную
//                                        информацию этих типов.
//    ВидыКонтактнойИнформации - Массив - Если указаны, то временная таблица будет содержать только контактную
//                                        информацию этих видов.
//    Дата                     - Дата   - Дата, с которой действует запись контактной информации, используется при
//                                        хранении истории изменения контактной информации. Если владелец хранит историю
//                                        изменений, то при несоответствии параметра дате будет вызвано исключение.
//
Процедура СоздатьВТКонтактнаяИнформация(МенеджерВременныхТаблиц, МассивОбъектов, ТипыКонтактнойИнформации = Неопределено, ВидыКонтактнойИнформации = Неопределено, Дата = Неопределено) Экспорт
	
	Если ТипЗнч(МассивОбъектов) <> Тип("Массив") ИЛИ МассивОбъектов.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Неверное значение для массива владельцев контактной информации.'");
	КонецЕсли;
	
	ОбъектыСГруппировкойПоТипам = Новый Соответствие;
	Для каждого Ссылка Из МассивОбъектов Цикл
		ТипОбъекта = ТипЗнч(Ссылка);
		НайденныйОбъект = ОбъектыСГруппировкойПоТипам.Получить(ТипОбъекта);
		Если НайденныйОбъект = Неопределено Тогда
			НаборСсылок = Новый Массив;
			НаборСсылок.Добавить(Ссылка);
			ОбъектыСГруппировкойПоТипам.Вставить(ТипОбъекта, НаборСсылок);
		Иначе
			НайденныйОбъект.Добавить(Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	ТекстЗапросаПодготовкаДанных = "";
	ЕстьКонтактнаяИнформацияСДатой = Ложь;
	СтрокаРАЗРЕШЕННЫЕ = " РАЗРЕШЕННЫЕ ";
	СтрокаВременнойТаблицы = "ПОМЕСТИТЬ ВТКонтактнаяИнформация";
	
	ТекстЗапроса = "";
	Для каждого ОбъектСКонтактнойИнформацией Из ОбъектыСГруппировкойПоТипам Цикл
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), Символы.ПС + " ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС, "");
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ОбъектСКонтактнойИнформацией.Ключ);
		ИмяТаблицы = МетаданныеОбъекта.Имя;
		
		ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ " + СтрокаРАЗРЕШЕННЫЕ + "
		|	КонтактнаяИнформация.Объект КАК Объект,
		|	КонтактнаяИнформация.Вид КАК Вид,
		|	КонтактнаяИнформация.Тип КАК Тип,
		|	ДАТАВРЕМЯ(1,1,1) КАК ДействуетС,
		|	КонтактнаяИнформация.Представление КАК Представление,
		//{{dm_180517
		//|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей
		|	NULL КАК ЗначенияПолей
		//}}dm_180517
		|	" + СтрокаВременнойТаблицы + "
		|ИЗ
		//{{dm_180517
		//|	" + МетаданныеОбъекта.ПолноеИмя() + ".КонтактнаяИнформация КАК КонтактнаяИнформация
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		//}}dm_180517
		|ГДЕ
		| КонтактнаяИнформация.Вид <> ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПустаяСсылка)
		| И КонтактнаяИнформация.Тип <> ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка)
		| И КонтактнаяИнформация.Объект В (&МассивОбъектов" + ИмяТаблицы + ")
		|	" + ?(ТипыКонтактнойИнформации = Неопределено, "", "И КонтактнаяИнформация.Тип В (&ТипыКонтактнойИнформации)") + "
		|	" + ?(ВидыКонтактнойИнформации = Неопределено, "", "И КонтактнаяИнформация.Вид В (&ВидыКонтактнойИнформации)") + "
		|";
			
		СтрокаРАЗРЕШЕННЫЕ ="";
		СтрокаВременнойТаблицы = "";
		
		Запрос.УстановитьПараметр("МассивОбъектов" + ИмяТаблицы, ОбъектСКонтактнойИнформацией.Значение);
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапросаПодготовкаДанных + ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДействуетС", Дата);
	Запрос.УстановитьПараметр("ТипыКонтактнойИнформации", ТипыКонтактнойИнформации);
	Запрос.УстановитьПараметр("ВидыКонтактнойИнформации", ВидыКонтактнойИнформации);
	Запрос.Выполнить();
КонецПроцедуры

Функция ПолучитьКИОрганизации(Организация)
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Объект,
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Объект";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Объект", Организация);
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ПолучитьСпрВидыКИ()
	
	стррСпр = Новый Структура("СправочникКонтрагенты, СправочникКонтактныеЛица");
	Выполнить("стррСпр.СправочникКонтрагенты = Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты");
	Выполнить("стррСпр.СправочникКонтактныеЛица = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица");
	
	Возврат стррСпр;
	
КонецФункции

Функция ВыборкаВидовКИ(ТекстЗапроса, ЭлементОтбора = Неопределено)

	Если ЭлементОтбора <> Неопределено И ЭлементОтбора.Использование Тогда // задействован ЭлементОтбораКомпоновкиДанных
		МакетКомпоновки = СформированныйМакетКомпоновкиДанных(ЭлементОтбора, ТекстЗапроса);
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
		ТаблицаРезультата = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		//{{dm180425
		//Возврат ТаблицаРезультата.ВыгрузитьКолонку("Ссылка");
		Возврат ТаблицаРезультата;
		//{{dm180425
	Иначе // условие без отбора данных
		Запрос = Новый Запрос(ТекстЗапроса);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		//{{dm180425
		//Возврат РезультатЗапроса.ВыгрузитьКолонку("Ссылка");
		Возврат РезультатЗапроса;
		//{{dm180425
	КонецЕсли; 
	
КонецФункции

Функция ПланыСчетовЗапасы()
	
	мВозврат = Новый Массив;
	мВозврат.Добавить(ПланыСчетов["Типовой"].СырьеИМатериалы.Ссылка);
	мВозврат.Добавить(ПланыСчетов["Типовой"].ГотоваяПродукция.Ссылка);
	мВозврат.Добавить(ПланыСчетов["Типовой"].Товары.Ссылка);
	
	Возврат мВозврат;

КонецФункции

Функция ПолучитьКурсВалюты(Валюта, ДатаКурса) Экспорт
	
	Результат = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Новый Структура("Валюта", Валюта));
	
	Результат.Вставить("Валюта",    Валюта);
	Результат.Вставить("ДатаКурса", ДатаКурса);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПоДоговору(ОбъектДок,Договор,ВидЦены)
	
	Если ЗначениеЗаполнено(ОбъектДок.ДоговорКонтрагента.ВалютаВзаиморасчетов) Тогда
		ОбъектДок.ВалютаДокумента = ОбъектДок.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	Иначе
		ОбъектДок.ВалютаДокумента = ?(ЗначениеЗаполнено(ВидЦены), ВидЦены.ВалютаЦены, КонстантыПолучитьЗначение("ВалютаРегламентированногоУчета"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектДок.ДоговорКонтрагента.ТипЦен)  Тогда
		ОбъектДок.ТипЦен = ОбъектДок.ДоговорКонтрагента.ТипЦен;
		ОбъектДок.СуммаВключаетНДС = ОбъектДок.ТипЦен.ЦенаВключаетНДС;
	Иначе
		ЗаполнитьНеПоДоговору(ОбъектДок, ВидЦены, Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНеПоДоговору(ОбъектДок, ВидЦены, ОтдельноОтДоговора = Истина)

	ОбщийМодуль = ?(гКонфигурация = "Бухгалтерия_KZ", Вычислить("ПроцедурыНалоговогоУчета"), Вычислить("УчетнаяПолитика"));

	Если ЗначениеЗаполнено(ВидЦены) Тогда
		ОбъектДок.ТипЦен = ВидЦены;
		ОбъектДок.СуммаВключаетНДС = ОбъектДок.ТипЦен.ЦенаВключаетНДС;
		Если ОтдельноОтДоговора Тогда 
			ОбъектДок.ВалютаДокумента = ВидЦены.ВалютаЦены; 
		КонецЕсли;
	Иначе
		ОбъектДок.ТипЦен = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
		ОбъектДок.СуммаВключаетНДС = ?(гКонфигурация = "Бухгалтерия_KZ",
									ОбщийМодуль.ПолучитьПризнакПлательщикаНДС(ОбъектДок.Организация, ТекущаяДата()),
									ОбщийМодуль.ПлательщикНДС(ОбъектДок.Организация, ТекущаяДата()));
		Если ОтдельноОтДоговора Тогда 
			ОбъектДок.ВалютаДокумента = КонстантыПолучитьЗначение("ВалютаРегламентированногоУчета"); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруАтрибутовТЧЗаказ(ТекстXML, УчитыватьНДС)
	
	стррАтрибуты = Новый Структура;
	Номенклатура = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A01"),"Номенклатура");
	// sk_190722 В рамках (MOD-523) БезНДС = ?(гКонфигурация = "Бухгалтерия_KZ", Справочники.СтавкиНДС.НайтиПоНаименованию("без НДС"), Перечисления.СтавкиНДС.БезНДС); 
	ПроцентСкидки = Число(ТекстXML.ПолучитьАтрибут("A09"));
	
	стррАтрибуты.Вставить("Номенклатура",	Номенклатура);
	стррАтрибуты.Вставить("ИдЕдиницыИзм",	ТекстXML.ПолучитьАтрибут("A03"));
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррАтрибуты.Вставить("ЕдиницаИзмерения", Номенклатура.БазоваяЕдиницаИзмерения);
	КонецЕсли;
	стррАтрибуты.Вставить("Количество",		Число(ТекстXML.ПолучитьАтрибут("A04")));
	стррАтрибуты.Вставить("Цена",			Число(ТекстXML.ПолучитьАтрибут("A05")));
	стррАтрибуты.Вставить("Сумма",			Число(ТекстXML.ПолучитьАтрибут("A06")));
	стррАтрибуты.Вставить("СуммаНДС",		Число(ТекстXML.ПолучитьАтрибут("A07")));
	стррАтрибуты.Вставить("Вес",			Число(ТекстXML.ПолучитьАтрибут("A08")));
	
	МинЦенаТовара = 0;
	ЦенаСоСкидкой = стррАтрибуты.Цена - (стррАтрибуты.Цена*(ПроцентСкидки/100));	// проверяем больше ли цена с применением скидки чем минимально допустимая цена
	Если ЦенаСоСкидкой >= МинЦенаТовара Тогда
		стррАтрибуты.Вставить("ПроцентСкидки", ПроцентСкидки);
	Иначе
		стррАтрибуты.Вставить("ПроцентСкидки", 0);
	КонецЕсли;
	//(( sk_190722 Добавляем ставку НДС в структуру атрибутов в рамках (MOD-523)
	//стррАтрибуты.Вставить("СтавкаНДС",		?(УчитыватьНДС, Номенклатура.СтавкаНДС, БезНДС));
	ДобавитьСтавкуНДСВСтруктуруАтрибутовТЧ(стррАтрибуты, УчитыватьНДС);
	//)) sk_190722
	стррАтрибуты.Вставить("СуммаСкидки",	Число(ТекстXML.ПолучитьАтрибут("A012")));
	стррАтрибуты.Вставить("Содержание",		Номенклатура.НаименованиеПолное); // Для Услуги
	стррАтрибуты.Вставить("Коэффициент",	1); // Для Бухгалтерия_KZ

	Возврат стррАтрибуты;
	
КонецФункции

Функция ПолучитьСтруктуруАтрибутовТЧРеализация(ТекстXML, УчитыватьНДС)
	
	стррАтрибуты = Новый Структура;
	Номенклатура = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A01"),"Номенклатура");
	// sk_190722 В рамках (MOD-523) БезНДС = ?(гКонфигурация = "Бухгалтерия_KZ", Справочники.СтавкиНДС.НайтиПоНаименованию("без НДС"), Перечисления.СтавкиНДС.БезНДС); 
	стррАтрибуты.Вставить("Номенклатура",	Номенклатура);
	стррАтрибуты.Вставить("ИдЕдиницыИзм",	ТекстXML.ПолучитьАтрибут("A03"));
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррАтрибуты.Вставить("ЕдиницаИзмерения", Номенклатура.БазоваяЕдиницаИзмерения);
	Иначе
		стррАтрибуты.Вставить("ЕдиницаИзмерения", Номенклатура.ЕдиницаИзмерения);
	КонецЕсли;
	стррАтрибуты.Вставить("Количество",		Число(ТекстXML.ПолучитьАтрибут("A04")));
	стррАтрибуты.Вставить("Цена",			Число(ТекстXML.ПолучитьАтрибут("A05")));
	стррАтрибуты.Вставить("Сумма",			Число(ТекстXML.ПолучитьАтрибут("A06")));
	стррАтрибуты.Вставить("СуммаНДС",		Число(ТекстXML.ПолучитьАтрибут("A07")));
	//(( sk_190722 Добавляем ставку НДС в структуру атрибутов в рамках (MOD-523)
	//стррАтрибуты.Вставить("СтавкаНДС",		?(УчитыватьНДС, Номенклатура.СтавкаНДС, БезНДС));
	ДобавитьСтавкуНДСВСтруктуруАтрибутовТЧ(стррАтрибуты, УчитыватьНДС);
	//)) sk_190722
	стррАтрибуты.Вставить("Содержание",		Номенклатура.НаименованиеПолное); // Для Услуги
	стррАтрибуты.Вставить("Коэффициент",	1); // Для Товары
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррАтрибуты.Вставить("НДСВидОперацииРеализации", Справочники.ВидыРеализации.РеализацияТМЗ);
	Иначе
		стррАтрибуты.Вставить("ЕдиницаИзмерения", Справочники.СтраныМира.НайтиПоНаименованию(Номенклатура.СтранаПроисхождения.Наименование));
	КонецЕсли;

	Возврат стррАтрибуты;
	
КонецФункции

Функция ПолучитьСтруктуруАтрибутовТЧПоступление(ТекстXML, УчитыватьНДС)
	
	стррАтрибуты = Новый Структура;
	Номенклатура = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A01"),"Номенклатура");
	стррАтрибуты.Вставить("Номенклатура",	Номенклатура);
	стррАтрибуты.Вставить("ИдЕдиницыИзм",	ТекстXML.ПолучитьАтрибут("A03"));
	стррАтрибуты.Вставить("Коэффициент",	1);
	стррАтрибуты.Вставить("Количество",		Число(ТекстXML.ПолучитьАтрибут("A04")));
	стррАтрибуты.Вставить("Цена",			Число(ТекстXML.ПолучитьАтрибут("A05")));
	стррАтрибуты.Вставить("Сумма",			Число(ТекстXML.ПолучитьАтрибут("A06")));
	//(( sk_190722 Добавляем ставку НДС в структуру атрибутов в рамках (MOD-523)
	//стррАтрибуты.Вставить("СтавкаНДС",		Номенклатура.СтавкаНДС);
	ДобавитьСтавкуНДСВСтруктуруАтрибутовТЧ(стррАтрибуты, УчитыватьНДС);
	//)) sk_190722
	стррАтрибуты.Вставить("СуммаНДС",		Число(ТекстXML.ПолучитьАтрибут("A07")));
	
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррАтрибуты.Вставить("ЕдиницаИзмерения", Номенклатура.БазоваяЕдиницаИзмерения);
	Иначе
		стррАтрибуты.Вставить("ЕдиницаИзмерения", Номенклатура.ЕдиницаИзмерения);
		стррАтрибуты.Вставить("СтранаПроисхождения", Номенклатура.СтранаПроисхождения.Ссылка);
	КонецЕсли;

	Возврат стррАтрибуты;
	
КонецФункции

Функция ПолучитьСтруктуруАтрибутовТЧПеремещение(ТекстXML)
	
	стррАтрибуты = Новый Структура;
	Номенклатура = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A01"),"Номенклатура");
	стррАтрибуты.Вставить("Номенклатура",	Номенклатура);
	стррАтрибуты.Вставить("ИдЕдиницыИзм",	ТекстXML.ПолучитьАтрибут("A03"));
	стррАтрибуты.Вставить("Коэффициент",	1);
	стррАтрибуты.Вставить("Количество",		Число(ТекстXML.ПолучитьАтрибут("A04")));
	
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррАтрибуты.Вставить("ЕдиницаИзмерения", Номенклатура.БазоваяЕдиницаИзмерения);
	Иначе
		стррАтрибуты.Вставить("Цена",			Число(ТекстXML.ПолучитьАтрибут("A05")));
		стррАтрибуты.Вставить("ЕдиницаИзмерения", Номенклатура.ЕдиницаИзмерения);
	КонецЕсли;

	Возврат стррАтрибуты;
	
КонецФункции

Функция ПолучитьСтруктуруАтрибутовТЧВозврат(ТекстXML, УчитыватьНДС = Неопределено)
	
	стррАтрибуты = Новый Структура;
	Номенклатура = СсылкаИзСправочника(ТекстXML.ПолучитьАтрибут("A01"),"Номенклатура");
	
	стррАтрибуты.Вставить("ИдЕдиницыИзм",	ТекстXML.ПолучитьАтрибут("A03"));
	стррАтрибуты.Вставить("Номенклатура",	Номенклатура);
	стррАтрибуты.Вставить("Количество",		Число(ТекстXML.ПолучитьАтрибут("A04")));
	стррАтрибуты.Вставить("Цена",			Число(ТекстXML.ПолучитьАтрибут("A05")));
	стррАтрибуты.Вставить("Сумма",			Число(ТекстXML.ПолучитьАтрибут("A06")));
	//(( sk_190722 Добавляем ставку НДС в структуру атрибутов в рамках (MOD-523)
	//стррАтрибуты.Вставить("СтавкаНДС",		Номенклатура.СтавкаНДС);
	ДобавитьСтавкуНДСВСтруктуруАтрибутовТЧ(стррАтрибуты);
	//)) sk_190722
	стррАтрибуты.Вставить("СуммаНДС",		Число(ТекстXML.ПолучитьАтрибут("A07")));
		
	Если гКонфигурация = "Бухгалтерия_KZ" Тогда
		стррАтрибуты.Вставить("ЕдиницаИзмерения", Номенклатура.БазоваяЕдиницаИзмерения);
		стррАтрибуты.Вставить("Коэффициент",	1);
	Иначе
		стррАтрибуты.Вставить("СтранаПроисхождения", Номенклатура.СтранаПроисхождения.Ссылка);
	КонецЕсли;

	Возврат стррАтрибуты;
	
КонецФункции

Функция ПолучитьМассивСчетов()
	мСчета = Новый Массив;
	мСчета.Добавить(ПланыСчетов.Типовой.СырьеИМатериалы.Ссылка);
	мСчета.Добавить(ПланыСчетов.Типовой.ГотоваяПродукция.Ссылка);
	мСчета.Добавить(ПланыСчетов.Типовой.Товары.Ссылка);
	Возврат мСчета;
КонецФункции
	
Процедура ЗаписатьСвойстваУОбъекта(ВладелецСвойств, ТаблицаСвойствИЗначений) Экспорт
	
	Если ТипЗнч(ВладелецСвойств) = Тип("СправочникСсылка.Контрагенты") Тогда
		Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты;
	ИначеЕсли ТипЗнч(ВладелецСвойств) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				ИЛИ ТипЗнч(ВладелецСвойств) = Тип("ДокументСсылка.СчетНаОплатуПокупателю")Тогда
		Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы;
	Иначе
		Возврат;
	КонецЕсли;
	
	МассивСвойств = ПолучитьСписокСвойств(Назначение);
	
	НачатьТранзакцию();
	Попытка
		Для Каждого ДопСвойство Из ТаблицаСвойствИЗначений Цикл
			Если МассивСвойств.Найти(ДопСвойство.Свойство) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		
			МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Объект = ВладелецСвойств;
			МенеджерЗаписи.Свойство = ДопСвойство.Свойство;
			МенеджерЗаписи.Значение = ДопСвойство.Значение;
			
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры	

Функция ПолучитьСписокСвойств(Назначение);
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СвойстваОбъектов.Ссылка КАК Свойство
		|ИЗ
		|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
		|ГДЕ
		|	СвойстваОбъектов.НазначениеСвойства = &НазначениеСвойства";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НазначениеСвойства", Назначение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Свойство");
		
КонецФункции		

// Создает массив и помещает в него переданное значение.
//
// Параметры:
//  Значение - Произвольный - любое значение.
//
// Возвращаемое значение:
//  Массив - массив из одного элемента.
//
Функция ЗначениеВМассиве(Значение) Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Значение);
	
	Возврат Массив;
	
КонецФункции

Функция ПолучитьСтавкуНДСДляОрдера()
	
	тзСтавок = Новый ТаблицаЗначений;
	тзСтавок.Колонки.Добавить("Ставка", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	тзСтавок.Колонки.Добавить("Значение");
	Текст = 
	"ВЫБРАТЬ
	|	СтавкиНДС.Ссылка КАК Ссылка
	|ИЗ
	|	Перечисление.СтавкиНДС КАК СтавкиНДС";
	
	Запрос = Новый Запрос(Текст);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = тзСтавок.Добавить();
		НоваяСтрока.Ставка = Выборка.Ссылка;
		НоваяСтрока.Значение = СтавкаНДСЧислом(Выборка.Ссылка);
	КонецЦикла;
	
	тзСтавок.Сортировать("Значение Убыв");
	
	Возврат тзСтавок[0].Ставка;
	
КонецФункции
	
Функция ПолучитьВалютныеДанные(ВалютаДокумента, ВалютаДоговора, Сумма)
	
	стррВозврат = Новый Структура;
	стррВозврат.Вставить("КурсВзаиморасчетов", 1);
	стррВозврат.Вставить("СуммаВзаиморасчетов", Сумма);
	стррВозврат.Вставить("КратностьВзаиморасчетов", 1);
	
	Если ВалютаДокумента = ВалютаДоговора Тогда
		Возврат стррВозврат;
	Иначе
		ДанныеКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДоговора, ТекущаяДата());
		стррВозврат.Вставить("КурсВзаиморасчетов", ДанныеКурса.Курс);
		стррВозврат.Вставить("КратностьВзаиморасчетов", ДанныеКурса.Кратность);
		стррВозврат.Вставить("СуммаВзаиморасчетов", РаботаСКурсамиВалют.ПересчитатьВВалюту(Сумма, ВалютаДокумента, ВалютаДоговора, ТекущаяДата()));
		Возврат стррВозврат;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКатегориюДокумента(ИдКатегории)
	
	тзКатегории = ВременныеТаблицы.КатегорииДокументов;
	стрКатегории = тзКатегории.Найти(Новый УникальныйИдентификатор(НРег(ИдКатегории)), "Идентификатор");
	Возврат ?(стрКатегории = Неопределено, "", стрКатегории.Наименование);
	
КонецФункции

//dm_180817 Вынес создание таблицы упаковок в отдельную функцию
Функция СоздатьТаблицуУпаковок(ДляВыгрузки = Истина)
	
	КвалификаторыСтроки = Новый КвалификаторыСтроки(40);
	КвалификаторыЧислаПУ = Новый КвалификаторыЧисла(1,0,ДопустимыйЗнак.Неотрицательный);
	КвалификаторыЧислаК = Новый КвалификаторыЧисла(3,3,ДопустимыйЗнак.Неотрицательный);
	тзУпаковки = Новый ТаблицаЗначений;
	тзУпаковки.Колонки.Добавить("Код");
	тзУпаковки.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , , ,КвалификаторыСтроки));
	тзУпаковки.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", , , КвалификаторыЧислаК));
	тзУпаковки.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	тзУпаковки.Колонки.Добавить("ЕдиницаИзмеренияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	тзУпаковки.Колонки.Добавить("УникальныйИдентификатор", ?(ДляВыгрузки, Новый ОписаниеТипов("Строка", , , ,КвалификаторыСтроки), Новый ОписаниеТипов("УникальныйИдентификатор")));
	тзУпаковки.Колонки.Добавить("ПометкаУдаления", Новый ОписаниеТипов("Число", , , КвалификаторыЧислаПУ));
	
	Возврат тзУпаковки;
	
КонецФункции
	
	
	
//{{dm_180424-180626


// СлужебныеПроцедурыИФункции
#КонецОбласти

#Область УТАП_KT2000_Alcohol_Trade

Процедура ВыгрузитьКонтрагентов_УТАП(ДокОбмена, МенеджерВТ)
	
	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.Контрагенты");
	
	РезультатВыборки = ДанныеПоКонтрагентамДляВыгрузки_УТАП(МенеджерВТ);
	Выборка = РезультатВыборки.Выбрать();
	
	стррПоля = Новый Структура("GUID,Name,A012,A013,A022,A023");
	
	Пока Выборка.Следующий() Цикл
		ВыборкаСсылка = Выборка.Ссылка;
		стррПоля.GUID = ВыборкаСсылка.УникальныйИдентификатор();
		стррПоля.Name = Выборка.Наименование;
		стррПоля.A012 = СокрЛП(ВыборкаСсылка.НаименованиеПолное);
		ПредставлениеИННКПП = Выборка.ИНН + ?(ПустаяСтрока(Выборка.ИНН), "", "/") + Выборка.КПП;
		стррПоля.A013 = ПредставлениеИННКПП;
		стррПоля.A022 = Выборка.КодПоОКПО;
		стррПоля.A023 = Выборка.ДополнительнаяИнформация;
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
	КонецЦикла;
	
	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);
	
КонецПроцедуры

Процедура ВыгрузитьПунктыРазгрузки_УТАП(ДокОбмена, МенеджерВТ)
	
	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.ТорговыеТочки"); // в МТ этот справочник называется "ТорговыеТочки"

	стррПоля = Новый Структура("GUID,Name,A02,A07");	
	
	РезультатВыборки = ДанныеПоПунктамРазгрузокДляВыгрузки_УТАП(МенеджерВТ);
	Выборка = РезультатВыборки.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стррПоля.GUID 	= Выборка.Ссылка.УникальныйИдентификатор();
		стррПоля.Name 	= Выборка.Наименование;
		стррПоля.A02	= Выборка.Контрагент;
		стррПоля.A07	= Выборка.ДополнительнаяИнформация;
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
	КонецЦикла;

	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);
	
КонецПроцедуры

Процедура ВыгрузитьКонтактнуюИнформацию_УТАП_ПунктыРазгрузок(ДокОбмена, МенеджерВТ)
	
	ЗаписатьНачалоВеткиОбъекта(ДокОбмена, "Справочник.КонтактнаяИнформация");

	ствТипыКИ = ТипыКонтактнойИнформации();
	стррПоля = Новый Структура("GUID,A01,A02,A04,A05,A06");
	
	РезультатЗапроса = ДанныеПоКонтактамПунктовРазгрузокИКонтрагентов_УТАП(МенеджерВТ);
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стррПоля.GUID = Новый УникальныйИдентификатор();
		стррПоля.A01 = Выборка.Контрагент;
		стррПоля.A02 = Выборка.ПунктРазгрузки;
		стррПоля.A04 = ствТипыКИ[Выборка.Тип];
		стррПоля.A05 = Выборка.Вид;
		стррПоля.A06 = Выборка.Представление;
		ЗаписатьЭлементВДокументОбмена(ДокОбмена, стррПоля);
	КонецЦикла;

	ЗаписатьОкончаниеВеткиОбъекта(ДокОбмена);
	
КонецПроцедуры

Функция ДанныеПоПунктамРазгрузокДляВыгрузки_УТАП(МенеджерВТ)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПунктыРазгрузки.Ссылка,
	|	ПунктыРазгрузки.Наименование,
	|	ПунктыРазгрузки.Контрагент,
	|	ПунктыРазгрузки.КодОКАТО + ПунктыРазгрузки.КПП КАК ДополнительнаяИнформация
	|ИЗ
	|	(ВЫБРАТЬ
	|		алкПунктыРазгрузки.Ссылка КАК Ссылка,
	|		алкПунктыРазгрузки.Наименование КАК Наименование,
	|		алкПунктыРазгрузки.Владелец КАК Контрагент,
	|		ВЫБОР
	|			КОГДА алкПунктыРазгрузки.КодОКАТО <> """"
	|				ТОГДА ""КодОКАТО:"" + алкПунктыРазгрузки.КодОКАТО + ""/""
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК КодОКАТО,
	|		ВЫБОР
	|			КОГДА алкПунктыРазгрузки.КПП <> """"
	|				ТОГДА ""КПП:"" + алкПунктыРазгрузки.КПП
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК КПП
	|	ИЗ
	|		ВТ_Контрагенты КАК ВТ_Контрагенты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.алкПунктыРазгрузки КАК алкПунктыРазгрузки
	|			ПО ВТ_Контрагенты.Ссылка = алкПунктыРазгрузки.Владелец
	|	ГДЕ
	|		НЕ алкПунктыРазгрузки.ПометкаУдаления) КАК ПунктыРазгрузки";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	Возврат Запрос.Выполнить();
	
КонецФункции 

Функция ДанныеПоКонтрагентамДляВыгрузки_УТАП(МенеджерВТ)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.КодПоОКПО,
	|	Контрагенты.ДополнительнаяИнформация
	|ИЗ
	|	ВТ_Контрагенты КАК ВТ_Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_Контрагенты.Ссылка = Контрагенты.Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Возврат Запрос.Выполнить();
	
КонецФункции 

Функция ДанныеПоКонтактамПунктовРазгрузокИКонтрагентов_УТАП(МенеджерВТ)
	
	Текстзапроса =
	"ВЫБРАТЬ
	|	алкПунктыРазгрузкиКонтактнаяИнформация.Ссылка КАК ПунктРазгрузки,
	|	NULL КАК Контрагент,
	|	алкПунктыРазгрузкиКонтактнаяИнформация.Тип,
	|	алкПунктыРазгрузкиКонтактнаяИнформация.Вид,
	|	алкПунктыРазгрузкиКонтактнаяИнформация.Представление
	|ПОМЕСТИТЬ КИПартнеров
	|ИЗ
	|	Справочник.алкПунктыРазгрузки КАК алкПунктыРазгрузки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Контрагенты КАК ВТ_Контрагенты
	|		ПО алкПунктыРазгрузки.Владелец = ВТ_Контрагенты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.алкПунктыРазгрузки.КонтактнаяИнформация КАК алкПунктыРазгрузкиКонтактнаяИнформация
	|		ПО алкПунктыРазгрузки.Ссылка = алкПунктыРазгрузкиКонтактнаяИнформация.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	КонтрагентыКонтактнаяИнформация.Ссылка,
	|	КонтрагентыКонтактнаяИнформация.Тип,
	|	КонтрагентыКонтактнаяИнформация.Вид,
	|	КонтрагентыКонтактнаяИнформация.Представление
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Контрагенты КАК ВТ_Контрагенты
	|		ПО КонтрагентыКонтактнаяИнформация.Ссылка = ВТ_Контрагенты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КИПартнеров.ПунктРазгрузки, """") КАК ПунктРазгрузки,
	|	ЕСТЬNULL(КИПартнеров.Контрагент, """") КАК Контрагент,
	|	КИПартнеров.Тип,
	|	КИПартнеров.Вид,
	|	КИПартнеров.Представление
	|ИЗ
	|	КИПартнеров КАК КИПартнеров";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	Возврат Запрос.Выполнить();

КонецФункции

// УТАП_KT2000_Alcohol_Trade
#КонецОбласти

//+dm_13.10.17
#Область КонтрольЗапускаОбработки

//Функция ОтправкаЗапроса()
// 
//	ssl = Новый ЗащищенноеСоединениеOpenSSL;
//	Адрес = "vnedrenium.com";
//	Попытка
//		Соединение = Новый HTTPСоединение(Адрес,,,,,,ssl);
//	Исключение
//		Возврат Ложь;
//	КонецПопытки;

////Выполняется файл requests.php
//		НаименованиеКонфигурации 	= Метаданные.Имя;
//		СтранаГород 				= ИнформацияИз2IP();

//	//РесурсНаСервере = "requests.php?company=" + Организация + "&emailadress=" + ЭлПочта + "&employee="+ ФИО + "&phone=" + Телефон + "&text=" + Сообщение + "&theme=" + ТемаОбращения + "&date=" + ТекущаяДата();  
//	РесурсНаСервере = "write.php?base=" + НаименованиеКонфигурации + "&ip=" + СтранаГород + "&date=" + ТекущаяДата();   
//	HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
//	HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json; charset=utf-8");
// 
//	Попытка 
//		РезультатЗапроса = Соединение.Получить(HTTPЗапрос);
//		Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
//		Если ПустаяСтрока(Ответ) тогда
//			Возврат Истина;
//		Иначе
//			Возврат Ложь;
//		КонецЕсли;
//	Исключение 
//	КонецПопытки;
//	
//	Возврат Ложь; 
// 
//КонецФункции

Процедура ОтправитьСтатистическуюИнформациюНаСервер(РежимСтатистики, ПервыйЗапуск) Экспорт
//СертификатКлиентаWindows = Новый СертификатКлиентаWindows(СпособВыбораСертификатаWindows.Выбирать);
//СертификатыУдостоверяющихЦентровWindows = Новый СертификатыУдостоверяющихЦентровWindows();
//ssl = Новый ЗащищенноеСоединениеOpenSSL(СертификатКлиентаWindows, СертификатыУдостоверяющихЦентровWindows);
	//СтатистикаД = ПолучитьНастройкиСтатистикаОбратнаяСвязь();
	//ДатаВ =   СтатистикаД.Получить("ДатаВыгрузки");
	//Если ДатаВ <> Формат(ТекущаяДата(),"ДФ = дд.ММ.гггг") или ДатаВ = Дата('00010101') тогда
 
		//Компания 		= СтатистикаД.Получить("Организация");
		//ИмяСотрудника 	= СтатистикаД.Получить("ФИО");
		//Телефон 		= СтатистикаД.Получить("Телефон");
		//Флаг 			= СтатистикаД.Получить("БольшеНеПоказывать");
		//Почта 			= СтатистикаД.Получить("Почта");
		ssl 			= Новый ЗащищенноеСоединениеOpenSSL;
		Адрес 			= "vnedrenium.com";
		Попытка
			Соединение = Новый HTTPСоединение(Адрес,,,,,,ssl);
		Исключение
			Возврат;
		КонецПопытки;
  
		НаименованиеКонфигурации 	= Метаданные.Имя;
		СтранаГород 				= ИнформацияИз2IP();
		//+dm_13.10.17
		//Статистика = ХранилищеСистемныхНастроек.Загрузить("ДанныеСтатистики", "Статистика",, "Пользователь");
		//Если Статистика = Неопределено Тогда
		//	Статистика = Истина;
		//	РежимСтатистики = "Начало запуска";
			Впервые = ?(ПервыйЗапуск, "Впервые", "");
		//Иначе
			//ХранилищеСистемныхНастроек.Удалить("ДанныеСтатистики", "Статистика", "Пользователь");
		//-dm_13.10.17
  
		//Выполняется файл write.php
		//ФлагОтправлятьСтатистику = Ложь; //СтатистикаД.Получить("ФлагОтправлятьСтатистику");
		//Если ФлагОтправлятьСтатистику тогда
		//	РесурсНаСервере = "write.php?base=" + НаименованиеКонфигурации + "&ip=" + СтранаГород + "&name="+ ИмяСотрудника + "&company=" + Компания + "&phone=" + Телефон;   
		//Иначе
			РесурсНаСервере = "write.php?base=" + НаименованиеКонфигурации + "&ip=" + СтранаГород + "&date=" + ТекущаяДата() + "&name=" + РежимСтатистики + "&company=" + Впервые + "&phone=" + "";  
		//КонецЕсли;
  
		HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
		HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json; charset=utf-8");
 
		//HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		Попытка 
			РезультатЗапроса = Соединение.Получить(HTTPЗапрос);// Вставить содержимое обработчика.
			Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
		Исключение 
		КонецПопытки;
		//+dm_13.10.17
		//ХранилищеСистемныхНастроек.Сохранить("ДанныеСтатистики", "Статистика", Статистика,, "Пользователь");
		//-dm_13.10.17
		//СозданиеНастроекСтатистикаОбратнаяСвязь(Компания,ИмяСотрудника,Телефон,Флаг,Формат(ТекущаяДата(),"ДФ = дд.ММ.гггг"),Почта,ФлагОтправлятьСтатистику);
	//КонецЕсли;

КонецПроцедуры
//Альфия 16.06.2017


//Альфия 15.06.2017
Функция ИнформацияИз2IP () Экспорт
	//Создаем HTTP-подключение
	ssl 		= Новый ЗащищенноеСоединениеOpenSSL;
	ЗапросHTTP 	= Новый HTTPСоединение("2ip.ru",,,,,,ssl);
	
	// Создаем временный файл для записи HTML-текста веб-страницы
	ВременныйФайл = ПолучитьИмяВременногоФайла();
	
	// Выполняем запрос и записываем текст страницы во временный файл
	ЗапросHTTP.Получить("/",ВременныйФайл);
	
	// Считываем содержимое временного файла
	ТекДок = Новый ТекстовыйДокумент;
	ТекДок.Прочитать(ВременныйФайл,КодировкаТекста.UTF8);
	Для Сч = 1 По ТекДок.КоличествоСтрок() Цикл
		Стр=ТекДок.ПолучитьСтроку(Сч);
  
		// Находим строку с IP-адресом
		СтрПоиска1 =  "<big id=""d_clip_button"">";
		СтрПоиска2 =  "</big>";
		Поз1 = Найти(Стр,СтрПоиска1); 
		Если Поз1 <> 0 Тогда
			Поз1 = Поз1 + СтрДлина(СтрПоиска1);
			Поз2 = Найти(Стр,СтрПоиска2);
			IP = Сред(Стр,Поз1,Поз2-Поз1);
		КонецЕсли;
  
		// Находим строку с Местоположением
		СтрПоиска1 = "href=""/geoip/""/>";
		СтрПоиска2 = "</a>";
		Поз1 = Найти(Стр,СтрПоиска1);
		Если Поз1 <> 0 Тогда
			Поз1 = Поз1 + СтрДлина(СтрПоиска1);
			Поз2 = Найти(Стр,СтрПоиска2);
			СтранаАдрес = Сред(Стр,Поз1,Поз2-Поз1);
			УдалитьФайлы(ВременныйФайл);
			Возврат СтранаАдрес;
			//Страна = Лев(СтранаАдрес,Найти(СтранаАдрес,",")-1);
			//Город = Прав(СтранаАдрес,СтрДлина(СтранаАдрес)-Найти(СтранаАдрес," "))
		КонецЕсли;
  
	КонецЦикла;
	// Удаляем временный файл
	УдалитьФайлы(ВременныйФайл);
	Возврат "";
КонецФункции

//Процедура СозданиеНастроекСтатистикаОбратнаяСвязь(Орг,ФИО,Номер,Флаг=Ложь,ДатаВыгрузки,Почта,Статус)
//	
//	Данные = Новый Соответствие;
//	Данные.Вставить("Организация",Орг);
//	Данные.Вставить("ФИО",ФИО);
//	Данные.Вставить("Телефон",Номер); 
//	Данные.Вставить("БольшеНеПоказывать",Флаг);
//	Данные.Вставить("Почта",Почта);
//	Данные.Вставить("ДатаВыгрузки",ДатаВыгрузки);
//	Данные.Вставить("ФлагОтправлятьСтатистику",Статус);
//	ХранилищеСистемныхНастроек.Сохранить("Статистика","Данные",Данные,,Неопределено); 
//	
//КонецПроцедуры

//Функция ПолучитьНастройкиСтатистикаОбратнаяСвязь()
//	
//	Возврат ХранилищеСистемныхНастроек.Загрузить("Статистика", "Данные",, Неопределено);
//	
//КонецФункции





#КонецОбласти
