
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтррКонтекст = Новый Структура("Страницы,ПутьКСправке");
	ИнициализироватьСвязиРазделовСправки();
	
	СтррКонтекст.ПутьКСправке = "https://help.agentplus.online/mtbase/ut11/v1/";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = Истина;
КонецПроцедуры

// ОбработчикиСобытийФормы
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьСвязиРазделовСправки()
	
	ствСтраницы = Новый Соответствие;
	
	// Главная страница
	ствСтраницы.Вставить("ГлавнаяФорма", 				"obshchaya_informatsiya");
	ствСтраницы.Вставить("ГлавнаяФорма_Главная", 		"domashnyaya_stranitsa");
	ствСтраницы.Вставить("ГлавнаяФорма_ОбменДанными", 	"obmen_dannymi");
	ствСтраницы.Вставить("ГлавнаяФорма_Справочники", 	"spravochniki_1");
	ствСтраницы.Вставить("ГлавнаяФорма_ПланированиеИКонтроль", 	"planirovanie_i_kontrol");
	ствСтраницы.Вставить("ГлавнаяФорма_Сервис", 		"servis");
	ствСтраницы.Вставить("ГлавнаяФорма_Помощь", 		"pomoshch");
	
	ствСтраницы.Вставить("ЛичныйКабинет", 				"nastrojka_dostupa_v_lichnyj_kabinet");
	
	// Справочники
	ствСтраницы.Вставить("НастройкиАгентов",			"torgovye_agenty");
	ствСтраницы.Вставить("МобильныеУстройства",			"mobilnye_ustrojstva");
	ствСтраницы.Вставить("СпискиТорговыхТочек",			"spiski_torgovykh_tochek");
	
	// Общие настройки
	ствСтраницы.Вставить("НастройкиМодуля", 					"obshchie_nastrojki");
	ствСтраницы.Вставить("НастройкиМодуля_ГруппаОсновные", 		"vkladka__osnovnye_");
	ствСтраницы.Вставить("НастройкиМодуля_ГруппаДополнительно", "vkladka__dopolnitelno__2");
	ствСтраницы.Вставить("НастройкиМодуля_ГруппаКаталоги", 		"vkladka__katalogi_");
	
	// Настройка мобильного приложения
	ствСтраницы.Вставить("НастройкиМобильногоПриложения", 		"nastrojka_mobilnogo_prilozheniya_na_ustrojstve"); // gi_170914
	
	ствСтраницы.Вставить("НастройкиМодуля_КаталогДанныхДляСервера_Windows", "katalog_dannykh_na_servere_windows");
	ствСтраницы.Вставить("НастройкиМодуля_КаталогДанныхДляСервера_Linux", 	"katalog_dannykh_na_servere_linux");	
	
	// Планирование и контроль
	ствСтраницы.Вставить("ОтчетВыполнениеПланаПосещений", 		"vypolnenie_plana_poseshchenij"); 			// gi_170909
	ствСтраницы.Вставить("ОтчетКонтрольПередвиженийАгентов", 	"kontrol_peredvizhenij_torgovykh_agentov"); // gi_170909
	ствСтраницы.Вставить("РедакторМеток", 						"zapolnit_koordinaty_partnerov"); // gi_170902	
	
	СтррКонтекст.Страницы = ствСтраницы;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнийВызовОткрытьСправку(Знач СтраницаСправки) Экспорт
	
	Если Найти(СтраницаСправки, ".") <> 0 Тогда // передан путь к форме с разделителем "."
		ИмяПослеТочки = "";
		Индекс = СтрДлина(СтраницаСправки);
		Символ = Сред(СтраницаСправки, Индекс, 1);
		Пока Символ <> "." Цикл
			ИмяПослеТочки = Символ + ИмяПослеТочки;
			Индекс = Индекс - 1;
			Символ = Сред(СтраницаСправки, Индекс, 1);
		КонецЦикла;
		СтраницаСправки = ИмяПослеТочки;
	КонецЕсли; 
	
	ИдентификаторРаздела = СтррКонтекст.Страницы.Получить(СтраницаСправки);
	
	Если ИдентификаторРаздела = Неопределено Тогда
		ИдентификаторРаздела = "index";
	КонецЕсли;
	
	ИмяФайла = ИдентификаторРаздела + ".htm";
	
	ЗапуститьПриложение(СтррКонтекст.ПутьКСправке + ИмяФайла);
	
КонецПроцедуры

// СлужебныеПроцедурыИФункции
#КонецОбласти
